[{"title": "Credit cards / financing", "content": "Did any of you open new credits cards to pay for any and all ivf related treatments? While insurance is covering the actual procedures (thank god), there are still a lot of out of pocket costs, into the thousands already. Curious if anyone can recommend a good card to be used either at pharmacies or that gets points for hitting a certain target number in the first few months of use. \nThanks for your help!!", "num_comments": 11, "score": 2, "top_comments": ["Did not use a credit card but did think about it at one point. The best credit cards with low annual fees for just general cash back from nerd wallet seem to be:\n\n1. Chase Freedom Unlimter - $0 annual fee, 1.5-5% cashback, intro offer of unlimited matched cash back\n\n2. Chase Sapphire Preferred - $95 annual fee, 1-5x points, 60,000 points for intro offer  \n\n3. Discover IT cash back - $0 annual fee, 1-5% cashback, cashback match as intro offer\n\nI’d also throw out two more specific options:\n\n1. Amazon chase credit card - if you have prime you get 5-6% back on Amazon/WF purchases then 1-2% on everything else. This is great card for post-ivf life if you spend a lot at Amazon/WF and since it’s chase you can transfer points to a different chase card, like the sapphire which has better travel redemption. \n\n2. Marriott bonvoy amex - $250 or $650 annual fee depending on which card you get, but you get 6x points on Marriott spend then 2x points on everything else (as well as a few other perks like dining credit). This is another great post-ivf card if you travel. I travel a lot of for work, and my husband and I travel a decent amount personally, and this card is so easy to wrack up points/marriott status. Just the points we get from our daily spend throughout the year tends to be enough to pay for our hotel for any trip for 7-10 days. Plus, since you get Marriott status, we can book the base room with points then get upgraded at no cost.", "we used a capital one card! 0% for 18 months and about to finally pay it off 🥳"], "link": "/r/IVF/comments/193gtuz/credit_cards_financing/"}, {"title": "Does CNY fertility accept CareCredit?", "content": "Has anyone used CareCredit through them?", "num_comments": 0, "score": 2, "top_comments": [], "link": "/r/IVF/comments/13k56v5/does_cny_fertility_accept_carecredit/"}, {"title": "Best credit card for IVF self-pay?", "content": "Has anyone used credit card signup bonuses or cash back cards as a means to reduce costs when self paying for IVF?\n\nI found that the Fidelity credit card and the Wells Fargo active cash credit card give 2% back but are there any better cards? \n\nSome cards offer up to 15 months no interest which seems better than a loan.", "num_comments": 18, "score": 14, "top_comments": ["Instead of going to cash back, I went for points and signed up for the Chase Sapphire Preferred and the Amex Platinum, which was running 15x points for small businesses on your first 25k.  The doctor and specialty pharmacy both are small businesses.  I netted about 500,000 points the the promos on those two cards.", "I did Chase and I think it was like a $500 bonus plus they give 3% back on pharmacies/healthcare so all of my meds have good cash back.", "I travel for work so we use the points and cash back system to our advantage.\n\n1. AMEX is great for points but I would get on specifically for an airline or hotel. You would earn free airfare with the Delta card with status at the amount you’ll be spending. Hotel is the same.\n\n2. Capital One usually offers 18 months interest free and has great cash back options.\n\n3. I’d only use discover for balance transfers.\n\n4. Citicard also has some great options but it’s not one I’m currently using.\n\nI use my Delta and Hilton Amex the most and we plan on taking a budget friendly trip using those points!"], "link": "/r/IVF/comments/tpucfg/best_credit_card_for_ivf_selfpay/"}, {"title": "Does your credit card being charged mean PGT testing is complete? I just got an email to let me know my credit card was charged. This is day 6 of waiting for my results. Wonder if that means my results are ready?!!", "content": "", "num_comments": 24, "score": 3, "top_comments": ["We were working with Igenomix and they said once they charge your credit card, that means the results are released to the clinic. When your clinic calls you though is another issue (ours didn’t call us for another 2 days 😒)", "Is it possible to ask Igonemix directly for your results? Our clinic tells us at our follow up which tends to be a full month later. This annoys me no end because it’s my data and I feel like I should have a right to see it when it’s done. Wondering if others have gotten it directly when it’s done. Thanks!", "Nope. I know ow yhe wait is frustrating, but billing is a separate department and I wouldn't make that assumption."], "link": "/r/IVF/comments/wqpeks/does_your_credit_card_being_charged_mean_pgt/"}, {"title": "Oh IVF emotions.. Do you ever just cry on the phone to a credit card company?", "content": "I am going to start stims tomorrow for my first IVF cycle. We are paying out of pocket and I did research to see what cc would provide the best cash back benefits. They only offered an 11,000 credit limit (which of course didn’t cover the cycle). I must have typed my routing number wrong for the first transaction because the amount didn’t go through and they immediately canceled my cc account. I had already paid full amount and then charged again for my meds which of course exceeded the limit. I was on the phone with them this morning and I was overcome with a wave of tears and emotion. All while the rep is telling me “Ma’am you’re not letting me talk”. It’s all just so unfair. Unfair about having to do IVF, unfair for having to pay for it because of my stupid insurance that costs me so much but covers so little and unfair for getting punished for a payment that didn’t go through for a silly typo.", "num_comments": 2, "score": 17, "top_comments": ["It could also be over the monetary limit for your card. Banks will have a daily transaction limit. If that’s the reason they can probably do a temporary increase. \n\nI definitely agree about the feelings of unfairness about it all."], "link": "/r/IVF/comments/137pm3o/oh_ivf_emotions_do_you_ever_just_cry_on_the_phone/"}, {"title": "United Medical v Care Credit", "content": "My doctor does not take Care Credit, but they do take United Medical Credit. Has anyone had experience with the latter? Is it like a loan with monthly payments, or is it more like a credit card?", "num_comments": 3, "score": 1, "top_comments": ["I’m bummed no responses yet. I was also looking into this. My clinic partners with them. The clinic charges a hefty 6% processing fee and I’m not sure if it’s worth it. Maybe for no interest. They do advertise that as an option with good enough credit. Let me know if you try them!"], "link": "/r/IVF/comments/qvde2a/united_medical_v_care_credit/"}, {"title": "Where credit is due", "content": "❤️Just wanted to post a shout out to all the Doctors, Nurses, Phlebotomists, Lab Techs and ultrasound techs working hard this holiday and taking time away from their families so we can create ours. ❤️", "num_comments": 0, "score": 92, "top_comments": [], "link": "/r/IVF/comments/efhewe/where_credit_is_due/"}, {"title": "Question for the grads: What was more stressful for you, IVF or pregnancy?", "content": "Was venting to a friend about how stressful and taxing the IVF process is, both emotionally and physically. She keeps telling me “just wait til you get pregnant, you have no idea”.  She is certain pregnancy is far worse than IVF.  She never went through IVF.  Her one pregnancy was a *surprise*, and not high risk or anything.   Just curious what everyone’s thoughts were.  \n\nEdit: Wow- I really appreciate all of these validating replies! It’s so interesting to hear how different everyone’s experiences are.  My main take away from this is that women are so fucking strong and we don’t get enough credit for all of the things we endure for our families.  You all amaze me.  ", "num_comments": 282, "score": 83, "top_comments": ["I really dislike the “oh you just wait” comments. She can f-off.", "Wow I had a lot of reactions to that comment, none of which are fit to print….what a horrible thing to say. Having never experienced ivf, the trauma of infertility and realignment of an entire worldview as a result, she’s absolutely unqualified to pipe in.", "Honestly, pregnancy was worse for me. I felt like crap the entire time, barfed for 16 weeks, couldn’t sleep between insomnia and peeing about 9 times per night, had maybe a two week reprieve before I was so swollen I once had to go to the ER, and then delivered early when I developed HELLP Syndrome and preeclampsia. \n\nThing is though, I had to do all that AND IVF to get a baby. You might have a good or bad pregnancy but having to do IVF on top is still so hard and your friend is a dick who completely lacks the ability to empathise.", "Respectfully,  or not so much, SHE is the one who has no idea. \n\nThe hardest part of pregnancy after IVF for me so far has been the PTSD I have from my years of miscarriage and IVF. Checking for blood when I wipe, wondering if every pain is the moment something is going wrong, the conflicting feels around ultrasounds and labs because you’re excited to see your baby but terrified of the news that could accompany that appointment… \n\nAny time some throws one of those “just wait…” comments at me I sometimes not so gracefully remind them how I cannot wait to finally experience those things after the hell I put myself through just to get to this point and that they are privileged to hold that perspective. \n\nI’m heading into my third trimester with our IVF baby and I would do pregnancy over and over again.", "Your friend’s comment is dumb and insensitive. \nHowever, at 33w2d pregnant I can tell you that I am still incredibly stressed. That said, I’m pretty confident the anxiety is BECAUSE of the prior loss/infertility, and that I’d be having a lot easier of a time without that emotional baggage. Loss/infertility/IVF is fucking hard and changes how you view everything going forward. \nSending best wishes to you in your journey.", "Your friend sounds like a jerk, although tbh I did not find IVF stressful and nor am I finding pregnancy stressful.", "Still pregnant but I would say it’s different? With IVF the unknowns and the waiting felt like slow moving torture. The peaks and valleys wore me out, I felt like I was held hostage my possibilities but nothing was certain. \n\nThen when I finally had success, I worried constantly about the rug being pulled out from underneath me (part of me still worried about that everyday a week out from my c-section). In the first trimester the physical symptoms of pregnancy nearly broke me emotionally, that was really hard (lost 15+ pounds due to nausea and throwing up) but still I had something I was looking forward to that I’d waited so long for so that helped.", "1) That's a terrible thing to say to someone, and I'm sorry she said that to you.\n\n2) Given that she hasn't gone through IVF, she has no idea what she's talking about. Yes, being pregnant is stressful but how on earth could she compare her experience of being pregnant to your experience of IVF and what your experience being pregnant will be like?\n\n3) I think they're different. With IVF (and often all the disappointment you had even leading up to IVF), you're used to things not working and hearing bad news. Being pregnant is hard, especially the first half of the pregnancy (IMO) because there's so many things that can go wrong...you have to make sure the pregnancy isn't ectopic, you have to make sure it's not a chemical, you have to make sure there's a heartbeat, then you have to make sure the heartbeat is fast enough, then you graduate from the clinic and have to wait to see your OB, then you do NIPT testing, then the NT scan, then waiting until the anatomy scan, etc.  \n\n\nTW success:\n\nI was very stressed at the beginning of my pregnancy but felt much better once I graduated from my clinic. The worries are still there, but they get better as I hit each milestone. I'm about 18 weeks now and the anatomy scan in 2 weeks is what I view as the last big hurdle to get through to make sure there isn't anything wrong. Assuming that goes well, I feel pretty good that I'll be able to enjoy the rest of my pregnancy.\n\nI hope pregnancy isn't more stressful for you, but whatever comes your way, I know you can handle it because you're an IVF warrior and have dealt with so much already.", "I absolutely hate the “just wait until x, y, z comments.\n\nTrigger warning for pregnancy complications and prematurity ⚠️\n\nPregnancy was absolutely easier than IVF until it went south and I delivered baby in an urgent c section at 24+1 due to severe early onset preeclampsia. The NICU stay was the hardest season of my life hands down. The day my precious son was born was the worst day of my life, and I absolutely have PTSD from the NICU stay.\n\nThe worst part for me was not belonging in the infertility community anymore because all that mattered was that I had a “take home baby.” And not really feeling like I belonged in most parenting groups because of everything we went through, infertility, IVF, preeclampsia, extreme prematurity. Even in some of my infertility groups that welcomed success stories, no one wanted to hear mine because it was a horror story. Even still in places like this thread I have to put a trigger warning on my one and only birth experience.\n\nMy kiddo did survive, he’s turning four this week, his lungs put him at high risk and we’ve lost so much trying to keep him healthy in a pandemic world. But he’s absolutely worth every single thing we’ve gone through to get here to him, and even with my trauma and his health concerns, I wouldn’t change a thing because if things hadn’t gone how they did we might not have ended up with him.\n\nBut the “just wait” comments never flipping end in parenting either. Like “oh you had an easy two year old, just wait for three!” Actually three has been forking delightful and I have loved every stage post NICU, but more and more as his personality has shone through.\n\nSometimes I wonder if after all we went through to be parents we just have a deeper appreciation for this season", "[deleted]", "I think this will vary by person because some people spend years doing IVF and some people get really sick during pregnancy. I think pregnancy is a lot harder for me because I don’t feel well whereas I still felt ok during IVF.", "It’s like asking which is harder- running a marathon or a powerlifting competition. \n\nI truly think pregnancy was more stressful, especially after 5 miscarriages. IVF was lighting a lot of money on fire, wondering if it was going to work. \n\nPregnancy was waking up every day and wondering if I was unknowingly walking around with a dead baby in me. \n\nI also had severe hyperemesis gravidarum in both pregnancies with my living kids, so I had the additional stress of being so sick and dehydrated that I openly welcomed the thought of death for myself many days. \n\nIt was not a good time. \n\nI’m thankful for my children, but pregnancy was one of the worst things I’ve ever endured", "While I don’t think someone who hasn’t been through IVf can speak to this, It also highly depends on your pregnancies. For my first 2 I’d say IVF. The last 2 however I was throwing up until delivery, never had a moment where I didnt feel physically sick until the baby was out both times and it was the most physically and emotionally exhausting thing I’ve ever done. The first of those last 2 pregnancies I also had GD and placenta previa and was paranoid the whole pregnancy about bleeding.", "Physically IVF, emotionally pregnancy but that was really due to my situation. I had seven miscarriages before my successful pregnancy. I expected every day for 39 weeks to wake up and to have lost my baby. Many days I was completely unable to function. Physically my pregnancy was a breeze, so compared to IVF in that regard, definitely easier. If baby girl wasn't moving, I wouldn't feel pregnant at all. And I was 37 so I expected to feel awful, but I barely had a belly at the end and no swelling until 38 weeks.", "The way i've described pregnancy post IVF is like running a second marathon after you've JUST finished the first one. Yes there are a lot of other people who are running the marathon alongside you, but you're already exhausted from your first marathon so each step feels so much more difficult. I was actually lucky enough to have a really good pregnancy experience for the most part. I was pretty anxious during first tri especially because I had some bleeding episodes, plus the shots every day were a constant reminder of the anxiety of IVF, but once those stopped and I got the NIPT results back it was one of the most enjoyable times of my life up till then!\n\nI think your friend is being a bit tone deaf, but then people who haven't been through IVF don't have a clue of the emotional and sometimes physical toll it can take. The anxiety of waiting for the embryologist's report after an egg retrieval was excruciating! People don't put all this time, effort, and money into something they only halfheartedly want, and it's *hard* to want something so badly and be both powerless to make it happen AND watch it happen effortlessly for so many others. \n\nI hope it happens for you soon, friend. Wishing you the best 💜🫂", "Hmmmmmm\n\nFirst of all, I honestly think those who went through IVF have even harder pregnancies than \"normal\" people. All of our emotional capacities have been spent - we're barely emotionally making it - and then to feel gratitude/joy over a miracle baby confounded by lingering grief, constant anxiety, and then guilt for those things PLUS the fact that we often have to deal with the same morning sickness and pregnancy symptoms that other \"normal\" women need to go through while already being EXHAUSTED. It's like running a marathon and then realizing you  need to run another 10k. \n\nLastly, does her current pregnancy trump:  \n\\- They physical and emotional pain that goes with jabbing oneself multiple times a day for 2+ weeks?  \n\\- Going through pain procedures inside her body WITHOUT anesthesia?   \n\\- Injecting herself with 80+ 1.5 inch needles and then living ten weeks with the side effects?  \n\\- Constant anxiety built up from infertility trauma?  \n\\- And the stress and mental load from a complex mix of gratitude, sadness, fear, and guilt?\n\nI am currently in my second trimester and had really severe morning sickness (like throwing up throughout the day until all that's left was mucus with bits of blood!) and I will say the IVF process was emotionally and definitely physically harder.", "IVF x 1000. That is laughable that she said that. I was never more stressed than I was during ivf and I had a high risk pregnancy and delivered at 34 weeks. I truly believe if you can do ivf you can do anything.", "It's so invalidating. There are difficult pregnancies for sure, but for someone who has no idea what it takes to go thru IVF to say something like is pure ignorance and terribly invalidating of your experience.", "Pregnancy both times was significantly harder for me. My second one especially, it was high risk , I almost had a long term hospital stay, but now she’s a month old laying on my chest, farting loudly because I couldn’t get her to burp after her bottle 😂 \n\nI read somewhere that pregnancy doesn’t cure the grief of infertility, and like another poster said, IVF made it hard to relax during my pregnancy and had me anxious for every milestone.", "I don’t have any infertility, as I did IVF as a single mother by choice so that probably changes the way I viewed IVF. But for me IVF wasn’t too bad, I handled it well physically, though mentally it was a bit of a strain with the constant waiting and wondering and having no guarantees. I was lucky to have 1 egg retrieval, followed by 1 frozen embryo transfer which has resulted in my current pregnancy. My pregnancy has been awful though. Some of the IVF anxiety kind of followed into the early pregnancy and didn’t really ease up until my 20 week anatomy scan. But physically pregnancy has been really really hard, with first trimester nausea, 2nd trimester horrific heartburn and indigestion, 3rd trimester muscle knots in my back which made existing hard and sent me into physical therapy for weeks, insomnia and fatigue, and now a brand new diagnosis of gestational diabetes that has my entire day revolving around meal planning and finger sticks and fears of complications. I don’t have a lot of worries about going through the IVF process again in the future if needed, but this pregnancy has me questioning if I want any younger siblings for this one.", "Both are really hard. I would say they’re both hard mentally and emotionally but pregnancy comes with more optimism. Pregnancy has been a lot harder on me physically than IVF was, but I had a fairly straightforward path with IVF and know that some people go through a lot more.  \n\nA lot of pregnant women may disagree with this but based on my personal experience, I feel pregnancy is WAY more understood by society than fertility treatments are and that makes a huge difference. It makes the pregnancy a bit more bearable. I feel like my pregnancy struggles are validated a lot more than my IVF struggles were. Sure, you get your share of stupid comments and obnoxious jerks, but in general people care about pregnant women. A lot of people ask how I’m feeling both physically and mentally. In general, the world has been accommodating. If I have to miss something because of exhaustion, people generally understand. Women who have been through it will commiserate with you, which makes me feel like I’m not alone and men are generally willing to help a pregnant woman. People also love to ask about your pregnancy which makes some women uncomfortable but I enjoy it. So overall, I feel pretty supported. And when going through a hard experience, that universal sense of understanding has been nice. With IVF I definitely didn’t feel that way. I felt a lot more alone; it was hard to know how much to divulge. The people who I did open up were caring and kind but didn’t fully get it. They don’t realize how emotional and exhausting and time consuming it is. If you have to miss something because of IVF, people aren’t as understanding. You don’t get the same accommodation that pregnant women get. And I honestly feel like that validation makes a huge difference.", "I honestly consider IVF and pregnancy to be one long time of suck, and I find that pregnancy is harder emotionally for people who go through IVF to get there because there is more at stake", "It’s honestly comparing apples to oranges in my opinion. However I can say from my experience that I have some friends who think it’s some kind of competition over “ who has the bigger hurt”. I will admit I currently don’t relate to friends who have experienced loss, of course I can imagine what it would be like, and sympathize with/ for them. But I haven’t been through it so do I really truly understand? No. \n\n\nHowever they will never fully understand what it’s like to have failed treatments, multiple surgeries, years of waiting and wondering if you’ll ever become a parent, negative test after negative test, all the questions and nagging about why you don’t have kids yet. The countless appointments and needles and the 10’s of thousands of dollars spend for a CHANCE to have kids.\n\nI’m currently 14+5 weeks pregnant with my miracle ivf baby. Was/ is ivf stressful. Heck yes. Has pregnancy been stressful? Also yes. Will I be stressed once my baby is here in my arms? My guess would be also yes.", "This person is not a friend. That’s the nicest thing I can bring myself to say. Consider finding new sources of companionship.", "My pregnancy was without IVF and while the first trimester was a bit anxious, overall it was a beautiful and easy pregnancy. Symptoms weren't too bad, just mostly fatigued and couldn't get comfortable sleep in the 3rd trimester.\n\nDoing IVF to try for my second child is 1000x more stressful, more emotional, and more difficult than my pregnancy. \n\nMy personal experience, others may differ, but your \"FRIEND\" is dead wrong and also even if she wasn't, she's ahole for saying it. \"You have no idea?\" If y ou haven't gone through IVF, then how dare you even comment on something like that. wtf", "In this context, having gotten pregnant *by surprise*, she can f-off.", "Pregnancy in general is anxiety inducing. Pregnancy after loss and/or infertility is hell. You’re so aware of everything that can go wrong.", "Pregnancy when you have experienced IVF, fertility issues and pregnancy loss previously is hard, because you expect the worse, you are used to bad news and it gets to you. The anxiety is crazy. \n\nHowever I think how your friend said it was more to diminish your feelings and make it as if having a straight forward normal pregnancy is more stressful which is completely not true.", "TW: success.\n\nThey are different struggles.  \n\nThe news that I would need surgery and then IVF (I thought maybe just medicated cycles initially) was a shock and a heartbreak.  The fear of the surgery, the delay for recovery, the confirmation I would need IVF, financing this gamble on meager income, the less than optimal 1st retrieval, the better but still not impressive 2nd retrieval, the transfer which we were so scared would fail were all I thought about before that positive pregnancy test.\n\nBut my pregnancy with the euploid 4aa embryo appeared to have an abdominal wall defect at 10w (thankfully he did not), then baby had decreased fetal movement 2x, and then a non-reassuring heartbeat at 38w which resulted in an emergency c-section.\n\nThen my baby came home, small but healthy.  And then he choked on formula, stopped breathing, and turned blue which led to infant cpr and an ambulance ride to the children’s hospital at a week old.\n\nIt’s not a race, it’s not a competition.  It’s all hard and it’s all scary.  That being said, I don’t think I could be friends with someone who said things like that to me knowing my struggles.", "IVF is a fire filled pit of hell and I wish it on nobody, so she and her unicorn pregnancy can politely nope directly out of any conversation regarding it if she hasn’t been through it. Also, IVF not only robs you of your “trying to get pregnant ~*experience*~ but also makes pregnancy a hell of a lot more stressful too. \n\nThat being said, I’d take any pregnancy physical discomfort with a live birth over an emotionally charged egg retrieval ANY DAY.  Trigger- success- We are still recovering from infertility trauma nearly a year after our healthy baby was born, and I don’t see it going anywhere soon. It changed me as a person.", "Your friend is a twat. Period. What an imbecile!", "TW:LC \nIt’s all a different type of hard in my experience. I had HG and was sick until I gave birth. Then my LC had a colic and screamed from sun up to sun down until he could start solids. But I’m doing it all over again so there’s that. 💗", "I am currently 28 weeks, and have had a very normal pregnancy besides getting a mild case of Covid at 21 weeks. This is my first pregnancy from my 2nd FET. There is definitely anxiety (at least for me) in pregnancy but nothing compared to IVF. I will say I was very fortunate with how extremely well I responded to IVF, I had 1 ER resulting in 4 euploid embryos… and things were generally smooth sailing besides the first FET - chemical loss. IVF was emotionally very different, it had its own anxieties of never having the chance, failure, what ifs, waiting and more waiting.", "IVF was worse. Easy answer.", "IVF is hard, IVF pregnancy is hard, postpartum is hard.  It's all hard but always remember you are stronger than you know.  Non IVF'rs can buggar off. ", "This thread makes me sad—for all of us.  😔", "At least with pregnancy you walk away with the prize. The thing you wanted. IVF often leaves many empty handed and hopeless.", "IVF was WAY harder than being pregnant!  Unless she’s been through both, her opinion doesn’t matter.  The injections, procedures, failed attempts, emotional rollercoaster, constant fear of failure, expensive, etc. far outweighed any stress I had during my pregnancy.  Both are hard, but IVF is something no one will understand unless they’ve been through it.", "ER was worse than any moment in pregnancy. Physically and emotionally. Third trimester is longer though. You could argue the duration makes it harder, but I think IVF was worse.  And I was pretty unhappy third trimester. I had pelvic girdle pain, and had non sto Braxton hicks. Showers were not that hard.  Stairs were hard. Picking up anything from the floor was hard.  Sleeping was hard.\n\n\nBut by third trimester I also had a baby boy kicking me in the side, reassuring me he was in fact there and I was a little more confident every day that I would meet him.  During stims and OHSS, etc, I had no idea if I would ever bring a baby home.  I did spend the whole pregnancy worrying.  There is no point at which you stop worrying something will go wrong.  It’s just that what you worry about changes.  My baby is 8 months old.  Now I am worried he will choke on solids or throw himself out of my arms and get hurt (daddy introduced him to flipping upside down, so he keeps trying to flip upside down with zero concept of falling)", "IVF is 100x more emotional and physically taxing compared to pregnancy. \n\nI was anxious that I would lose our baby for the whole first 12 weeks but that was because we never felt like we’d ever get pregnant. Those who have never done fertility treatments don’t understand and they never will. It’s not their fault, they should be thankful they don’t understand, but they can’t even try to compare. \n\nI threw up for 5 months straight when pregnant. I genuinely felt better when I was pregnant than when on constant meds, having doctors poke and prod, etc.", "IVF, pregnancy was stressful for sure but ivf was way worse. Pregnancy I knew I had made it. Ivf was maybe, hope, what if. I was also high risk. So pregnancy while stressful still want worse than the unknowns of ivf.", "TW: success. \n\nAfter two retrievals, three transfers, and an open myomectomy we finally had success. I’m currently 29 weeks along so I can’t speak for the whole pregnancy, but I definitely would say IVF is THE WORST. Not only did it push me to my limits, it stuck me in the hospital with a mental health crisis. I’ve faced many very difficult situations and NOTHING was as hard as IVF. \n\nThe first few months of my pregnancy were absolute misery due to the PIO injections and morning sickness. I was bedridden for almost three months, but the happiness of knowing I had a life growing inside me and that there was an end in sight to my misery kept me going. \n\nIVF feels like hopeless suffering, but pregnancy feels like happy suffering. I’ve had a really rough pregnancy so it’s not that the pain and discomfort stopped with the successful pregnancy test, but you know that this is what you were working towards so it makes it manageable.", "Hi everyone. I have 2 children and I went for the third one to an infertility clinic, because my AMH is 0.25 at 38. I went thru IVF cycle for the ER, and I went thru 2 pregnancies before that. My first pregnancy was at the age of 21 and it was easy, stressful because I got dumped but no pain anywhere, baby born at 34 weeks, healthy but thin: 2.5 kg.   \nMy second pregnancy was at 33-34 years, I was in much worse shape to begin with, and it was okay-ish till the mark of 25-26 weeks. Then i had A LOT of pain: my ancles were swollen like uncle of Harry Potter all the time, I was super sleepy the whole time, my wrist was killing me (carpal tunnel or something like that), the need to pinch myself for gestational diabetes starting from week 28 was a nightmare, I just stopped poking my fingers with needles and started inventing good slightly over numbers and was just nodding to their advice on what to modify in my food lol.   \nBoth pregnancies were c-section. I had such a bad anxiety over epidural anesthesia that I couldn’t relax until the deed was done.   \nthe ivf was on par with the second pregnancy. Both were very bad. But different bad.   \nI will not do another medicated cycle of ivf again. If needed I will go with the natural cycle ivf, the one without the needles to the belly and the ass. I do want to have a third kid, because the first two cupcakes came out better than perfect. I am willing to suffer thru the third pregnancy even being in the worst shape of my life (being old and fat) because the result if successful is way better than the pain.   \nsending everybody here baby dust and sticky vibes <3 you can do it."], "link": "/r/IVF/comments/1besa77/question_for_the_grads_what_was_more_stressful/"}, {"title": "To PGTA or not to PGTA", "content": "Hi i’ll try not to make this long winded!\n\nI have embryos from a 2023 cycle (I was 31yrs old) that we did not test but they were biopsied (insurance denied claim so could not afford it). The lab has kept the samples in case we change our mind. \n\nMy insurance changed for 2024. PGTA is now covered - my insurance states they will cover testing the previous embryos if we want. \n\nI have Maven for my insurance which uses “cycle credits”. I have 12 credits. FET= 3 credits PGTA= 3 credits.\n\nShould I PGTA and then only have 3 possible FETS if needed?\n\nOr just 4 FETS?\n\n\nTW! \nI have one living child from an untested 2021 FET.", "num_comments": 9, "score": 2, "top_comments": ["For me I think it would be worth testing to avoid doing a FET of an embryo that either wouldn’t implant or wouldn’t be likely to be viable, then you could focus your remaining credits on the euploid embryos. Everyone’s priorities are different but for me if a FET failed and it was a euploid embryo I’d feel like I could focus on changing protocol for the next one instead of wondering if it was something wrong with the embryo.", "TW partial success - If you’re on the fence, always test in my opinion! We didn’t test ( which I regretted as soon as I had my first FET and anxiety kicked in) my first FET stuck but I’m about to be 7w it is not viable. I don’t want to go through this again if there’s anything I can go to avoid it. All I keep thinking is this may have been avoided if we’d tested."], "link": "/r/IVF/comments/1bcgufm/to_pgta_or_not_to_pgta/"}, {"title": "How did you pay for all of this?", "content": "I sincerely apologize if this has been discussed elsewhere or something I have overlooked, but how do/did you pay for IVF? \n\nBetween the meds, Dr visits, Labs, travel expenses, etc my wife and I have accrued around $40k of debt. Currently, we have been putting it on our credit cards, but it seems each time I get close to paying one down I get hit with an interest fee and am back to the beginning.\n\nIt's really kind of overwhelming. Does anyone have any suggestions?", "num_comments": 116, "score": 42, "top_comments": ["We chose CNY, and paid $3795 per cycle \n\nUsed donated meds \n\nCharged all to a frequent flyer card to get miles to pay for travel to clinic \n\nAre sharing one vehicle (early 2000’s compact) \n\nWe do nothing else that costs money \n\nContinuously save \n\nHad already saved money for hypothetical baby and deductible for hypothetical baby and other savings which we have used all of now \n\nAsked for help from family who could help- frequent flyer miles, some small cash gifts, etc. anything to help us slow down the spend", "My job offers great benefits, but still, the hubs and I have paid a hefty amount out of our own pocket, between 3 ERs and meds, I'd say we spent close to $17,000. It would have probably been 3x that without insurance!!!", "Your options are part time job at Starbucks for the benefits, switching jobs to one with fertility benefits, traveling to cheaper clinic like CNY, traveling to Europe where one round all in is $5k, buying meds from European pharmacies online for 1/4 of the cost.", "I've heard that Amazon workers get fertility benefits, even if you're working in the warehouse part-time.", "We would have had to take out a loan if I didn’t have really good fertility coverage through work", "Related question... does anyone know how lifetime maximums work? Like are these per person or per policy? My spouse and I are on different policies (each through our separate employers) with the same insurance company. Once I hit my lifetime max, can I switch to his policy and get additional coverage?", "I am so grateful now that all was covered by national health system (yes the meds too) where I live in the EU. \n5 (F)ET are included and even after those if all failed the costs are much more cheaper than private clinics.", "We could only afford a single round, so we had that agreement with each other before we started. We paid from savings and had to save up some more before we started. How old are you? If time is pressing, I understand why you have to keep going ASAP. But if you're, say under 30, I would take a break to get a bit of a handle on the debt. I have a friend who became an Uber Eats driver as a side gig to save up before they started. $40k isn't absurd, but enough to be pretty stressful. If you are able to chip away at that, you may find a huge weight gets lifted. Good luck- this is all very hard and unfair.", "First round I did with a clinic that was covered by my insurance but with meds, FET and some testing fees it was still almost $25k. I maxed out my husband and mine FSA accounts and had saved up some money to pay for it. The clinic was not a great fit for me so I switched and it's all OOP. Much more expensive but somehow I had saved enough money and used some of my savings fund for a new car and house emergencies I had for a 2nd round. \n\nMy 3rd and 4th I am doing a multiple cycle deal at my clinic which will only save me money on transfers. I couldn't save as much but again I maxed out all my FSA accounts, got a 0% interest CC, and went to Mexico to buy meds for my 4th round. Thankfully my cousin gave me some of her leftover meds too. I only got 2 types of meds in Mexico but I saved almost $3k in meds that way. Wish I had done it all sooner but was too scared. This time I was desperate to save some money since I'm running out of savings. If I can't pay off the credit card during the 0% introductory rate I'll probably try to do a balance transfer to another 0% interest fee. I had to do a polyp removal and multiple biopsies done with this new clinic too that came up after my 2nd cycle. I did it with my PCP/GYN so i only had to pay a copay. My GYN is also helping me this time get Lupron depot before my next transfer. My fertility doc wants me on it for 2 months and OOP the pharmacy quoted me like $1300. If my PCP orders it for me my insurance says I'll just pay a copay again.\n\nI'm glad I could find ways to make things cheaper and reddit people helped me figure out what to do to get meds in Mexico. I'm thankful for this group.", "job, first 2 smart cycles will be my husband's insurance. last 3 on mine", "I paid 50k out of pocket. I was doing it on my own. Unfortunately it didn't work so I'm slowly paying it off. Got an 18 month no interest credit card. And I play a game with myself called, \"Get it for less!\" 😂 It's become a way of living. Like for example, I wanted to get my nails done but that's $20 plus tip. Instead, went to CVS, the color I wanted was $6. Nope, try again, supermarket, 2 bucks! Score! Took myself to the zoo on the free day. Got the NYC culture pass which gives me free admission to a bunch of museums. Wanted to go to the beach. Parking $20. Nope. There's another beach that I can get to by public transport. ($2.75 round trip subway)  But no gas and no parking fee! Someone's exiting the subway and the door is still open, quick, grab it and run though! Every little bit helps. The only thing I spend money on - my one real splurge - is concerts because after the hell I went through with no baby after all was said and done, I've gotta keep one thing in my life that I love while I try to pay off this debt. Oh and the biggest savings I've found of all. Trader Joe's! I don't eat out and I'm not drinking any more so that's a fair amount of savings, especially when you live in a city. I've been doing it so long I kinda enjoy the challenge and to be constantly on the lookout to get the things I want and do what I want for less. It really sucks though. It feels like alimony. This constant reminder every month when I make my monthly payment that I'll never have a child and all I have is this bill. I'm really looking forward to the day it's all paid off. Because only then will I feel like I can truly move on from this awful nightmare.", "We took 7 years going through IVF, do a round, pay off loans and credit cards, then start another. Our clinic offered a discount on three rounds of stims for patients with lower chances, so that helped but the meds were still a barrier. I switched jobs and the new insurance package covered the meds so that was a huge break. We also sold and downsized our house, went fully remote for work, and got a Future Family loan. They've been a great company to work with. \n\nOh, and I second what someone else said about deducting all the medical costs on your taxes, those refunds were very helpful. \n\nGood luck! The costs are ridiculous.", "We only did ivf because I had fertility insurance through employer. We did one round of egg retrieval and transfer and are out 13k of the 20k insurance benefit. I had to pay 4400$ out of pocket deductible. Our euploid embryo miscarried and we don’t like our clinic enough to pay 16k out of pocket for another round. There are cheaper options for mini ivf and I am looking into them for round 2. Good luck", "I found a company that has good fertility benefits, im paying 9k ofp including pgt testing. Hopefully that’s it."], "link": "/r/IVF/comments/1683bx9/how_did_you_pay_for_all_of_this/"}, {"title": "Another round or no? (TW: Champagne problems)", "content": "TW: we are well insured and have been fortunate in our retrievals. Hence the “champagne problems” title. \n\nI am blessed to have excellent insurance and my partner and I are debating whether we should try an additional retrieval before our first transfer.  I am 38, unexplained female infertility, we have been trying for almost 4 years. We want 2 children. \n\nOur insurance allows us 16 credits.  Each retrieval costs 2 credits and each transfer costs 1 credit. My partner and I have gone through 3 retrieval rounds, and have secured 6 euploids, 1 low mosaic, and 1 unknown (no DNA). \n\nRight now we are in a very good position. We have statistics in our favor generally speaking, but I’m nervous about MCs or implantation issues, especially since the infertility is still unexplained. If we did an additional ER, we would still have up to 8 frozen transfers covered and could pay out of pocket for any additional needed, or move to surrogacy if necessary.  However, that pushes our pregnancy timeline out further. Our plan is to donate any unused embryos to couples having issues in our clinic. \n\nGood people of IVF, would you do another round for insurance, or would you just start transferring?  What would weigh into your decision?\n\n\nETA: we decided to go for ER 4. Retrieval was 5/24. Thanks everyone for your advice!", "num_comments": 31, "score": 14, "top_comments": ["I would absolutely do another round if it were covered by insurance. I'd rather have extra embryos in the freezer than need to try again in a couple of years. Congratulations on your successes so far.", "Do you have a history of loss(es)? I’m moving to IVF due to RPL, so if you want a perspective from that lens, I can offer that. I also have an autoimmune disease that puts my chance of loss in the realm of about 30-40%. \n\nThe ratio I’ve generally heard is that you need 3 euploids per live birth (or at least that’s the insurance policy you want). If you want two kids and don’t have a history of RPL, you’ve got that. \n\n*However*, if you’ve got a history of unexplained RPL or go on to have RIF even with known euploid embryos… it would be a better to have more in the bank for the “worst case scenario”. \n\nIf you have had multiple losses, were they CPs? Or MMC? Or ectopic? MMC and ectopics will set you back months in the process, in which case I’d do another retrieval now rather than later. If you’ve dealt exclusively with CPs or early spontaneous losses (ie, before 8wks), I’d try a transfer and see how it goes. Best case scenario, the first one sticks and you’ve got 5 embryos left to transfer. Worst case scenario, you get set back a couple of months and opt to do another retrieval. \n\nIf you’ve done the RPL bloodwork (and it’s all negative), and you don’t have underlying health conditions that make you more susceptible to loss… if it were me, I’d probably feel okay starting to transfer at this point.\n\nIf you want the emotional security of having more embryos in the bank just in case? Proceed with another retrieval.", "If insurance will cover and you want more than one child, I’d do another retrieval. I was also fortunate to have insurance coverage and squeezed in as many retrievals as I could mentally handle. \n\nMy stats:\n5 retrievals, 18 embryos, 8 abnormal, 6 normal, 1 low level mosaic, 2 high level mosaics, 1 untested. (40, unexplained secondary infertility)\n\nIt took seven transfers for me to have a pregnancy make it to the second trimester (currently 15 weeks with LLM).", "I completely understand your dilemma. I’m your same age with exactly the same number of embryos after two retrievals (6 euploid + 2 mosaic). My first transfer with my best graded embryo just failed and I’m starting to spiral. We are entirely out of pocket so we’re transferring everything before we go back for more. I do worry about being older for another retrieval if all of these fail. If worse comes to worse I’d be willing to consider a gestational carrier, but I would probably transfer at least 4 times before going that route. By then I’d only have 2 euploid left. If I were you I’d do a transfer and if it fails go do another retrieval."], "link": "/r/IVF/comments/12qtyd8/another_round_or_no_tw_champagne_problems/"}, {"title": "Did your FET work even when you thought it wouldn’t?", "content": "I wiping my tears as a type. Tomorrow is my second FET. The first failed. It’s been 4.5 years now, with losses and only really bad news. I am sitting here and I can only really imagine this not working. I guess it’s easier to imagine what is familiar, rather than a different (successful) outcome. \n\nHas anyone felt this way and had success? Did you walk into your FET feeling hopeless and vulnerable, like you’re opening yourself to another possible loss or failure and not really to the possibility of it working?\n\nOof I feel like such a downer but these feelings are real! \n\nWe are all much stronger than we give ourselves credit for, I’m sure of that.", "num_comments": 92, "score": 51, "top_comments": ["I just keep repeating to myself, anxiety is not intuition. Anxiety is not intuition. Anxiety is not intuition.", "Yes. I felt this way.  I’m nursing that baby now! It can work!!!", "TW: pregnancy and live birth \n\nI know that feeling all too well. I was a shell of myself after our second failed transfer and wanted to just be done with this season of life.\n\nI walked in to our 3rd transfer giving no fu%^! and going through the motions.  I went to all 4 days of Lollapalooza the day after.  \n\nI just changed that 6 day old’s diaper and we are now snuggling.", "Yes. I had a chemical from a transfer and went into my next one hopeless. I was sobbing in the waiting room before the transfer and the nurses had to console me. I just kept saying “I’m so scared”. The transfer worked and I’m 34 wks", "Yes!!! I was you! My 4th FET i had no hope and a shitty attitude.  First positive ever! Rocking baby now :)", "I just wanted to wish you all the luck today. I am you. I was just telling my in-law about my fear of another failure, but they don’t get it. It’s so scary when you know what that low feels like. But you give me strength to continue - we will get through it.", "Transfer was smooth and a hatched blast AA boy is somewhere in there, hopefully getting cozy. Thank you, truly, for all of your comments and shared stories. ❤️❤️❤️ sending everyone love and gratitude", "Short answer: yes. My 5th transfer seems to have worked and I’m 8 weeks along. I had completely given up hope and just figured it wasn’t in the cards for me.\n\nEditing to add: not sure if it was the “giving up” that did it for me, but as the years of failure have gone by I’d grown less and less attached to the idea of it actually working until, with this last one, I just said fuck it.", "We have a similar journey. I had only one PGT normal embryo to transfer after 4.5 years. I walked into the transfer like this is the one. This is it! I’m having this baby and this is it. But honestly in my heart I was preparing for the same results and ultimately ending this fertility journey and this was the last. I’m 17 weeks. I had to change my mindset. It was eating me alive. I wrote affirmations, I posted on Reddit and asked for prayers and positive vibes. And this was after 7 failed attempts of retrievals, IUI, countless surgeries to repair my body, etc…you gotta bring hope back. \n\nYou are still in the running you have an FET, that’s great. Celebrate every win and not just mourn your losses. Sending you so much love and positive vibes. I’m visualizing a dazzling brilliant light beaming into your uterus and the embryo attaching to your body for fast and high HGC numbers. I believe in your body. Stay encouraged."], "link": "/r/IVF/comments/1253a7k/did_your_fet_work_even_when_you_thought_it_wouldnt/"}, {"title": "How do you afford IVF?!", "content": "IVF is no joke! It is expensive…testing, medications, procedures, surgeries! I am $2300 away from my deductible so, I know I’m lucky but, I am just tapped out. I made a go fund me but, I’m just to embarrassed or proud or stubborn to post! I tried fertility loans but my credit is just not up to par. Any advice or resources utilized? I hate to have just about met my deductible to waste it by not getting to follow through.\n\n(Sorry for the vent/rant, sometimes it just feels like I’m not even supposed to HAVE a baby and, since we are keeping our efforts a secret, I’ve got no one to vent to)", "num_comments": 131, "score": 36, "top_comments": ["We used savings, bonuses, stimulus checks, and an interest free credit card. I also bought most of my meds from other patients rather than from the pharmacy. My insurance covered some diagnostic testing and ultrasounds only. We paid over 30k out of pocket.", "Do you know if your insurance covers IVF? I met my deductible with my hysteroscopy I was required to have but it didn’t mean anything as no IVF is covered at all unless your employer specifically purchases IVF coverage for their employees. It is extremely expensive. My insurance covered some pregnancy related costs and bloodwork but that’s it. My husband and I didn’t want to take out any debt so we saved until we had enough. And it still cost more. Overall I was told it would be about $18k-22k, and we probably spent closer to $25k. It’s horrible and unfair. The fertility clinic I went to had lists of grants to apply for, try there maybe you will get lucky!", "All our savings, credit cards, not spending money on vacations or anything fun…buried in debt now", "In the US and I researched and went abroad. IVF medical tourism is a robust industry and there are Facebook groups and other threads on it. FWIW I feel like the patient attention is great and there are lots of success stories out there.", "I got a second job before even knowing i would be doing ivf. I lived really frugal for a year and was able to save the 15K from my second job. It definetly was stressful but i am glad it worked out. Maybe something in me knew that i would have big expenses coming up.", "In Ontario (Canada) one retrieval and all of your transfers from that retrieval are covered (no meds, or PGT testing, embryo storage) so it was a lot more affordable that way.", "We are lucky to have my company pay for a large chunk (Progyny) but if we didn’t… hands down, would not be able to afford this. Maybe we could do 1 or 2 rounds. Maybe.", "My company’s insurance covers 20,000k of fertility treatment including IVF. After that you have to pay yourself. It’s really easy to hit that 20k so you have to call and see how much they will charge insurance vs self pay(typically they charge you less) and calculate how to stretch the 20k as far as possible. I’m currently trying to convince my company to try to negotiate a plan with our insurance that covers fertility treatment without a lifetime cap. I’m lucky though. In a American if your company is based out of a red (Republican/ultra conservative) state your insurance doesn’t have to cover IVF.", "Some providers might provide discounts for certain types of workers, public service, teachers, etc", "We saved. For years.", "0 coverage by insurance. We saved a little (not much as we cashflowed 4 IUIs with meds). We were VERY fortunate and were gifted money from our parents. They have seen us struggle for over 3 years and they wanted to help. We are very fortunate as I would NOT do ivf if it put us into debt. This process is so unpredictable I was scared of going into debt and not even getting a baby out of it. I knew how painful those debt repayments would be.", "Our insurance covers 3 full cycles.", "I worked part-time at Starbucks as a second job. They have amazing benefits. Takes 5 months before benefits kick in and it was really hard work, but it was totally worth it.", "I had insurance from my employer, and even with it it cost about $20k out of pocket", "We got a grant from a religious org for 10k. Otherwise, we could not have done it. We can only afford a single cycle and a single transfer with it.", "We started with IUI. That allowed us to eat up our deductible in smaller amounts at a time. Once it was met we went full force into the IVF and it was covered almost 100% besides a few medications."], "link": "/r/IVF/comments/whp7v4/how_do_you_afford_ivf/"}, {"title": "IVF Financing - 0% Anyone?", "content": "Has anyone found IVF financing with 0% interest for a period of time like 1 or 2 years? So far through all the big name IVF lenders I'm seeing 6.99% end up depending on credit score and the duration of the loan. My local credit union was a bust with absolutely horrendous rates. Thank you!", "num_comments": 25, "score": 3, "top_comments": ["I found a 18 month interest free credit card thru my bank.", "We opened credit cards with 0% interest for 18 months, 22 months if we made all our payments in time, which we will."], "link": "/r/IVF/comments/v7an9c/ivf_financing_0_anyone/"}, {"title": "Shout out to every working overtime this week to pay for IVF", "content": "I just finished a 11 day work stretch including an entire week of being on call 24/7. I have three days off before I go back for an 11 day stretch. My husband picked up an extra day tomorrow. Slowly working down our credit card balances from my 3rd cycle. \n\nCheering for everyone else out there, busting their ass to build their family! It’s worth every penny I’ve spent in the last 4 years.", "num_comments": 4, "score": 52, "top_comments": ["Definitely hard work. I think I might do a bit of overtime if allowed.."], "link": "/r/IVF/comments/1ahfdi2/shout_out_to_every_working_overtime_this_week_to/"}, {"title": "CooperGenomics & Progyny", "content": "Anyone have Progyny and are doing genetic testing through CooperGenomics? We’re doing PGT-M and PGT-A. Cooper just sent me their fees and request a credit card on file and $2800 non-refundable payment before even getting a genetic counseling appt with them. I’ve already reached out to Progyny to ask about this fee but haven’t gotten any answers yet. Wondering if anyone else has dealt with this? Did you have to pay this fee out of pocket?", "num_comments": 2, "score": 0, "top_comments": ["Idk about pgt-m, but with pgt-a I just had to provide the authorization letter progyny gives."], "link": "/r/IVF/comments/1aeh318/coopergenomics_progyny/"}, {"title": "Strategies used to lower out-of-pocket expense for ER?", "content": "So I am on my 2nd going on my 3rd ER cycle. My insurance does not over infertility. I am getting really creative with ways to lower my out-of-pocket expense. I've cashed out miles: cashed credit card reward points; received a multi-cycle discount at my center; and, put my last two year tax returns  and stimulus payments towards the cost. I'd be interested to hear from the group other ways you've found funding short of maxing-out credit card, taking out other loans, or relying on family gifts.", "num_comments": 21, "score": 11, "top_comments": ["I worked 1 day in an Amazon warehouse to get Progyny insurance. It has worked out great so far. My total out of pocket costs are my $2000 deductible and $700/month to continue coverage on cobra.", "This is a small savings, but it all adds up -- I found that with some of the non-fertility-specific meds like estradiol patches and PIO, my insurance would cover them (I have zero fertility coverage) BUT it was much cheaper to use Singlecare. It's a discount program like GoodRx, but I like it better."], "link": "/r/IVF/comments/tscl9c/strategies_used_to_lower_outofpocket_expense_for/"}, {"title": "Please help me understand this from my clinic ", "content": "“During the consult, I stated that you have a credit for the PGS testing/shipping. The PGS biopsy service is the cell extraction for the actual PGS testing. The testing cost and the biopsy cost are 2 separate cost. The PGS biopsy was denied by (insurance provider) which will fall under self pay cost now. Please see the attached email and please scroll to the “Subject to authorization or self pay” portion of the email.”\n\nHow can there be a separate cost for biopsy and testing? You can only test if you biopsy so this doesn’t make sense to me. \n\nalso, we are being charged for 6 embryos when we don’t even know if we will make one given my DOR. Supposedly it’s a tier system so you pay for upto 6. How is this fair? 😢\n\n\n\n", "num_comments": 11, "score": 0, "top_comments": ["The two charges are:\n1. The embryologist at the clinic/hospital to perform the biopsies and ship the samples to the genetic testing company. \n2. The genetic testing company charges for the biopsy analysis. \n\nIt sounds like you're covered for the genetic testing company, but will need to pay the embryologist for performing the biopsies."], "link": "/r/IVF/comments/1b7iqxf/please_help_me_understand_this_from_my_clinic/"}, {"title": "Paying for ivf", "content": "Just got a call from the clinic that our last (failed) attempt has to be paid in full before we can try the next one (scheduled for this month). It's $6200. Just put it on a credit card, I guess? We're already on a payment plan for the egg retrieval and first IUI. They said we can't add this to that plan. If we're going to try again, it's another $6200, and if that one doesn't work? What? Just keep racking up debt? Because that's a great way to start off with a baby! /s  Honestly, there's got to be a fund or a celebrity out there to take on IVF bills", "num_comments": 4, "score": 1, "top_comments": ["I’m so sorry. It just sucks. Personally we did IVF in Spain because it’s much cheaper but I know not everyone can get it done overseas. It’s just a shit system here."], "link": "/r/IVF/comments/1b499z4/paying_for_ivf/"}, {"title": "First ER was a bust", "content": "I had my first retrieval yesterday. I knew I'd have lower numbers due to bilateral endometriomas, but I had nine follicles that were big enough to retrieve and they got all nine eggs. I was feeling good yesterday. But only one of them fertilized, and I know how often they stop developing so I'm feeling defeated. We really don't realistically have funds for another cycle (maybe could scrape it together on credit cards - but then how to pay those, you know?). We were going to do a fresh but now are recommended to do frozen if we get to that point (they had to go through the endometriomas), and obviously recommended to do more retrievals.\n\nWe're 5 years into ttc with our only positive (from spontaneous conception) resulting in loss at 16 weeks. I know we could keep going and bank embryos, but finances are our limiting factor. Part of me feels like it's just not going to happen for us because of money and I am devastated.\n\nAny words of support would be appreciated.", "num_comments": 15, "score": 11, "top_comments": ["[deleted]"], "link": "/r/IVF/comments/1bkzkin/first_er_was_a_bust/"}, {"title": "Can’t believe my ER day is a few days away.", "content": "When I started this process, it was in the midst of a divorce and still is. But I knew I had to continue with the promise to begin this journey. What have I learnt.. that I am much stronger than I gave myself credit for. That i am resilient, I know who I am, and “this too shall pass” \n\nI’m doing this alone, no husband, dreams breaking away and yet, somehow I have hope for a future with my child(ren). \n\nI’m turning 40 in a few months and I have 11 large follicles ready for retrieval. It’s surreal.\n\nMy faith in God has been refreshed and made new in this TRIAL. \n\nMy love to all of you ladies..", "num_comments": 7, "score": 12, "top_comments": ["Good for you. You've got your whole life ahead of you, so live the life you want. I hope the best for you! 🍀🍀🍀"], "link": "/r/IVF/comments/1aohrac/cant_believe_my_er_day_is_a_few_days_away/"}, {"title": "Money/Costs", "content": "So we’ve spent the past nearly 2 years saving for one IVF cycle. We paid out of pocket for the cycle (must be paid up front and in full prior to them even moving forward). \n\nJust today, we learned that the PGT testing (the reason why we’re doing IVF) cannot be charged to a Care Credit with 2 years no interest as Cooper won’t accept it. We’ve also requested our clinic and the lab send for a preauth, because all this is covered by our insurance- they won’t. Self pay and upfront pay only. \n\nI wish they’d give you a heads up about these things beforehand. Because we would’ve put some/part of the cycle on the Carecredit so we’d not be so strapped with the up front costs of PGT. (We were expecting ~3-4k, it’s closer to $7k). \n\nI’m trying not to complain and I’m trying to be grateful to have this opportunity, but I also want other people to know because I feel like we’d have done things a bit differently had we gotten a better estimate for PGT beforehand and had we known Coopers wouldn’t take Care credit. \n\nThere’s so many ways to get in over your head in this. I wish finances wasn’t one of them. We planned so hard and still are in deep.", "num_comments": 22, "score": 3, "top_comments": ["That sucks and Cooper Genomics is really picky on which insurance they carry. I found that out after they already had our biopsies. The other thing is they don’t send you a bill until they’re done testing and you don’t have to pay it all at once. I split my testing cost into equal amounts and pay every month. I have gotten zero push back from them. I wish they would allow automatic payments, but if I pay every month, it seems to be just fine.\n\nSo yeah it sucks, but just pay each month off their website and you should be fine. Do not pay the full amount. Cooper won’t charge interest on your balance with them as it’s medical debt and they cannot charge interest on medical debt."], "link": "/r/IVF/comments/111l6hv/moneycosts/"}, {"title": "IVF Drug Discount Programs?", "content": "Starting IVF soon. Insurance will cover treatment and diagnostics but not most injectable meds. Does anyone know of a discount program for low income families? Not a grant or financing program as we don't have good credit and I'm sick of paying grant application fees to only get nothing in return.", "num_comments": 3, "score": 3, "top_comments": ["Your clinic will likely have relationships with the pharmacies they recommend. Reach out to the financial coordinate / billing department!"], "link": "/r/IVF/comments/175haox/ivf_drug_discount_programs/"}, {"title": "TW: Negative Beta 10dp5dt", "content": "Beyond sad that our first FET was not successful (<1 HCG level)... \n\n* The embryo was PGT-A tested, graded 4AA, 5-day blastocyst, acupuncture immediately before and after FET\n* I've never missed a dose of medication; I am always on time. \n* I ate the McDonald's fries and pineapple with the core. I wore the warm socks.\n\nI cannot wrap my mind around WHY this did not work. **Is there anything more I can/should do to increase success?** Additionally, I don't drink, smoke, or do drugs. \n\nWhen the nurse called, she said I would need to stop all medications immediately, have one full menstrual cycle, then we can start all over again. **How long after a failed FET should I expect my period to start?**", "num_comments": 69, "score": 39, "top_comments": ["It just happens . Not your fault or anything you did or didn’t do. Try to think about it in terms of stats. Sure some people have their first one work but anything with a 65% success rate will have a large percentage on the wrong side of stats. I’m one of those people by the way and we ultimately had 4 live births with IVF. \n\nYou should be able to go back to transfer when you feel ready.", "I’m so sorry…I know from experience how devastating a failed euploid transfer can be! There’s nothing you could have done. Sometimes they just don’t work (usually because there’s something wrong with the embryo that isn’t # of chromosomes). I got my period 2 days after stopping meds, and did another FET that next cycle (my second transfer was exactly one month after my first). That one worked, and I’m now 34 weeks tomorrow. Best of luck for your next steps. ❤️", "I’m so sorry. I’m having my second chemical right now (first was euploid, second was mosaic). To answer one of your questions, once you stop PIO, it typically takes about 2-5 days to have your bleed. It’s the pits. Give yourself lots of love as you go through the coming days. Many people don’t get there on the first and then do the next time 💗", "There is nothing more you could have done, sometimes even when everything seems perfect is doesn’t work out. My first PGT 4AA failed, but my second one, also a 4AA is due next month.\nDon’t give up hope", "first didn’t stuck either at all! currently having a hysterescopy tomorrow to confirm my fibroid is out of the way before FET #2. totally normal the first didn’t stick", "I had a failed FET did the ERA and my progesterone timing was off.", "Sometimes it just happens unfortunately . In surprised they are making you have a cycle before moving on. I’ve never had a total fail but I have had chemicals from FET and when I stop meds and start bleeding they count that as CD1 and then I start the BC that same cycle for my next FET. Jr seems kinda silly to make you wait a fully period", "I had a negative beta last week with my first FET. Don’t give up hope! The percentage on the 2nd and 3rd try seems to be more successful. I definitely understand what you’re going through. Hang in there! 🙏🏻❤️"], "link": "/r/IVF/comments/1bi5erw/tw_negative_beta_10dp5dt/"}, {"title": "Small Win", "content": "While still pretty drugged up I posted on Friday about my disappointing egg retrieval. The doctor told me before I went under they were expecting 5-10 eggs and woke up to only 1 egg retrieved due to early ovulation. The Dr even saw a second one and it ovulated away from her during the procedure! (5 days later my wife and I can laugh that that egg would have been an asshole kid anyway) I basically grieved and counted us out, started doing math to pay for round 2, even opened an intro 0% apr credit card to pay for it with some flexibility.\n\nAnyway, I got the dreaded call from the embryologist today but it was actually good news! We have a 5 day blast on ice! I still can’t really believe it!", "num_comments": 11, "score": 54, "top_comments": ["Congrats! In my first egg retrieval I only got 1 egg too, it made it to 5 day blast despite the odds. It really does only take one sometimes 😁"], "link": "/r/IVF/comments/18n6j4x/small_win/"}, {"title": "Cash pay FET meds and “Carrot” funds", "content": "My Aetna insurance uses “Carrot” to manage infertility coverage, which has a lifetime max of $30K. We’re looking at costs for meds for FET only. My clinic said that they usually send the scripts to Freedom Fertility Pharmacy, but when I asked “Carrot” where we need to have them filled for their coverage, they said CVS Caremark…I’ve read through some posts here that Caremark has obnoxious cash pay (which is how this works, we “cashpay” with the Carrot “credit card”.) So my question is, do I spend $$$$$ with Caremark and get it reimbursed but use a big chunk of my lifetime coverage? Or just pay less myself out of pocket with Freedom??\n\nAnd does anyone have any cost estimates for these options?", "num_comments": 13, "score": 1, "top_comments": ["I’d pay oop from freedom or elsewhere. Meds for a FET cycle are usually only a few hundred dollars.", "If you hit your deductible, the cost for these meds is zero. But facing a new year, it all resets"], "link": "/r/IVF/comments/18sfnoa/cash_pay_fet_meds_and_carrot_funds/"}, {"title": "IVF and 50/50 relationships", "content": "My husband and I started with fertility treatments in 2021. We have to do ICSI, because my husband is infertile due to cancer treatments. So far we had 5 rounds of ICSI, 5 transfers...all failed. \nI know lots of you can relate. Over the years I had so many procedures, countless hours at the clinic. Its physically and mentally draining.\n\nUnfortunatly we pay out of pocket and so far, we split the financial costs 50/50. For quite some time I do feel like this is unfair, because as far as treatments I take the majority of the load. This feeling intensified after my misscariage. Im literally paying with my health. Sometimes my husbands comes to appointments with me, but thats about it. I tried to make him participate more, like ordering meds, paying bills but he keeps forgetting and that stresses me out even more.\n\nThe other day I went in for another appointment and ask him just for fun to drive me to which he said no thank you. After saying that we are in this together he said that we are together in a lot of ways and pointed the things he does for \"the team\".\n\nHow does your partner handle the process, are they involved more?", "num_comments": 73, "score": 21, "top_comments": ["My partner and I have combined finances. It’s all “ours.” So there isn’t an accounting of mine/yours which I think helps these situations. \n\nI schedule and attend all appointments alone. My expectation is if I asked him to go, he would go. It sounds like you’re saying you don’t feel supported because if you did, I don’t think you’d be tracking.", "After my divorce, my mom told me that 50/50 is actually what causes problems in a relationship.  Both partners need to be 60/40 at minimum 100% of the time. \n\nThis is a time when you need more support.  Please have some talks with him and that you will need more during this time", "I am really sorry to hear about your MC. Finances in IVF and in marriage are a thorny issue to be sure.\n\nPerhaps this will make you feel better—I pay 100% of everything IVF-related. I've done multiple cycles now, 1.5 of these were covered by my insurance (though there were still significant OOP costs to meet the deductible and for meds) and the other cycles were 100% out of pocket out of my personal savings.\n\nWe are in a situation where I have savings that I brought into the marriage and he has no savings so it is just makes the most sense this way. He is also supportive, but fine not to be doing IVF at all and switch to donation, whereas I am not there as far as donation at this point, so the primary driving force to keep going is me.\n\nHe used to go to many appointments with me, but now that I've done this for a while, I am totally comfortable doing those myself, so I only ask him to come when I am not feeling well or need a little extra TLC on a particular day. Sometimes he still just comes at random times too when he wants to score some brownie points because he knows that I like it when he does. (He does have a day job, which is generally flexible, but not always so he's not not coming just because he doesn't feel like it in most cases).\n\nFor your question, I would personally look at it from the perspective of 1) how much do you each make and have saved and base it proportionally on that and 2) how much do you each want to do the IVF and base it partly on that as well rather than automatically doing 50/50.\n\nBest of luck to you!", "First off - I’m so sorry to hear about your miscarriage. ♥️\n\nI ask this really gently: Do you both want a child? / if yes, is it with each other? I ask because I’m not sure if it’s clear as to what your / his expectations are here. The 50/50 thing makes numeric sense. But that’s about it. You can’t split expectations in a cute 50/50 way here. Are you cool with “taking one” for the team with IVF? Is he cool with owning everything else? I sense resentment from both of you from what you shared.\n\nWe do IVF b/c of MFI. I always wanted a child with my husband and it didn’t bother me that I’d be doing all the meds etc. because medically the issue came from him. Did I do way more prep so much that it felt like another full time job? Sure. But that hasn’t changed my/our baby goals", "I’ve definitely had my feelings hurt by my husband during this process - we’re only human and IVF and loss is the heaviest weight on the planet so it’s going happen. He’s my giant teddy bear though and hates seeing me upset - so we always work through it. I’m sorry you’re going through this. \n\nI go to the majority of the appointments alone but tell him when to come to the ‘important ones’ and he does. I ordered my meds honestly just because they called me and it was easier. \n\nHonestly - I’m a direct person and I know what I expect and what I deserve so I educate him on what I’ll be going through (if he missed something), showed him all of the meds and had him watch and ‘help’ with some of my doses. I have even told him - I expect for you to be interested in asking me how I am and questions about my appointments. (In a nice way - but direct). And he does those things  naturally as well - but there have been times I’ve felt like I needed to say it. \n\nI’d say, we’re more of a tomato / tomatto household - I bought our house, my husband is paying for IVF. I’m extremely grateful to him and that we are able to do so, but that being said, financial support does not rid a person of their emotional support. \n\nYou deserve all of the support in the world! ❤️❤️ don’t let his behavior slide (I’m sure he wouldn’t want to actually hurt your feelings) but saying you’re a team is easy, being a team is not. It’s a lot of work sometimes. 50/50 financially I can understand, but emotionally, it doesn’t work that way. It easily becomes tit for tat and that ain’t good. \n\nIf he isn’t good at expressing his emotions or maybe wasn’t raised in an environment of expressing ‘scary’ emotions well (my husband wasn’t!) then I would seek out a therapist who specializes in infertility issues. #1, for you, and #2, they talk to partners as well and treat you as a team.", "We do combined finances and have “unexplained” infertility. Regardless, my husband has asked to go to every appointment (I had to tell him he didn’t need to come to every single one). He drove me back and forth 4 hours away 3 times in a week for monitoring, the retrieval, and transfer. He has done stupid things like wear matching shirts, take dumb pictures, do superstitious things, etc. We have argued during the process of course, but he has dropped everything to take care of me in the last few weeks while I went through this. I absolutely know that he is my number one advocate and will be an amazing father. I think if you don’t feel that way about your husband, you guys should sit down and have a long, hard talk about what needs to change. I really hope it works out for you ❤️", "My husband and I have joint finances so everything is shared. We don’t have any separate bank accounts other than our retirement accounts. I schedule everything keeping in mind certain days he thinks he can pop by since our clinic is attached to the main hospital my husband works at. I think it really helps that the clinic is close to work. I know that’s not the case for most people so don’t feel too bothered if your husband can’t make it if he has to take time off works \n\nFor the monitoring appts, I generally went in myself. For he bigger appts like the initial assessment, Egg retrieval and any major procedures my husband took some time off to come. My husband took time off for each FET that we did. \n\nNow that I’ve graduated, the only time my husband can come is to the MFM appts at the hospital. My OB appts are in a clinic far away from the hospital so I just attend those on my own. \n\nMy suggestion to you is to sit down with your husband to go over your feelings and set some expectations that will work for the both of you. Perhaps you two want to take a month or two break so you can decompress. IVF is not an easy thing to go through. Mentally, the stress takes a toll on all of us and affects the relationships we have with each other. A handful of my friends going through IVF have a good support network and some even have a therapist they go to so they can unpack their feelings. \n\nWishing you and your husband luck. Sprinkling baby dust to you!"], "link": "/r/IVF/comments/1aqmhi2/ivf_and_5050_relationships/"}, {"title": "Bad diet before FET", "content": "Hey! My first FET is on Monday with my only embryo and because of the stress my diet hasn’t been great past few days(binging on sweet stuff) and now I’m stressing out it will affect the outcome. Although I know there is no reason to think so. \nI have PCOS and take metformin. This is the main reason why I think all the carb heavy food (that I’ve been eating) and therefore glucose spikes will negatively impact FET. \nTo give myself some credit I’ve been making lifestyle changes for the past 6+ month - working out 2-3x a week, more walking, better(ish) food choices. I’ve actually lost around 12 kg(still in overweight range), but somehow I still think it’s not enough and that I could have done better. I’m in longtime therapy and working on my binge eating patterns, but in the time of stress it’s still a coping mechanism for me. \n\nNo question, I guess I just need some reassurances. \n", "num_comments": 6, "score": 4, "top_comments": ["It’s gonna be okay. People who eat like garbage, drink, and smoke, get pregnant and have healthy babies all of the time. When you get pregnant you need to do the work to try and eat better (I do too!) to give your body and baby needed nutrients. Don’t beat yourself up you’ve got this!!!"], "link": "/r/IVF/comments/1bkvjk3/bad_diet_before_fet/"}, {"title": "Med refills- driving me CRAZY", "content": "Currently on day 12 of stims for my first ER. The lack of notice in advance of needing med credits is absolutely bonkers. I am about an hour from the closest pharmacy and had my most my meds shipped initially from Freedom Fertility. I need two additional doses that Freedom was supposed to overnight yesterday ( for tonight!) and now at 2:20 pm, they are telling me they weren’t shipped!! Is my cycle completely ruined??? Will call my clinic but I have no idea what to do.", "num_comments": 16, "score": 9, "top_comments": ["Usually clinics have a couple vials available for cases like this. They will loan you a vial and once your meds come in you will return them a vial of your own unopened. Super common for pharmacy fuck ups like this.", "Oh so sorry. I am now nervous now because I found out last week that I need to use them for meds 🙃"], "link": "/r/IVF/comments/16svma1/med_refills_driving_me_crazy/"}, {"title": "Progyny smart cycle question", "content": "I got 2 smart cycles through my plan. So far I’ve used 1.5 smart cycles (2 ERs at 3/4 smart cycle credits each). Embryo transfers are 1/4 smart cycle each. I haven’t done an embryo transfer using my Progyny smart cycle credits yet.\n\nCan I use the 1/2 smart cycle I have left towards a third ER instead of using it for transfers? \n\nThanks in advance for any info! 🙏🏼", "num_comments": 5, "score": 3, "top_comments": ["Thats exactly what we’re doing for the last .5 we have left. Progyny told us they were fine using what we have left towards another ER, it wasn’t going to cover the freezing, PGT testing, or the embryo biopsy but would cover everything else. They did tell us that it would also depend on the clinic if they’d be willing to accept the .5 cycle and we’d pay the rest out of pocket, our clinic was fine with it."], "link": "/r/IVF/comments/y8gum2/progyny_smart_cycle_question/"}, {"title": "Covering the cost", "content": "How did you cover the cost?\n\nCash, credit card, loans, grants?\n\nNames of lending companies or credit for fertility treatments? \n\nOur cost will be a little under 14,000.", "num_comments": 15, "score": 3, "top_comments": ["Does the $14,000 include meds? We were hit with A LOT of out of pocket costs that we didn't expect - additional tests, meds, hospital day bed costs, anesthetist fees for our egg pick ups, additional doctor appointments, etc. And that's before any of the 'nice to haves' like acupuncture. Even things like driving to appointments in the city and having to pay for parking just added to the general suckiness of it.\n\nJust be aware that it all adds up very quickly and your dollar may not stretch as far as you anticipate.", "I used my savings and then credit card.  I might look at a loan this next round if the rate is lower than my CC rate."], "link": "/r/IVF/comments/lc9rk8/covering_the_cost/"}, {"title": "Confused with insurance process", "content": "Hi everyone! Im going through IVF For the first time and as you can imagine the health insurance process has been confusing. My health insurance does NOT cover IVF but employer provides a one time 25k credit for IVF through carrot fertility. \n\nWhen reviewing my health benefits, they listed out a specialty pharmacy. Has anyone had a similar situation where IVF is not covered but their insurance covered the meds only? It would be great to save some of the credit if we have to do more than one round", "num_comments": 1, "score": 2, "top_comments": ["I have coverage through carrot. How it works for me is that I pay for everything - medications and to my clinic - and I get reimbursed for expenses up to the amount of benefits - in your case $25k. I need to get approval from carrot for all purchases first. I also had to do a consult with them to explain my plans. That's probably your first step and they can explain everything. Good luck!"], "link": "/r/IVF/comments/xurlvg/confused_with_insurance_process/"}, {"title": "Paying for IVF", "content": "Thinking about different credit card options to pay for our first IVF cycle. Might as well take advantage of deals for this large expense. Anyone else do this and have recommendations? \n\nI already have delta skymiles platinum but also was considering the Costco card with 2% cash back.", "num_comments": 8, "score": 2, "top_comments": ["Just got the chase freedom unlimited as its 0% for first 15 months and can get like $300 cash back. Also unlimited 1.5% and 5% on dining and groceries I think? Plan to use it for my IVF/health related expenses coming up", "We used US bank for 0% for 18 months. I've also received offers from them for 24 months."], "link": "/r/IVF/comments/12e31vo/paying_for_ivf/"}, {"title": "Tell me what you’re forsaking in your life to pay for IVF?", "content": "(This post is just a vent post!)\n\nFor example, we’re forsaking buying a bed frame, any “nice” clothes (only buying under 25-50$), and pushing off vacations indefinitely 🥲 \n\nJust wondering what other people are having to sacrifice for this as well!", "num_comments": 149, "score": 53, "top_comments": ["Money for a downpayment on a house", "Sleeping in, lol. Those morning ultrasound appointments are KILLING ME 😭😭😭", "Home ownership. Also living where we want (staying here because it was discounted rate, could make more money elsewhere). And vacations", "I bombed an interview two separate times for a promotion at my job because the fertility meds made me so anxious that I couldn’t function. I could have really used the promotion and instead I bombed so hard that it will never happen. I’m so embarrassed that I can never apply for that job ever again.", "New clothes, hair, nails. Fixing our dishwasher or the leak in our shower. Replacing the very old heater that we pray doesn’t go out.\n\nEdit to say I also buy all of our groceries with coupons!", "I see your point, but I would give up everything....", "Insurance covered some for us, but it still cost thousands due to multiple rounds and the medicines. \n\nThings we have given up/put off: \n\n1) A bigger house in a good school district would have been nice to grow the family. (we plan to homeschool since we are in a bad district, and fortunately one of us has a specific college background for this).\n\n2) Also more retirement contributions.\n\n3) Replacing my husband's old car. It could have graduated college by now, but it's reliable, thankfully. \n\n4) vacations. I would LOVE to go the beach for a week. My husband did take one flight to visit family during the holidays a couple years ago and I went with him this year, but no 'just us' vacations. \n\nI lost my job just before our transfer, so I'm extra glad we've been frugal. IVF sucks.\n\n We've always been frugal (I grew up on the poor side of things so I'm generally scared to spend much), but this gave us the savings we needed for IVF. When we started planning to have a baby we started going to garage sales and got the clothing for almost the full 1st year, a swing, a not-recalled playpen with bassinet to use instead of crib; bouncer, swaddles, lots of little kid books (I know the library is an option, but reading is important to us and I'd rather they destroy a cheap garage sale book than a library book) etc. \n\nPretty cool that we got to store that stuff for a few years since we didn't know we were infertile when we bought them /s\n\nThe car seat is the thing we knew we would buy new. \n\nI'm sorry you are dealing with infertility. I hope you have success at the end of this journey.", "House money to YOLO in 0 DTE SPX option. \n\nThis is actually death spiral in away because i could have made 5K easily today if i yoloed 500$ (yes it went to 1000% in 4 hrs) which is enough to pay one cycle. \n\nInstead i play SPY yolo with 10-20$ and then even if it hits the jackpot like today, it's only 100-200$ profits which is even less than weekly grocery and dine out. \n\nLife sucks to me", "40K after next cycle and we pulled from our retirement fund. We also may never own a home at this rate.", "My sanity, making all these Frappuccinos", "I slowed down my contributions into 401k and into my roth IRA.  I thought about using the equity in my house to pay for ivf but I don't want to go down that road and take on more debt.  I did pick up a part time job so  I work 2 full time jobs and 1 weekend job.  I'm exhausted but it's paying for IVF.", "REALLY nice vacations for the money that we spent already.", "Staying at a job I hate because infertility treatment is covered via insurance. It’s not covered 100% but with the cost of IVF anything helps. Ughhhh!", "not a lot to be honest, a lot of the things that we've prioritized haven't been affected. we're very good at budgeting (i teach and coach people on how to!) but also very clear on what priorities are so that we don't feel like we're forsaking anything. my only advice is not to look at is either/or. we've still managed to go on small vacations and adventures. travel plans have been made regardless of outcome. i try not to let life pass me by", "Vacations! I just want a beach and a margarita.", "We bought a house then started IVF a few months later. Took out an IVF loan. While paying the loan we are sacrificing furniture in our home, extras like going out to eat and vacations", "Spent about 150,00 on IVF. So we live in a half-renovated house and I am borrowing a car. But it is worth it and we remind ourselves that we can do the things that require money when we are older. NOW is when we need to focus on the baby! Look luck and keep the faith!"], "link": "/r/IVF/comments/11hbohj/tell_me_what_youre_forsaking_in_your_life_to_pay/"}, {"title": "Getting concerned", "content": "I have my consultation on the 30th and I’m starting to get a little scared I’m making the wrong choice financially.\n\nI have great insurance, covers treatments and diagnoses up to $30K lifetime max. On top of that I have about $20K saved, and maybe $5K of wiggle room on my credit card, but that’s it. I can’t take out loans any time soon (currently in process building a house) and I’m getting terrified that this is just out of my depth. \n\nDoes this seem like enough insurance coverage/ funds saved up for at least a single round? I just don’t want to be put in a situation I can’t recover from.", "num_comments": 27, "score": 7, "top_comments": ["With a 30k lifetime max it may be worth buying the medications yourself.\n\nThe private purchase cost of meds is usually a lot less than what they charge insurers.\n\nIf buy those privately you can save your lifetime max for things that you can’t self finance as well such as the retrieval itself."], "link": "/r/IVF/comments/ztl9vi/getting_concerned/"}, {"title": "Acupuncture - Boston Area (TW: Success)", "content": "I'm not sure if this type of post is allowed, but I just wanted to share my experience as I know a lot of us in here seek acupuncture before, during, and after treatment. I went to Point and Balance in Needham, MA, and saw Leah, and I can't say enough good things about her or her practice. I credit my successful transfer to a lot more than just acupuncture, but wanted to share in case anyone is looking for a place to go. She specializes in infertility and pregnancy points. I \"graduated\" from seeing her at twelve weeks and she just reached out to me (I am almost 30w now) to check on me and see how baby and I were doing. I'm not affiliated with them nor did she ask me to post this, I just felt compelled to since I know I struggled to find a place when I was looking. ", "num_comments": 0, "score": 6, "top_comments": [], "link": "/r/IVF/comments/1ae4qsh/acupuncture_boston_area_tw_success/"}, {"title": "Financial stress associated with IVF/FET", "content": "Hello all,\n\nFirst time posting in this community and am very happy to have found this group. I was wondering if anyone else is feeling financially stressed out? Especially if you're over 40 and don't qualify for any kind of funding (Ontario has a huge wait list for some of the fees and it's been really discouraging not being able to access any sort of financial help). In Ontario, the fees can get very steep and you try to pay for treatments using a line of credit or a credit card. It's like when I read about people who go back to school in their 40s or 50s and they have to take out lines of credit, or use their credit cards for tuition fees, books, all costs associated with that - all the while raising a family and paying for a mortgage, car, etc. It's not easy for anyone.\n\nIt's so challenging, going through IVF, egg retrievals, medications, multiple ultrasounds, blood work, FETs etc and have the additional challenge of the financial strain/drain. One saving grace I have is that my benefits cover all the medication associated with these procedures. Has anyone else felt stressed out over the costs and how you have to incur a lot of them over a period of time? Or is it me? Am I worrying for nothing, making a mountain out of a molehill? Thank you in advance and have a great day.", "num_comments": 17, "score": 8, "top_comments": ["You’re definitely not alone!\n\nI’m 37 and currently trying to sort out the financials so we can get started on our first cycle in the upcoming months. Our insurance covers nothing and we make too much for medication assistance (although we are both public servants). We don’t have a savings that would cover the multi cycle package we would like to go with, so we are looking at lines of credit or maybe some assistance from a family member. I spent a lot of today crying after looking at interest rates. It’s tough!", "My insurance doesn't cover it either. We took out an IVF specific loan and will have to ask family for help if the first cycle is a bust. My husband has a dominant genetic condition so the odds aren't exactly working in our favor. It's a pretty sickening feeling."], "link": "/r/IVF/comments/hsjprs/financial_stress_associated_with_ivffet/"}, {"title": "paying for IVF", "content": "It's no secret that IVF is expensive. What are some ways  to help with the costs? I'd love to hear how you've made it possible.\n\n Currently \"saving money\" or \"get a job with better coverage\" is not an option...\n\nI get some coverage with insurance and will be paying for probably at least $15k out of pocket including meds. \n\nI'd rather not do a credit card with high interest rates. I've considered a loan option from 401k Roth. Benefit is this wouldn't affect debt ratio. Would love to hear more ideas.", "num_comments": 16, "score": 1, "top_comments": ["We did a 18 month 0% interest credit card through US bank. At one point they were offering 24 months. There's always the option to do a balance transfer after 18 months to another card for usually a 3% penalty.", "I switched jobs and we moved cities. I enjoy my job but finding their insurance plan online and seeing IVF coverage with no waiting period for endometriosis was the biggest factor.\n\nEven in states that do not mandate coverage, there are employers that offer it.\n\nI have heard of some getting medical credit cards that have 0% or moving the charges to 0% credit cards for the introductory period. A friend of mine took out a loan with one of the fertility financing companies."], "link": "/r/IVF/comments/1194kca/paying_for_ivf/"}, {"title": "Clinic vent", "content": "Why, IN THE NAME OF ALL THAT IS HOLY, do you have to be such a nag to get answers to even simple questions??? Why, even after being the most annoying (but respectful!!! always respectful!!!) patient on the planet asking for updates, do you get sent INCREDIBLY COMPLICATED FINANCIAL PAPERWORK AT THE LAST MINUTE AND TOLD YOU MUST HAVE PAID IN FULL WITHIN TWO DAYS OR YOU WON'T BE ABLE TO START THE CYCLE YOU HAVE BEEN ASKING ABOUT FOR WEEKS????? \n\nWHY, OH WHY, COULD THIS PAPERWORK NOT HAVE BEEN SENT OVER WEEKS OR MONTHS AGO SO I COULD GET MY FINANCIAL DUCKS IN A ROW?????????????????????????????????? \n\nI am EXTREMELY lucky that I have access to funds (in that I will put it all on a credit card and free up the cash before the bill is due) but jeez, if I were seeking a loan or whatever for this I guess I would just be... SOL for no good reason??????????\n\nTHANKS FOR LETTING ME VENT HERE", "num_comments": 17, "score": 59, "top_comments": ["PREACH  & all the above. \n\nIn order not to stress myself out if vent too but it gets me too riled up. So I’ll just say been there !", "Our clinic is a hot mess. They won’t respond. Send incorrect information. Will not complete documents and send to insurance and say they had. They will not send anything to insurance and will not advocate for us. We are now waiting almost 90 days for our next egg retrieval approval. Slowly coming to peace that this may not be in the cards as I do not have 30k for a round with a 7% chance of getting a viable embryo"], "link": "/r/IVF/comments/13w1j30/clinic_vent/"}, {"title": "Our surrogate is about to schedule her one day work up. Any suggestions on how to save money throughout the journey?", "content": "Our surrogate passed her initial medical screening so she’ll be scheduling her one day work up shortly. What are some ways we can save some money during the journey? She’s already going to save us a ton because she has surrogacy friendly insurance. \n\nThis is what we’ve planned so far:\n\n-Leverage work hotel/car rental promos\n-Pay for everything with credit card for 2% cash back\n-Follow recommendations on here for purchasing fertility medications\n\nThanks!", "num_comments": 11, "score": 3, "top_comments": ["I don’t have tips for what you can do on your side, as a surrogate things that I do to save my IPs money is try to book appointments on days I work from home so my hours are more flexible and I’m not asking for lost wages, but maternity clothes second hand, I sleep at their house instead of a hotel when I travel to the clinic. My reimbursements have been pretty basic, I buy the cheapest brand or buy in bulk when I need things for the pregnancy. I’m also independent so no agency fees.\n\nThe biggest things you can do are skipping the agency and go the Indy route but if you’re already at this stage you’ve already made that choice (I assume your Indy or would like ask this question to your agency)"], "link": "/r/IVF/comments/11b4k4p/our_surrogate_is_about_to_schedule_her_one_day/"}, {"title": "FastIVF experience", "content": "Super pleased that I went with FastIVF to order my meds! From my experience every time I called someone always answered and helped me! \nAs soon as my dr faxed my medications I received an invoice (within hours).\nPaid with credit card the next day and by the next day my meds were shipped! Meds shipped 6/6/22 and received yesterday 6/13/22! \n\nLike I mentioned this is from my experience. I remember looking for posts when I was searching for a reasonable med company since im paying out of pocket.\n\nFor reference for my meds & credit card fee I paid about $2800 for Stim meds.\n\nHappy to answer any q’s!", "num_comments": 3, "score": 3, "top_comments": ["Thanks for sharing - how much did you get for $2800?"], "link": "/r/IVF/comments/vc75cz/fastivf_experience/"}, {"title": "Foolishly optimistic?", "content": "Hi there,\n\nI just found this subreddit and started reading through some posts, and now I'm wondering if maybe I should stop. I'm 41 and doing IVF for the first time. It took months and months to finally get clearance due to some other issues I had going on. I'm on Day 5 of stims and went in for bloodwork and ultrasound today. Sounds like they're seeing 10 follicles but none of them have shown any growth or change since the day before I started stims.\n\nMy doctor said this is nothing to worry about, but of course I'm worried.\n\nI foolishly thought the hard part was over once I finally got clearance to begin, but now that I'm reading some of these posts, I realize I was being completely naive. I just sort of thought that this would work. That it would work the first time. I'm surrounded by a lot of people that did IVF successfully, on the first try, and some people have several successful children through IVF.\n\nBut I now realize that lots and lots of things can go wrong.\n\nI also never questioned my doctor's advice about freezing embryos and doing testing, but am now realizing there is a whole debate about the benefits of testing and the accuracy of results. \n\nI'm suddenly beset by doubts and questions. Should I request that they try a fresh transfer so we don't lose embryos through freezing/thawing/etc? Should I be doing other lifestyle changes (the doctor didn't even mention changing diet or anything)? Should I be worried that none of my follicles seem to be responding to the stims? \n\nHere's another obvious but dumb question. Why are so many people saying ER is painful? Aren't you asleep during this procedure? Is this something I should be mentally prepared for?\n\nI think I'm spiralling. I know some of these questions are super basic but I'm almost afraid to start googling because of what I'll find and whether it will just add to my anxiety.\n\nWould anyone mind giving me some gentle guidance and maybe sharing some positivity?\n\n&#x200B;\n\nThank you\n\n&#x200B;", "num_comments": 56, "score": 21, "top_comments": ["By day 5 I haven’t had much growth either. I normally start to see some around day 7/8.", "At 41, I would test the embryos.\n\nIn terms of pain, some people do feel pain or discomfort during the retrieval because they receive lighter sedation, whereas others don't feel much because they are more deeply sedated. However, it is very common to feel pain or discomfort after the fact.", "I’m 33, I tested my embryos. I had no pain whatsoever during the egg retrieval. Frozen transfer was uncomfortable but not painful. I was just laying there thinking that this was not how I planned to make a baby. \n\nFor my two ERs I didn’t have a lot of follicles. Some clinics try to get a lot of eggs and some try for something in the 10 range. After 2 ERs I ended up with 5 PGT-A normal embryos. \n\nMy first fet failed to implant and my second ended in a miscarriage at 6 weeks. BUT, literally every other person I know personally who has done ivf had success on their first FET so it’s definitely possible. Just not for me. Ivf is horrible but I’m trying to remain grateful that it exists to give ppl like me with “unexplained infertility” a shot. I’m now playing the waiting game before I can do a third FET.  Need my Hcg to be under 1 and get a period post miscarriage. \n\nGood luck!", "Because I viewed my first round as diagnostic I was not disappointed by the results. My second ER resulted in 2 high grade embryos", "Day 5 is really early! You won't have any idea how it's going until your next scan or the one after.\nDefinitely test your embryos. I'll be honest that I don't really understand the controversy but I know euploid blasts consistently have success rates of between 50-75% ish depending on lab and grade. I know of one study that found mosaics had a success rate of 8/64 and one study that found that aneuploid blasts had a success rate of 0/124. Of course all those embryos had to be tested to do those studies but they are pulling cells from the trophectoderm which becomes placenta, not the ICM which becomes the fetus. I personally find the advice to skip testing completely baffling, especially for older patients.", "Frozen embryo transfers have a higher success rate, and the risk of losing them in the freeze/thaw is low enough that the benefit outweighs the risk.\n\nYou are under anesthesia during you ER, as long as you have a healthy BMI. When you wake up, you will be SORE for several days. I lived with my heating pad on my stomach until I felt better and that eased the pain a bit. As an example, for the first couple days just the action of sitting down sent shooting pain up from the area. If I sat down slower it was better, but definitely present. I'm sure the pain of birth will be far greater.", "You should get off this sub if you’re feeling anxious. A lot of us here are not lucky enough to be one and done. There are plenty of people out there who can have one egg retrieval and one transfer. This group can be a great place to vent but it’s OK to leave for a bit. I know I have.", "Hi! \n\nI can’t remember about my growth at day 5 of stims, but is your estrogen rising? If your Dr said that’s normal for there to be minimal growth at this stage, I’d stick with that.\n\nEgg retrieval - my last one was the most uncomfortable, my second one was not uncomfortable at all, my first one was in between. I got 1 euploid embryo from the first (I was at risk for OHSS); second I got no embryos (but I got kissing ovaries which was not fun at all), and third round I got 2 euploid embryos (long lupron protocol). \n\nIt’s ok to learn as you go - there are so many up’s and downs in IVF that I think you have to allow yourself to be optimistic, grieve when you need to grieve, etc. 💕💕💕 wishing you all the best!"], "link": "/r/IVF/comments/17pw57z/foolishly_optimistic/"}, {"title": "IVF tax return", "content": "Hello everyone, I am sure we have people from all over the place here. But I am looking for someone that is from Nova Scotia Canada. I am trying to find out how to submit the claim for the fertility tax credit. Have anyone done this before and could share information??\n\nThank you.", "num_comments": 3, "score": 8, "top_comments": ["Hi from NS! It’s the first year the tax credit has been offered so I don’t think you’ll find someone who has yet. I’ll be doing it myself soon though! \n\nApparently a guide is supposed to come out for submitting it? One of the doctors at AART mentioned that to us in December. I’m still waiting for my T4 so haven’t looked into it yet."], "link": "/r/IVF/comments/117l5gv/ivf_tax_return/"}, {"title": "Embryo transfer strategy: starting with lower graded?", "content": "TW: lots of embryos\n\nI’ll start if by saying that I am coming from an extreme place of privilege. \n\nI’m 34- my recent er yielded:\n\n22 eggs, 20 mature, 18 fertilized, 14 blasts (5 were day 6) and 9 pgt a normal, 1 mosaic\n\nI credit this to: a great Doctor who worked my retrieval protocol like a mastermind (if you’re in the nyc area let me know- i have a doctor rec for you), pcos, years of birth control and coq10 \n\nWe are prepping for the frozen transfer now- here is my question:\n\nHas anyone started with lower graded embryo intentionally? My thinking is this- I only have 1-2 highly graded blasts (3AA and 3BA) and the rest are average (2bc- 3bb).\n\nI do worry that tubal disease and possible endo could cause possible implantation challenges - and since much of ivf is trial and error and the first fet fails- this could inform our protocol for the next fet (lap, lupron etc).\n\nIf the lower grade transfer works - even better- I have my baby!\n\nIf you used or considered a strategy like this/ would you mind sharing the results?\n\nThank you in advance and hugs to everyone in the thick of this!", "num_comments": 16, "score": 3, "top_comments": ["Since your embryos are PGT tested, grading really doesn't matter. I wouldn't worry about it at all. You have plenty of embryos to result in a live birth. Honestly I would just let the embryologist choose which one to transfer without paying much mind to it since they are all normal (unless of course you would like to pick sex) \nGoodluck and congratulations on a very successful retrieval. 🍍🍍🍍", "Hi - would you be willing to share your doc? I’m in the city now - fellow pcos, good retrieval results but my attrition/drop off rates were so high :( \n\nUnfortunately, RE doesn’t want to try anything / adjust meds too much because my estrogen levels were already high and he believes there’s not much variability from one cycle to the next. So I’m just wondering what’s going to change then. Sigh."], "link": "/r/IVF/comments/17demk0/embryo_transfer_strategy_starting_with_lower/"}, {"title": "Progyny Bill", "content": "Hello everyone,\n\nI received my first Progyny bill today and my partner wants to pay half of it. He wants to pay with his HSA but we are not married. Is this even possible? I imagine not and we will use a credit card but want to make sure.  Thanks for any input :)", "num_comments": 6, "score": 3, "top_comments": ["An HSA can only be used by the owner of the HSA and their spouse/dependents, otherwise he is using it for a non qualified purpose and will need to pay tax and penalty on the distribution."], "link": "/r/IVF/comments/znqjhw/progyny_bill/"}, {"title": "Tax Bill/Return - US-based", "content": "For those paying out-of-pocket, how were you able to declare fertility medical expenses in your taxes to get some of that credit to offset your tax bill? Did you have a bigger return for the year? I am just trying to understand if my expenses will at all  offset my tax bill this year.", "num_comments": 12, "score": 3, "top_comments": ["You can claim an amount over 7.5% of your AGI.  If the amount over 7.5% is less than the standard deduction than the standard deduction makes more sense.\n\nFor example if your AGI is $100k.\n\nAnd your medical expenses were $20K\n\nYou can claim $12.5K ($20k-7.5K).\n\nThe standard deduction is $12,950 ($25,900 married).  So if you had nothing else to itemize taking the std deduction is better."], "link": "/r/IVF/comments/wmhgxr/tax_billreturn_usbased/"}, {"title": "Duo Stim and DOR", "content": "I’m just here to give hope to my DOR peeps! I’m not in the clear yet but I just did a luteal phase stimulation and got 5 mature eggs. Previously I was only getting 2-3. Of those 5, all were mature and 4 were fertilized. I just found out 3 made it to blastocyst! I’m SHOCKED. Now we wait to see if any are normal. \n\nThese are my best results. I was about to give up and I’m so glad my dr tried duo stim with me. If we have to do another round, she said we would do a luteal phase round. I’m sharing this to hopefully provide some hope to others in my situation. \n\nI also added acupuncture this round and I know my acupuncturist will take some credit 🤣", "num_comments": 6, "score": 15, "top_comments": ["Congrats on the great results. Hope they come back normal."], "link": "/r/IVF/comments/155vquj/duo_stim_and_dor/"}, {"title": "Insurance/Billing", "content": "I graduated from my clinic on 6/9 (also my last date of service). According to my portal, I have a 1300$ credit. I messaged the billing department on 6/26 to ask about how/when I could expect my refund.  They said as soon as everything is cleared with insurance, I’ll get a check.  I should add that at this time, I could see on my end that everything had been processed with insurance. It’s been almost 6 weeks since I last reached out and almost 8 weeks since I had my last service. Anyone have any idea on when I could receive this refund? Should I message them again?", "num_comments": 1, "score": 1, "top_comments": ["I’d check back! And tell them it looks on your end that insurance has completed. Advocate for yourself! Is there someone you can call directly?"], "link": "/r/IVF/comments/15h3vl6/insurancebilling/"}, {"title": "Financing IVF", "content": "Hello all,\n\nWould anyone be willing to make suggestions as far as how they were able to finance the IVF? I dont mean specific private details, but maybe ways that worked best for you? Credit cards, loans, etc? Also, any advice for a family on 1 income?", "num_comments": 39, "score": 19, "top_comments": ["If you’re a one-income family, can the other person get a part-time job at one of the places with great infertility benefits? I know Starbucks is tossed around a lot, because you only have to work 20 hours/wk as a barista to access the excellent benefits, and I think B of A? I’m sure there are more but I’m not sure where.", "Financing is tough. I always suspected I would need IVF treatment so I eyed the type of infertility coverage offered by different jobs when I was looking. I know it’s different state-by-state and company to company but it’s worth it to me, to stay at my current job earning less than I would at another hospital, because I could never afford out of pocket what my coverage provides. Are there any career opportunities worth pursuing that would provide any infertility coverage? Obviously those are major decisions to make so I don’t suggest that lightly. Personally, I would consider moving for IVF coverage but I don’t have geographic family tires and I understand that can be complicated for a whole host of reasons.", "We applied for the infertility financial support that our clinic gave us information on. Unfortunately, we didn't meet the requirements. Ran every thing through insurance, many of the medications were covered and not considered fertility drugs. Used a rewards credit card to get cash back. Also, ask the doctor specifically if they are able to provide discounts. We went to two different clinics during our journey. The first clinic, the doctor waived his part of the fee for one of our transfers. The second clinic, they gave us a percentage discount. Never hurts to ask, worst they say is no.", "My partner and I used BetterMed (https://[https://bettermed.com](https://bettermed.com)) to apply for financing for our IVF treatments. You should not immediately pick the IVF financing option that your clinic is offering, as typically they may not be the best choice. I did my research for the past few weeks and fortunately I found Bettermed. We were able to get approved and at the same time use the fertility centre of our choice. Bettermed made it happen for us by working with the clinic and it was a very easy process. Not only that, I looked into carecredit and alphaeon and as well as other loans, and to be honest with you, I wasn't that impressed. You also really have to understand what they are offering. The interest rates are higher and monthly payments see to increase after a few months. With bettermed, there is a $999 application fee but it is truly worth it because when  you do the math, you are saving money over a long time and the monthly payments are lower and it makes it more affordable. I currently have a 0% interest rate for over 15 years and I am also deferring my payment for up to one year, as bettermed gave me that option. "], "link": "/r/IVF/comments/gdkpys/financing_ivf/"}, {"title": "AMH levels after pregnancy?", "content": "TW: Pregnancy\nI’m 27.\nWe did two rounds of IVF, one in fall of last year that resulted in 11 eggs but only 2 day three embryos and a chemical pregnancy, and one this last February which resulted in my current pregnancy (35wks) and we have two more frozen untested embryos. (I credit the HGH we added to helping us get better results this time). 9 retrieved, 8 mature and fertilized, 4 5 day embryos. \nMy question is have any of you with low AMH gone back and done another round with success? We want at least one more child and don’t want to rely on the two we have frozen/would like to bank more. I’m curious if your AMH levels were around the same after pregnancy or if you had a significant drop? \nMy AMH has been between .6 and 1.00 before becoming pregnant but my AFC has stayed consistent around 11-15 and FSH typically around 4-4.5.", "num_comments": 4, "score": 1, "top_comments": ["I did and had success. My AMH went from .57 to .4, and my body responded similarly to how it did 3 years before."], "link": "/r/IVF/comments/16v9vlb/amh_levels_after_pregnancy/"}, {"title": "IVF Financial Advice", "content": "Hello everyone, I was wondering if anyone has had luck with getting pell grants to help pay for IVF? When I look into them, it usually saying that it will only pay for a doctor in the state I live in. I live in southern IL about 25 minutes outside of St. Louis. All of the good doctors are in St. Louis, and most specialists, you have to travel to STL to see. My fertility specialist is in STL, Missouri. Am I going to have trouble finding a pell grant to help out with IVF costs? Anyone else with this problem? Thank you!", "num_comments": 21, "score": 1, "top_comments": ["I had to use a credit card🥲"], "link": "/r/IVF/comments/1av5y7s/ivf_financial_advice/"}, {"title": "Financing", "content": "Just wondering who’s gotten personal loans to finance ivf and had fair credit.  Prosper is a joke and not using them.", "num_comments": 1, "score": 2, "top_comments": ["CapexMD should work for you."], "link": "/r/IVF/comments/x1w83v/financing/"}, {"title": "Deciding between scheduling a FET or doing another ER", "content": "tw: mentions of pregnancy and mc. \n\n—\nThis is going to be long!\n\nMy first ER yielded two embryos, an AA and an AB. They’re with the lab for PGT-A. My nurse thinks I’ll have results middle of next week (my birthday is next Tuesday so I’m manifesting good news for that!) I just got my first period after retrieval and my partner and I are discussing whether we should schedule a transfer with the hope that one or both come back euploid (more manifesting!) or go with another ER first. \n\nWe’ve had 3 pregnancies with 2 miscarriages and an ectopic. I have PCOS, and Clomid and Metformin helped regulate my cycles enough that these were spontaneous pregnancies. My progesterone with all 3 was low and slow rising and is probably part of the reason I haven’t sustained a pregnancy. \n\nWe have Progyny fertility insurance and with the way our Smart Cycles work, it made more sense to do IVF rather than essentially waste the credits trying medicated cycles or IUIs. \n\nWe’ve met our OOP so everything is free from now on. We have enough credits left to do another ER with 2 transfers. I know ERs are much more expensive. We could never afford one OOP but we’d probably be able to do a transfer OOP. \n\nMy clinic books transfers out 4-6 weeks and their lab is closed mid-November on. Our insurance resets in January so I want to get whatever we do in before then, which is part of the reason I’m leaning toward going for a transfer and hoping we have an embryo. \n\nMy nurse is checking with my RE about whether my ER protocol would be different this time. If not, the prep for the first two weeks would be the same both and we would at least have a transfer on their schedule if we get a euploid.\n\nBut if they are both euploid, I’m wondering if it would still be worth doing another ER to potentially bank more embryos.\n\nSo conflicted!", "num_comments": 6, "score": 1, "top_comments": ["I would bank. Good luck!", "Not sure of your age, but I just completed 2 back to back rounds. 6 blasts were sent off for testing from round 1 and I started my second round not knowing how many of those 6 would come back euploid. Doing the second round made me feel like I was doing something and due to my age I decided to go for it. If insurance is paying completely I would absolutely do another round. \n\nEdited to add: I also have progyny as well."], "link": "/r/IVF/comments/144ir64/deciding_between_scheduling_a_fet_or_doing/"}, {"title": "Fertility clinic told me to stop Estrace on February 31st.", "content": "Not a true rant! And my husband and I had a good laugh about it so I thought I’d share 😂", "num_comments": 15, "score": 40, "top_comments": ["Lmao! I’m so mentally mixed up on my meds I’d be like 👍", "HAHAHAHA I needed that"], "link": "/r/IVF/comments/1aidjz1/fertility_clinic_told_me_to_stop_estrace_on/"}, {"title": "Financing for IVF", "content": "My husband and I never thought we’d have to do IVF, so we didn’t save for it. Nor do we really want to take a year or more to save before getting started…. It’s already been a grueling two years for us. So now we’re struggling to figure out how to finance it…, from a HELOC, to a credit card, to a personal loan, etc. \n\nI stumbled upon something called Future Family….. has anyone used this before? I’ve never seen anyone talk about it, so I’m thinking maybe it’s not trustworthy? \n\nThank you everyone!", "num_comments": 30, "score": 3, "top_comments": ["I definitely recommend against using the fertility financing companies (rates 11%+). We used a personal loan from light steam specifically for IVF (under adoption, medical, etc). Our rate was about 5.25% I believe. We avoided the hassle of refinancing or taking our a HELOC. You can also get a 0% cc and put it on that, some cc offer 24 months with 0%. Good luck!", "A heloc will probably give you the best rates and then you can use it as you go. We initially went with a Capex MD loan but the monthly payments were high and the interest was high so we just refinanced.", "AMAZON!!! one of the few companies that pay for ivf through PROGYNY. Check it out. I’ll be starting on January."], "link": "/r/IVF/comments/qrqt8s/financing_for_ivf/"}, {"title": "Best Vacation to get away from IVF?", "content": "Coming off a MMC found at 10 weeks and even though I have three embryos left, they're untested and of lesser quality than the three prior I've transferred (and have failed) so thinking I'll transfer the BB, and then gear up for RPL testing and another retrieval with PGT.  BUT I think I need some sort of vacation to look forward to since everyone around me is pregnant and I have nothing to look forward to anymore. Where have you gone to get away, relax, and get your mind off things? I live on the east coast of US and could probably take a week.\n\nEdited to add/Update: wow thank you all so much for all these suggestions!! As if by fate, my husband got a points offer through his credit card for a crazy good deal with Virgin Voyages (an adults only cruise line) so I think we're going to do a cruise in the south of France and Spanish islands in June! It will be nice to have something to look forward to between this next transfer and likely upcoming retrieval-and hey if I somehow miraculously get pregnant off this transfer, floating in the mediterranean while pregnant doesn't sound so bad either! Thank you all and I hope everyone gets the trips they want, need, and deserve! ", "num_comments": 29, "score": 13, "top_comments": ["Went to japan for 14 days. Dollar is pretty strong right now, so it was cheaper than most of Europe with a same-ish flight time. Japan is just different enough that everything pleasantly distracts you but is clean and easy to figure out transportation and everyone is incredibly kind. Would highly recommend. Biggest downer: long flight and they still allow smoking indoors in many places.\n\nJapan's birth rate is extremely low. I saw maybe one pregnant lady the whole trip. There were several babies, but that doesn't trigger me as much as a pregnant person.", "I am so sorry you are in this situation but it’s a great idea to take a nice relaxing vacation. I have always found Hawaii to be serene and healing place to be personally. So much nature and culture. A week May not be enough as it’s longer flight from east coast but doable. We usually go for 10-15 days. Kauai in particular, if you do end up of visiting, I highly recommend Kauai’s Hindu Monastery for healing and meditation.", "I'm so sorry for your loss. An all-inclusive adult only resort in Mexico might be a great getaway for you. We loved the Playa del Carmen area. \n\nI just want to say I could have written this post myself 3 years ago. I also had a mmc at 10 weeks and 3 not so great looking untested embryos in the freezer. It's so unfair. I hope this vacation is exactly what you need to relax and heal.", "Japan and NYC for us!", "All inclusive in Mexico, Cancun and playa del Carmen area!"], "link": "/r/IVF/comments/11fbh1o/best_vacation_to_get_away_from_ivf/"}, {"title": "Does anyone else just make early embryos but never get blastocysts? Is it still possible to get pregnant?", "content": "Hi all. I've just done my second round of IVF (mild stims, short protocol) and both times had the same frustrating results: lots of eggs fertilised (11-14), several embryos looking good on day 3 (3-8), 0 blasts by day 6. Both times my ovaries were slow to respond to stims for at least a week and then in the last few days I got faster growth and very high estradiol levels. Mild OHSS both times and clinic wouldn't let me have a fresh transfer. I have 3 embryos in the freezer that were all frozen on day 3.\n\nI'm 37, no known fertility issues except probably PCOS. Doing IVF with donor sperm as a SMBC. I already have 1 child who was conceived naturally when I was 33.\n\nI've had this treatment at a lower cost, no frills clinic in the UK - they don't modify their treatment plan much. They haven't been able to give me any reason why this has happened on both cycles except \"maybe you have poor egg quality\".\n\nI can't afford to have any more treatment (I had to get help from family and use credit cards already and it'll be a huge struggle to pay for FETs) so please don't suggest trying again or switching clinics or things like omnitrope (I'm not sure this is even available in my country and I couldn't afford it if it was). I would just really appreciate any info or experiences of successful frozen transfers of day 3 embryos as I don't know anything about this really, everyone I know who's done IVF managed to get blastocysts. Also is it normal to feel devastated by results like this??? I feel like I should be happy to have 3 embryos but I feel so scared and heartbroken and like I've failed.", "num_comments": 13, "score": 9, "top_comments": ["First, it’s so normal to be devastated by so many things through the IVF process. \n\nSecond, (TW- for making blasts) I have done 3 egg retrievals. I did make at least 1 blast per ER, but I had major attrition between day 3 and day 6/7. I am doing my first transfer this week and if it doesn’t work I’ll do another ER (banking for multiple children as I have none). My *new* doctor suggested two things: 1) this could be due to DNA fragmentation based on the timing of when things break down (so a potential issue with the donor sperm, not sure if they test for DNA frag); but more relevant to you 2) she recommended a fresh transfer with a day 3 embryo. \n\nI obviously haven’t had success yet, but I thought it could at least be helpful to hear you’re not the only one getting this recommendation.", "My doctor advised that a major drop after day 3 (greater than 50%) indicates a sperm issue. Maybe worth it to do some more sperm analysis if possible. Sorry you are going through this :("], "link": "/r/IVF/comments/18fspq2/does_anyone_else_just_make_early_embryos_but/"}, {"title": "Word/theme for 2023 for TTC/IVF?", "content": " I enjoy thinking of a word or theme of the year.  I can’t even tell you what the word for 2023 was, but it is a fun thing for a couple months.\n\nWe have had our consult for IVF, but are struggling for the funding for $16k for one round of IVF; prices are going up by 20% at the turn of the year.).  The pandemic led us to accrue more credit card debt than we expected, along with other struggles, like most of us.\n\nWe were denied for our loan we applied for. So now we are going to PREPARE by paying some debt off, and also PREPARE by (hopefully) raising my husband’s significantly low SA results (2% count) with Clomid.\n\nOur new clinic’s name is a spin on the name Positive.  \n\nI was thinking “positive” would be a great word, but I am pretty anti toxic positivity, and felt I wouldn’t want to be reminded of the harm toxic positivity has done in my life.\n\nI think I have landed on “prepare.”  Go back a couple paragraphs, and you’ll see I’ve capped that word twice. I can also use “prepare” for work, the week, and weekends that I know will be hard, etc.  It is a word I can incorporate in my husband’s life without being obnoxious about it. We can prepare our bodies, hearts, soul, and home for everything that comes with IVF, pregnancy, and baby — the good, the bad, and the ugly.\n\nDo you have a word or theme for 2024 for TTC, IVF, and everything after?  What about for life away from TTC?", "num_comments": 8, "score": 6, "top_comments": ["I would say peace is the goal - something I’ve been craving this year is some mental peace from all of the anxiety that comes with this process and I’m really trying to manifest it for 2024", "I don’t have a word, but for funding, have you tried applying for grants? On IG cozywarriororg gives out fertility grants! I think it would be worth checking out and see if you qualify."], "link": "/r/IVF/comments/18qo9pl/wordtheme_for_2023_for_ttcivf/"}, {"title": "does progyny cover for embryos storage with approved authorization?", "content": "I got a call today morning that my embryos have tested abnormal and now I am stuck between the clinic and progyny to pay for the last month's storage. Progyny told me they will cover 1 year of storage free with my IVF authorization and today my clinic called saying the claim was denied and I paid using my credit card. Women have enough shit to deal with , why can't some things be smooth in this journey.", "num_comments": 14, "score": 1, "top_comments": ["They are supposed to, I’d call Progyny."], "link": "/r/IVF/comments/tfnnb3/does_progyny_cover_for_embryos_storage_with/"}, {"title": "What happens to payment when the clinic cancels your cycle?", "content": "I’m wondering what happens to the payment of a planned cycle when the doctor suggests cancelling. What are you on the hook for? Meds? Appointments? Ultrasounds? What did you pay for your cancelled cycle and in what part of the world?", "num_comments": 11, "score": 0, "top_comments": ["I never had to cancel a cycle but during the initial consult my clinic made it very clear that in the cases where there was a cancellation we would be responsible for the cost of all test/procedures/ultrasounds that had been conducted at the time of cancellation. Any unused portion of the money would be used toward the next cycle. \n\nEdit to add: This was in the US.", "You're on the hook for anything you have used. So medicine you have already purchased, appointments you went to, bloodwork you did, etc. If you have medicine you bought but did not use you can use it on your next cycle to save some money (as long as it hasn't expired or gone bad like Lupron that can only be open for 30 days or something). \n\nTypically, the clinic will charge upfront for all of your expected medical appointments. Anything you paid for an unused appointment will be rolled over as a credit towards your next attempt. They should not charge you for appointments that you did not attend after your cycle was canceled."], "link": "/r/IVF/comments/1amwpck/what_happens_to_payment_when_the_clinic_cancels/"}, {"title": "Tax Deductions for Out-of-Pocket IVF Expenses: Experiences and Advice?", "content": "\nHi Reddit,\n\nMy partner and I are currently embarking on our journey with IVF, which we've found can be quite costly, as I'm sure many of you are aware. We are planning to pay for these expenses out of pocket, and we're trying to understand the tax implications of doing so.\n\nFrom what I've researched, medical expenses, including fertility treatments like IVF, could potentially be tax-deductible. However, it seems that the deductible portion is only the amount that exceeds a certain percentage of our adjusted gross income (AGI). \n\nI was wondering if anyone has experience with this and can provide some insight. How much were you able to write off for your IVF treatments? Did it significantly impact your tax return? What kind of documentation did you need to keep? Were there any unexpected pitfalls or things to be aware of when claiming these expenses?\n\nAny advice or personal experiences would be greatly appreciated! We're definitely in unfamiliar territory here, and while we plan to consult with a tax professional, hearing from others who've been through the same process would be extremely helpful.\n\nThanks in advance for your wisdom", "num_comments": 37, "score": 21, "top_comments": ["I'm in the US and doing IVF allowed me to get a tax refund last year since I could itemize all my deductions from spending so much money. I used turbo tax and got a decent refund from my federal and state taxes. If you spend more than 7.5% of your AGI then you can deduct your medical expenses. I tried to keep all my IVF receipts in one folder so I don't lose them. I also kept a spreadsheet to monitor expenses throughout the process so I wouldn't forget anything and for myself to see how much I spent. Check out the IRS website for info on what you can count as a medical expense. https://www.irs.gov/taxtopics/tc502\n\nYou can deduct travel expenses if you have to travel to get your IVF done too I believe.", "Where are you located?\nIn Canada you can definitely claim if your medical expenses are above a certain threshold relative to income, but IVF would almost certainly meet the threshold. I think I ended up saving about $4000 in taxes from a previous egg retrieval only (so maybe 20%), but it will obviously depend on your location, your income, your tax rate, and the amount of the ivf treatment. I did get audited on my medical expense claim and had to submit my receipts, but that was the end of it.", "Remember that it's not just IVF medical expenses that are deducted. You should track normal doctors visits, chiropractor, acupuncture, massage therapy (with a doctor's prescription) and any other medical appointment in the calendar year. Travel is also deductable so you can track and claim the IRS medical mileage rate which I believe is .22 this year.", "Following - I too have been paying out of pocket"], "link": "/r/IVF/comments/157kk9o/tax_deductions_for_outofpocket_ivf_expenses/"}, {"title": "Good prices for IVF in US", "content": "I just wanted to share some ideas for people who are in the “shopping around” stage. I thought anyone in the US who felt they got a reasonable deal could share. Please don’t put what your price was AFTER insurance covered. It’s not really helpful as the majority have no insurance for ivf.\n\nIn 2016:\n\n**University Of VT Medical Center:** $6995 for everything. **Included meds**, transfer, and monitoring. My meds even had to be upped and they had me come in and gave me the extra meds, free. Sperm vials were only $250. They did not do PGS testing, but would ship it if you wanted it.\n\nNow:\n\n**CNY**: $5000. ICSI, monitoring, transfer, and a year of storage included. Meds and all other extras not included. Offered reasonable FETs and PGS also.  3 places in NY, one in GA, one in CO. Financing with no credit check and 200% acceptance. $250 for every 6 months of financing.", "num_comments": 34, "score": 26, "top_comments": ["[deleted]", "Are you doing your monitoring thru CNY? I'm curious how much it usually costs if you're traveling to CNY and have to do monitoring at a home clinic? Also, if you're traveling was it easy to get your home clinic on board with monitoring? Basically curious how all that works."], "link": "/r/IVF/comments/r3m4s4/good_prices_for_ivf_in_us/"}, {"title": "Rant … can’t do anything", "content": "43 f. Started journey at 42.5 with 2 failed iui\nI did first and horrible er in may. 3 follicles, 1 was an egg and turned out it was bad quality too.\nMarried late and turned out h has Ed. Then turns out he has some financial frauds to his credit. Sent him out. But still called him just for sperm. It’s one year of separation and no reconciliation.\nThen since June I’ve been taking alternate medicine (Ayurveda) and my Amh seemed to be increasing. Today(cd2) I checked with a different lab and it is 0.04 … so not much chances there \nI lost a costly gold necklace in between all of this.\nI attended a job interview referred by my previous boss and the interview went so bad they told me in the interview that I didn’t clear . They didn’t even do the formal “we will get back” etc. \ndad is sick. \nNothing … literally nothing is going well in my life and I have no where to go… no one to cry to. No shoulder to lean on. I made another appointment with the ayurved med and let’s see what he can say. I feel I wasted time with the other lab. I am just so lost and tired am going cry myself to sleep.", "num_comments": 2, "score": 3, "top_comments": ["I'm really sorry to hear that you're going through such a tough time. It sounds like you've faced multiple challenges, and it's completely normal to feel overwhelmed. While I can't fully understand how you're feeling, please know that reaching out for help and support is a positive step.\n\nDon't hesitate to lean on professionals and friends or family who can offer guidance and a listening ear during this difficult period. Fertility can be incredibly challenging, but there are people who want to support you. Take it one step at a time, and keep reaching out for the support and care you deserve. \n\nIn challenging times like these, it's crucial to remember that while it might seem like there's nothing good, it's worth the hard work to shift your mindset towards positivity. I've personally been through a very rough patch in the past year, where it felt like everything was falling apart, and I couldn't see the silver lining. Strangely, the more I dwelled on the negativity, the more things seemed to spiral downhill.\n\nEventually, I learned that focusing on even the tiniest positive aspects of life can make a significant difference. It might not solve everything, but it can provide a glimmer of hope and the strength to keep moving forward.\n\nSending you love and hugs 💫💫💫"], "link": "/r/IVF/comments/17eqb4e/rant_cant_do_anything/"}, {"title": "Is it possible to thaw frozen eggs and fertilize them with eggs from a new retrieval?", "content": "I have been thinking of what I want to do to optimize the amount of embryos I can get from my progyny benefits with Amazon. I already did a IVF freeze all and we have 2 blastocysts frozen which are being tested. I was originally going to do another freeze all which would leave me with enough smart cycle credits for 2 transfers. But I could also do an egg freeze which is 1/2 a smart cycle then do another IVF freeze all (which would be egg retrieval, ICSI and pgt testing and embryo freezing. I was wondering has anyone done an IVF cycle where they were able to use previously frozen eggs and fertilize them along with new eggs that were just retrieved? That way all the eggs could be fertilized together, monitored and pgt tested together?? Is this possible to do whether or not you have progyny benefits?", "num_comments": 6, "score": 1, "top_comments": ["You can do it, but call progyny to make sure they won’t bill you more for fertilizing the first batch of eggs with the second. They might not allow it"], "link": "/r/IVF/comments/14k4mpr/is_it_possible_to_thaw_frozen_eggs_and_fertilize/"}, {"title": "Would you transfer? (Thin lining issues)", "content": "I’ve always struggled with lining issues, though I got into the high 6s on our first transfer (resulted in a CP). We are preparing for our second transfer next week. Yesterday they measured me in the high 5s with a 6.2. Today (with a different provider) I was 5.6 at my thickest. My questions are:\n\n1.) The lining measuring process feels very subjective. I guess it’s possible that my lining shrunk overnight, but it seems more likely that it varies based on who’s measuring. Is it possible that I’m thicker than she gave me credit for today?\n2.) Would you transfer with a trilaminar lining in the high 4s/mid 5s?\n\nOur embryos are tested, but this is our last one before we’d want to do another retrieval, so I want to be discerning about transferring. Thanks for the input!", "num_comments": 9, "score": 2, "top_comments": ["I did a transfer right around 6 (some measurements in the high 5s) and it was successful!"], "link": "/r/IVF/comments/10k5y8o/would_you_transfer_thin_lining_issues/"}, {"title": "Post Retrieval Hormone Crash", "content": "I had my egg retrieval last Thursday so 4 days ago and as of yesterday, I have been experiencing anxiety and depression. \n\nFor context, pre-egg retrieval I was placed on estrogen and progesterone to prime for my cycle, and that combination made me lose it for about a week. I was having extreme guilt, self-sabotaging and self-deprecating thoughts, panic attacks, and blaming myself for everything wrong I'd ever done. I trauma dumped on my husband for a week and it felt very unfair for me to do. I am terrified to feel this way again... however, I can feel the panic creeping back in with the hormone drop. How long did the anxiety last for you all? I felt like I ruined my life last time and was not in a good place at all and I am hoping to avoid it. \n\nI know everyone talks about rage episodes with their hormones being messed with and my rage is internal. ", "num_comments": 9, "score": 3, "top_comments": ["Oh yes, it’s totally brutal. It gets a million times better once your period starts - hang in there X"], "link": "/r/IVF/comments/1advsjd/post_retrieval_hormone_crash/"}, {"title": "retesting embryo - any luck?", "content": "One of our embryos came back 'undetermined' - just wondering if anyone has had any luck with thawing, retesting, and got a live birth from it?\n\nMy RE said that there was a whole talk about this at the American Society for Reproductive Medicine conference last month about how it's not really recommended anymore due to stress on the embryo.\n\n&#x200B;\n\n&#x200B;", "num_comments": 19, "score": 1, "top_comments": ["I was wondering the same thing. I had an embryo come back as chaotic. I’m going to ask my RE when I see him next what he recommends. I do know that you take a chance of the embryo not surviving for thawing it twice.", "I had two retrievals and each time one embryo came back undetermined. I’d had a miscarriage after an IUI due to a chromosomal abnormality and didn’t want to go through that again so I tested to avoid that (as much as possible). I did not end up getting pregnant with those embryos but it wasn’t due to embryo quality issues."], "link": "/r/IVF/comments/17rfj98/retesting_embryo_any_luck/"}, {"title": "Cycle advice: to continue, or not to continue", "content": "NOTE: PREVIOUS positive pregnancy mentioned below.\n\nHello all. I hope everyone is having a great holiday week.\n\nI'm at the start(4 days of stims)of a third retrieval cycle in our attempt for baby #2. Our first was conceived via IVF. Back then I was 38, did one cycle, had one euploid, and did one transfer(after several medicated ones were cancelled we did a modified natural and it was successful). Our daughter is 23 months.\n\nI'm now 41. My clinic stated they wanted 3 euploid embryos for transfer. So, we proceeded. Cycle one yielded zero euploid. Cycle 2: just got my results today and I have 2. Prior to this we also re-tested an inconclusive embryo from that first cycle 2 years ago and it came back euploid. I now technically have the 3 euploid my clinic recommended.\n\nDue to the financial stress of IVF I'm honestly considering stopping this cycle since we have the three. Grades: 4AB, 4BB, 4BB. The BB's are what's making me hesitate. I did already pay for the meds, so that's a loss...but not doing a retrieval with all the testing etc will save thousands of dollars when of course we already are in debt and had to open a second credit card.\n\nAnyone with a similar experience? Success with 4BB? Of course I'm consulting the doctor but let's be honest....if they agree to stop they're just agreeing to lose money, so I am highly doubting they'll think it's a good idea/be truly honest. Thank you all!", "num_comments": 3, "score": 2, "top_comments": ["I’m 24.5w with my 4BB. That is a fine grade!"], "link": "/r/IVF/comments/180rwqh/cycle_advice_to_continue_or_not_to_continue/"}, {"title": "How. How does one afford IVF????", "content": "Did anyone take a HELOC out or use their 401K??? We’ve spent so much of our savings on my husband’s chemotherapy treatment which is why we need to go the IVF route.", "num_comments": 45, "score": 14, "top_comments": ["I paid out of pocket for my first ER. For the 2nd and 3rd ER, I got a job at Tractor Supply Company working every Monday for 10 hours. I only get paid like $35 a paycheck after the insurance is taken out, but I’m not there for the base pay anyway. I just got Progyny this week and have only worked 4 shifts.", "My husband switched jobs and we found out the insurance covered IVF. \n\nr/infertility I think had a list of places with coverage.", "We had a lot of family help. But we pulled money out of our savings, I sold my soul to Chick-fil-A and saved over 4k just on my end.\n\nIt was a lot of sacrifice, but so worth it.", "[deleted]", "We went through CNY. We also did IVF due to my husband's chemotherapy/radiation treatment. Have you had a sperm analysis done? How long ago was his treatment? My husband is 4 years past treatment and I am newly pregnant through IVF after 3 rounds.", "I live in Mexico and while it’s not cheap it is much cheaper than doing it in the US or Canada without insurance. So consider it as an option if you can travel."], "link": "/r/IVF/comments/11dt9op/how_how_does_one_afford_ivf/"}, {"title": "Used up all my IVF benefits - what’s next?", "content": "We have gone through 4 cycles and only produced one good embryo. \n\nThat’s all my insurance will cover. \n\nWe decided we will go with donor eggs and I have issues with my egg quality and I’m also turning 39 soon. \n\nAre there any financing options that worked for you? \n\nI was told donor eggs cycle can range from 30k to 60k in total so having a 0% APR credit card is not possible to cover the cost. \n\nI’m looking at financing but not sure what’s the recommended one. \n\nAny recommendations? Thanks!", "num_comments": 2, "score": 2, "top_comments": ["I don’t have recommendations on the financing but I recently changed jobs to get access to additional fertility benefits. If you do, look for a company that has Progyny as they allow donor eggs in exchange for a cycle. Not sure if Maven or Carrot do that but they may as well. \n\nI do think there are some fertility focused personal loans and I’d ask your clinic about those."], "link": "/r/IVF/comments/xuw49l/used_up_all_my_ivf_benefits_whats_next/"}, {"title": "Need Advice For ER - Round 2", "content": "I just completed a very difficult ER journey and I’m meeting with my doctor to discuss a possible second round. I’d love some advice before the appointment. \n\nIt’s been very tough. I think I went into the process naively. My AMH was 4+, and I had a high number of follicles/eggs; I felt optimistic. I had also been on supplements for years like COQ10, Vit D, Iron, Folate, Omega 3, Myoinositol. \n\nI am 35, turning 36. Despite my having a high number of retrieved eggs, 22, only 4 were mature. I was on Menopur and Follitism for 14 days prior to retrieval, then given a HCG trigger. Timing was about 35.5 hours before ER. The growth of the eggs seemed uneven, a handful were big, and the rest were 10mm a couple days before ER, but I didn’t question it. Progesterone was very elevated before ER. \n\nAfter ER I developed a moderate to severe case of OHSS. I was in pain for 10 days. The doctor afterwards mentioned I seem to have moderate PCO, which she missed. Looks like my PCO was being suppressed by my 20 years of birth control use. My hormones had actually appeared suppressed so she felt confident about HCG initially. \n\nI’ve tried to get a PCOS diagnosis in the past but have gotten ignored imo due to being lean without acne or other telltale signs. But I credit this unofficially to BC use. If I get off BC I get severe cystic acne on my chin. I got off BC for two months last year to test my AMH and it was 6+.\n\nI’m meeting again with the doctor who seems optimistic about a second round. Has anyone experienced high # of eggs, low maturity and PCO/OHSS. What measures did you take that were helpful?", "num_comments": 3, "score": 2, "top_comments": ["My first egg retrieval with an amh of 4.7 was 10 retrieved but only 4 mature.  Second round we did lower and slower menopure and follistim, and provera instead of ganirelix to give my eggs more time for everyone to catch up and even out.  Second retrieval was 17 retrieved, 13 mature, 10 fert, and 4 ended up euploid.  My clinic also did lupron trigger instead of hcg because of my pcos"], "link": "/r/IVF/comments/18y4lvm/need_advice_for_er_round_2/"}, {"title": "What would $16k lifetime infertility coverage + $4k meds cover?", "content": "Hi. I just found out that my insurance covers $16k lifetime infertility coverage and $4k infertility medication coverage. I’m in Los Angeles county area and have Anthem Blue cross. Does anyone have similar coverage and can let me know what it covered? would it cover at least 1 cycle?", "num_comments": 12, "score": 1, "top_comments": ["A word of warning about the med prices: My insurance covered 50% of the med price, but that was 50% of the insurance rate (which was many times higher than the out-of-pocket price). It turns out it would have cost me about 7,000 to use my insurance, and about 5,000 to not use insurance. Because of the bureaucracy of it all, I had to make over 20 phone calls to get this information."], "link": "/r/IVF/comments/18biorr/what_would_16k_lifetime_infertility_coverage_4k/"}, {"title": "Financing ", "content": "Me and my partner are doing shared IVF via CCRM (Minneapolis). We are getting to the point in our journey where we’ll have to pay the full fee for the retrieval and transfer (approx $25,000) this doesn’t include medication and other miscellaneous costs but for bills I can pay out of pocket that’s usually my preferred way before I go for financing options. I received paperwork for futurefamily, lending club, and capexMD. Can members share if they used any of these services? Which one did you choose and why?", "num_comments": 1, "score": 1, "top_comments": ["I didnt use the service. But if you have the funds to pay for a lot of it out of pocket. You could sign up for a credit card with great sign up bonus. Travel points, cash back etc and pay it off immediately or get one that has a 0% intro offer for like 12-18 months. That way you get at least something out of it for having to pay out of pocket"], "link": "/r/IVF/comments/1b3honm/financing/"}, {"title": "IVF is tax deductible in the US", "content": "It took me 2 years to figure out that IVF (RE visits, stim & FET meds, procedures, labs, PGS, ovulation kits, travel, lodging, acupuncture, massage, supplements etc) is considered an eligible medical expense if it exceeds 7.5% of your adjusted gross income (filing as single or jointly). Most other medical expenses (like medication prescriptions and optometry costs for you and spouse) are eligible too. \n\nIf you use turbo tax (or similar), you can easily “mock” addend prior years to see if it will amount to a refund. \n\nNote: you’ll have to addend, PRINT and mail your state and federal addendums to receive refund. \n\nhttps://fertilityspace.io/blog/tax-season-how-to-write-off-ivf-on-your-taxes\n\nFor those of us living in ass-backwards states that don’t require employers to provide insurance coverage of IVF, this can at least refund you up to a few thousand buckaroos. \n\nMy method is to keep track of expenses on an excel sheet by monthly review of my debit/credit cards. Then it keeps a cumulative tab for me to input when I complete my taxes annually. \n\nIf you don’t know now you know!! -The Notorious B.I.G.", "num_comments": 25, "score": 66, "top_comments": ["Yeah I did it last season, it helped a bit. Nothing compared with what we pay, but better than nothing. Thanks for sharing!", "Don't quote me on this, but *I think* you could file an amendment to prior tax years if you didn't include those expenses on past years, especially if they were over 7.5% and those would have changed your refund amount. Might be worth looking into to be certain.", "Can someone explain to me again? In the link for example her AGI is $65k and her medical expense is $20k she can write off $15,025, but that doesn’t mean you get a tax refund of $15,025 you deduct that which puts you in a lower bracket so you don’t pay as much taxes. I was interpreting that you get $15,025 in refunds at the end of the year."], "link": "/r/IVF/comments/uxxh7c/ivf_is_tax_deductible_in_the_us/"}, {"title": "Feeling Hopeless at Almost 40", "content": "Hey y'all...I am feeling so depressed today.  I turn 40 in January and was needing to get normal embryos before then to stay in the Shared Risk program I'm in.  My first round gave me 1 euploid out of 5 embryos, and that FET failed.  2nd round I got 3 embryos, all abnormal.  And my 3rd attempt to start ER was cancelled yesterday because of a cyst on my ovary.  There isn't enough time to let the cyst go down before stims to give me an ER before my birthday.  I'm crushed.\n\nI am all private pay as my insurance excludes IVF 🤬.  I took out 2 loans to pay for the shared risk in 2022, not knowing about the 40 age limit.  I was 38 then.  I had terrible lining issues most of this year and it took 3 attempts, 2 hysteroscopies, and several months to finally get to transfer only for it to fail.  I just bought all these meds for this ER, and now I can't use them.  \n\nBecause of the holidays, I won't be able to talk to my financial counselor until Tuesday.  My doctor wants me to withdraw from Shared Risk, then use my refund toward a multicycle plan or something like that.  I don't even know how much refund I will get, and if it will be enough.  My credit is shot after these past 18 months of this and I can't get a new loan I just know it.  I am praying I can get a 100% refund, then I will use it for multicycle.  But I'm feeling so discouraged.  \n\nMy husband is almost 44, but has 3 kids already, 2 older teenagers and 1 in their early 20's.  He feels sad about this sure, but definitely not on the level I do.  I have some close friends and coworkers who know I'm on this journey.  My Mom knew I needed to start IVF but she's too anxious so I haven't and won't update her on anything until I have a pregnancy past 12 weeks.  I just want to crawl in a hole.  Thanks for reading, this is a place I get a lot of support.  On top of all this I'm a counselor by trade so I get to be depressed, attend my own therapy, then try to hold it together to be a therapist for others.  Ugh.  ", "num_comments": 20, "score": 27, "top_comments": ["I’ll be 40 in January too. I know nothing will happen to my body on that specific day that hasn’t been slowly happening for the last few years. But it feels like a door is going to shut on me or something. Like it’s a final nail in the coffin on the life I always wanted. \n\nI’m sorry I don’t have encouraging words for you. The best I can do is say that I’m here in the pain with you.", "Sending you a big hug and just hopes that the logistics and paperwork headaches work out in your favor"], "link": "/r/IVF/comments/18uijx7/feeling_hopeless_at_almost_40/"}, {"title": "BODY PREP FOR IVF", "content": "Hi! I will be starting IVF for the first time next month. Just wondering what are things you’ve done to help get your body ready? I’ve read some ppl do light exercises, take supplements, acupuncture etc… \n\nWhat are some things you’ve done to prepare? Thanks so much, just want to be in the best shape I can :)", "num_comments": 46, "score": 12, "top_comments": ["I think the ideal is that you are in equilibrium. So i stopped dieting. \n\nEat lots of veg and fruit, homecooked meals of whole food. Light exercise regularly, like 30mins of walking a day, swimming.\n\nBut don't start any drastic diet or exercise programme. It will stress your body", "I believe that any changes you make to lifestyle are more for your mental health. You will feel like you did everything right that was in your control. Realistically, it probably doesn’t make a difference to the results of the actual procedure. As long as you don’t smoke/drink or do drugs you’re probably fine.", "I copy this one a lot, I think I skipped writing that my husband had varicocele repair and was on clomid for a few months before retrieval 3 and 4. \n\nI responded to another post about things we did to improve our results after our second retrieval. Someone asked about a book I've seen recommended fairly often in the trying to conceive groups: \n\nI read it, and I've seen a lot of things mentioning it's not really science backed. Some people love it. \n\n However, after 2 retrievals with a high rate of abnormal embryos for our age, I was desperate so I looked up research on supplements sort of springboarding off the book initially. \n\nWe cut out most processed food and cut way back on red meat for 3-4 months. I looked on the ewg skin deep app and replaced our shampoo, body wash, lotions, deodorant, toothpaste, and mouthwash with supposedly more fertility safe varieties. I couldn't get rid of the receipts and couldn't control soaps etc at work. We already used glass or metal dishes for most things instead of plastic. Drank from stainless steel water bottles instead of plastic as well. I still drank milk which comes in a plastic jug though.\n\n The book mentioned avoiding bpa, parabens, phthalates. \n\nWe have PCOS and mfi (low morphology and motility).\n\nFull disclosure, the sperm analysis did not change, but our retrieval results were better. My stims meds were also changed by dropping the menopur, and I had my spouse do a shorter abstinence time (36 hours or less), since we used picsi, the quality was more important than the count. \n\nhttps://rbej.biomedcentral.com/articles/10.1186/1477-7827-12-112/tables/2\n\nThis is a chart for men, but the main article has one for women. They are small sample sizes, but we used the ones that showed they helped and that applied to our diagnoses. \n\nNot sure if it's on the chart, but the reproductive urologist recommended my husband take fertilaid (we adjusted the supplements in the chart based on how much he was already getting from that) as well as 500 mg of vitamin c daily. RE told us both to take 600 mg of coq10. I took inositol due to my PCOS as well and took 3 mg of melatonin nightly for egg maturity. RE was aware of all our supplements. I did stop the ones that could thin the blood a week or two prior to retrieval (vitamin e and fish oil if I recall correctly) just because I was nervous about bleeding. \n\nI took miralax due to stims, but that was mainly for constipation and because they had trouble seeing my ovary on one of the scans ( which I think was from the constipation). \n\nYes, I went back to eating terribly after the retrievals. Those hormones are no joke.\n\nETA it's good to check with your doctor because too high of doses or too long term use can cause problems with some supplements.", "light exercise, eliminate toxins/endocrine disrupters, minimized gluten/alcohol/caffeine, taking CoQ10, DHEA 25mg, Vit D, E, C, NAC, fish oil. My AMH went up from .09 to 1.27 after making the changes.", "I swear by the bebbi diet by fertility specialist Dr Kiltz for egg quality and lowered inflammation(important for transfer). You can find it online for free. I ate like that through out all my embryo banking and my first and successful FET. I also prepped with supplements from „it starts with the egg“.  I’m 42, DOR, endometriosis stage 4, autoimmunity."], "link": "/r/IVF/comments/10owod8/body_prep_for_ivf/"}, {"title": "Self Injecting Help", "content": "My husband and I started with our progesterone injections a few days ago.  The sweet man is terrified of needles so I give him a lot of credit doing our first few nights, but I think it’s best if I do them myself.  Our transfer is this week so hopefully I have plenty of time to perfect the technique. \n\nTonight I did it myself awkwardly twisted in the mirror and it’s certainly more sore than previous nights.  Anyone have any suggestions for an easy self stick with the intramuscular injections?", "num_comments": 2, "score": 2, "top_comments": ["The auto injector is a big help. I can reach the spot I'm supposed to by myself but not well enough to do the darting motion needed to insert the needle. The auto injector does that for you. \n\nIt actually may help your husband enough that he could continue assisting. That's depending on if he is just uncomfortable with the needle part and not the syringe part. \n\nI have this one https://unionmedico.com/product/super-grip/"], "link": "/r/IVF/comments/x0ecmo/self_injecting_help/"}, {"title": "Unsure what to do", "content": "I did my very first round of IVF in 2019 at 27 years old and ended up with 1 day 5 embryo that ended up being abnormal and a day 6 embryo that was inconclusive (graded 6BB). I kept it to the side and wanted to do another round to increase the number of embryos I have for possible 2 children. I recently did my second IVF cycle at 30 and ended up with 3 “just matured” embryos. None of those fertilized. My clinic thinks they may have told me to trigger too early. Now I’m stuck if I should just try the inconclusive embryo and see what happens and try a second cycle later if this is successful. Or trying another IVF cycle while I’m still young. I also used most of my companies financial IVF benefit on this unsuccessful cycle - I have enough for a transfer but not for a new cycle. I’m trying to see if I can get some sort of credit from my clinic due to the trigger being too early.", "num_comments": 18, "score": 4, "top_comments": ["I would try to do another retrieval. The ER stage is proving to be a little difficult for you, and it will not get easier with age."], "link": "/r/IVF/comments/wk6o9t/unsure_what_to_do/"}, {"title": "POI Auto-injector", "content": "A fellow redditor(not sure if she want's credit, if she does I'll put her reddit name in) mentioned this product in another post I was reading and I thought I'd share it. \n\nLink to the youtube video \nhttps://youtu.be/6dBYGUV4Ezk.", "num_comments": 17, "score": 16, "top_comments": ["Saw this and start PIO in a week or so, and so into this! Definitely buying one ASAP!!"], "link": "/r/IVF/comments/f8a220/poi_autoinjector/"}, {"title": "Sad and lost", "content": "Yesterday got the bad news again that my transfer didn’t work. This is my 4th transfer and no more eggs left. I am back to beginning with credit debts. This is the hardest because I put so much effort and the most expensive. I have done everything I can. I have taken the supplements, gluten/dairy free for 6 months, acupuncture, intralipid infusion, and genetic screening. Found out my husband is carrier for blood clot and used lovenox. I thought this was the solution but nope. What other options do I have? I’m just bad luck. I feel so lost and don’t seem to have any answers. I don’t know what to do anymore.\n\n2 IUI\n8 retrievals\n4 transfers (PGT tested)\n3 clinics", "num_comments": 19, "score": 49, "top_comments": ["*hugs* this broke my heart for you. I’m sorry you’ve had to go through all of this. I hope your heart is mended with joy one day.", "I’m so sorry about this transfer and everything you’ve been through getting to this point.  Sending you some love and hoping the path to growing your family becomes easier", "So sorry. ❤️Infertility is such a hard thing to navigate.  It’s all a guessing game.  I hate it and I hate that you are feeling so sad! Sending all the love to you and your husband.", "I’m so sorry. You are not bad luck. If you feel it in your heart try again. Don’t give up."], "link": "/r/IVF/comments/ovjgrj/sad_and_lost/"}, {"title": "Basic IVF timeline and cost questions", "content": "Considering if I want to even start going down this road, and I had a few questions, based on the research I have been doing. A lot of this ties into the cost, and I am honestly a little overwhelmed and nervous about potentially having to go into debt (which would likely be my only option, in order to pursue treatment.) \n\n1. I have read that cycles sometimes get cancelled. What happens in that case? If you already paid for a cycle, does it get refunded? Or do you just do another one next time or somehow roll it over/get credited for a future treatment?\n2. What exactly does a \"cycle\" refer to? Is it the egg retrieval, the transfer, or both? Also, do most doctors bundle these together, or do you pay separately for each individual visit/procedure as you move along?\n3. Will doctors give you an honest idea of how successful you may be before you start? Do any places guarantee results, or are you pretty much just gambling, and potentially losing what you paid if the IVF does not work?\n\nI apologize if these questions seem odd, but I have always been a very financially responsible person, and I'm just trying to get a sense of how exactly this works. Thank you!", "num_comments": 29, "score": 6, "top_comments": ["If you are seriously considering it and money is a big issue, Starbucks pays for fertility treatments. That’s how I’m going to do it. But I already worked there before deciding to do IVF", "So far I’ve spent roughly $30,000 on one cycle OOP. Luckily I was able to get on my husband’s insurance through a mandated state (must provide infertility benefits to employees) so going forward my transfers and part of my meds will be covered. \n\nAs to your questions \n\n\n1. Depends on the clinic and most of them generally have this outlined in their financial policies when signing paperwork. In my clinic they have a financial coordinator from their billing department speak with you at your first visit and they probably could answer this specific question better than this sub as it’s clinic dependent.\n\n 2. Prior to getting on my husband’s insurance through a mandated state, OOP costs only covered egg retrieval and the PGT testing of eight embryos. Transfers were an additional cost, and medications were not included in the price quote given to me by the clinic. Because clinics operate differently, the policy through one might differ in another. Be prepared to ask them questions\n\n3. Unfortunately it’s a gamble. They can’t guarantee success rates. I am extremely fortunate because my first retrieval went well and to my understanding the amount of embryos created and deemed normal is not common. I have no idea if any of my embryos will result in live births because I haven’t transferred yet (I needed to get off two of my medications and wanted to ensure a touch more mental stability before going through with a transfer). I always go hoping for the best while expecting the worst. It sucks because there’s no guarantee but it gives you more of a chance based on your diagnosis, age and some other factors.\n\nSee if your state is a mandated state, or if your company has fertility benefits. If that doesn’t work there are a few avenues I’ve seen folks take: applying for grants, taking out care credit, working part time at Starbucks (great infertility coverage), getting Amazons infertility benefits by working for a day then quitting and continuing coverage through COBRA.\n\nThere are also programs like the shared risk program. While it might be expensive up front you are guaranteed some of the money back you don’t have a live birth. From my understanding it covers three cycles and a transfer but it is also clinic dependent and they’re pretty stringent about criteria regarding who gets in so be aware of that", "A cycle at my clinic referred to a egg retrieval and a frozen embryo transfer. Out of pocket we were quoted $14,000 for both and that covered everything but meds and PGT-A testing which was an additional $4,000. We had insurance that covered almost all of the IVF cycle and probably 90% of the meds. During my IVF consult my doctor gave me a spread sheet that broke down the likelihood for success with varying factors and different things we could try (with additional costs) that we could elect to do. In the end we chose to add on the PGT-A because it bumped our chance for success to like 70%. Some clinics do have a shared risk program that you pay a little more upfront but after so many tries they refund you but most of the time you have to be a candidate they feel pretty confident on. My clinic also had different grants you could try four to help mitigate the cost."], "link": "/r/IVF/comments/107jgdd/basic_ivf_timeline_and_cost_questions/"}, {"title": "FET/Travel Dilemma", "content": "I was going to post this in Advice, but I didn’t thought other people going through IVF would be better qualified to respond.\n\nAbout a year ago, before seriously getting into IVF, I got an amazing deal on a cruise to Australia and New Zealand. It basically only cost me $350. I’m looking at doing FET either October or November before my deductible resets which, if successful, would put me in the 4th or 5th month of pregnancy. So far it’s refundable but I wouldn’t be able to rebook it because the cruise line is discontinuing Australia cruises. Now, I have three issues:\n\n1. I spent all my money on PGTA testing. The plane ticket wasn’t part of the package, and is going to be $2,000 minimum on a credit card.\n2. I roped several friends into this trip who have already booked. Only my best friend knows I’m doing this process and is holding back on plane tickets until I decide. I don’t want to cancel the trip on them when it was my idea. It’s not a cheap trip, and I’m the only one who got this kind of deal, the rest are paying full price into the multiple thousands.\n3. I don’t really want to be pregnant on a plane that long in coach. I also don’t want to be pregnant that far away from home in a foreign country incase something goes wrong.\n\nI kind of want to just say YOLO, full steam ahead, and deal with whatever happens as long as I’m cleared by the doctor to travel. If the FET results in a live birth, it may be decades before I can take this kind of trip again. It’s on my bucket list (to travel to every continent). If it doesn’t, I may have canceled a trip that I probably can’t rebook at the deal I got. What would you do?\n\n&#x200B;\n\n&#x200B;", "num_comments": 18, "score": 4, "top_comments": ["I’ve said no to 2 trips over the past 1.5 years “in case” my FETs work. I am now at 3 failed FETs, out of euploid embryos, broke, sad, and didn’t take the vacations/breaks that I probably needed for my mental health. I would say if you can wait to buy the flight until after your transfer, do that for piece of mind. But looking back over my IVF experience, I wish I woulda booked the trips.", "Do you have multiple euploid embryos banked? If so, I would just wait until you come back. If you don't, the thing I would worry about is, if it doesn't work and you have to do another ER after you return, your eggs are older (i.e. not as healthy) so you may not get as many euploid. It does sound like an amazing trip (two places that are on my bucket list!) so I completely get not wanting to cancel. If you don't have at least 3 euploid per baby already, can you do another ER instead of FET?"], "link": "/r/IVF/comments/16ar5yh/fettravel_dilemma/"}, {"title": "Success Stories Beyond the 5th transfer?", "content": "TW: pregnancy loss mentioned\n\nAs the title says, I'm hoping for some success stories of people who finally got pregnant beyond the 5th transfer. I've done five untested day 5/6 frozen embryo transfers - all of good quality. Our issue doesn't seem to be making decent embryos. However, we only got one CP from that... \n\nI've been pregnant prior to IVF via IUI but that ended up being an ectopic. I have PCOS and Stage 1/2 Endo which was excised last month. Remaining tube is open and appears fine. No natural killer cells but been told we're positive for partial DQ Alpha match but this is highly controversial and I'm super suspect that it's just expensive snake oil. Done an EndoTrio test (ERA, EMMA, ALICE) but the company that did it didn't tell us they don't accept credit card payment so we can't pay for the results.🙃 However, I've seen that this is no longer recommended by a lot of specialists. I'm on aaaaallll the supplements and so is my partner (sperm normal) and we're trying to eat as healthy as possible. No sign of Adenomyosis... Have changed clinics and currently stimming for 3rd ER. Previous clinic was awful and transfers were done by the GPs and nurses, not a specialist so maybe that's why? I don't know... In Australia and 33 for context.", "num_comments": 5, "score": 3, "top_comments": ["Have you done any treatments for the endo? Excision or Lupron Depot? I see lots of endo ladies do 2-3 months of Lupron Depot and then go on to have successful transfers. \n\nHow many embryos did you make? Unfortunately PCOS can give lots of eggs and make lots of embryos, but PCOS and endo can affect egg quality so it may just be a game of odds between transferring aneuploid vs euploid embryos. \n\nLastly, have you had a hysteroscopy to look for uterine abnormalities? That’s what brought me success on my 5th transfer."], "link": "/r/IVF/comments/143qqsy/success_stories_beyond_the_5th_transfer/"}, {"title": "False hopes for couples TTC", "content": "I seen this article the other day and i hate this BS! Me and my SO have been TTC for 7 years with no sucess and through it all we've had the usual nonsese of excersizing, eating different or a change in lifestyle. Sometimes thats not enough, a possitive attitude and a trip to the gym wont do anything.\n\nTurns out this guy isnt even an accrediated personal trainer or has any nutrional qulaifications but is reaping all the credit here:\n\nhttps://www.dailyrecord.co.uk/in-your-area/lanarkshire/lanarkshire-man-hails-personal-trainer-26194118", "num_comments": 8, "score": 1, "top_comments": ["Some people need to believe they can take their health into their own hands. I think there is a lot of good things to be said about eating well and exercising, and certainly a lot of research to back up the benefits, but it’s not a foolproof way to prevent infertility, because there isn’t a foolproof way…"], "link": "/r/IVF/comments/srq05e/false_hopes_for_couples_ttc/"}, {"title": "Newbie question here what constitutes a cycle?", "content": "I'm just trying to wrap my head around what happens during IVF mainly to figure out my insurance coverage.\nAs I understand it one IVF cycle is 1 credit, and this is egg retrieval and transfer.\nThen I have 1/6th of a credit for frozen embryo transfer. \n\nSo I'm wondering how many embryos can be made from 1 IVF? I know the answer is sometimes 0, but is there an average?\n\nHow many times do people on average go through egg retrieval?\n\nAs far as health goes supposedly we're both fine and have unexplained infertility.", "num_comments": 9, "score": 2, "top_comments": ["I'm editing this from a different post I made:\n\n So, the entire cycle will take about 12 weeks.\n\nDay  Minus 21 to 0: Birth control for 3 weeks\n\nDay 1 to 7-14: 375-400iU Follistim every day. Ultrasounds every 2-3 days during this time to make sure the follicles are growing at a uniform rate. Adjustments to medication will be made if needed to prevent hyperstimulation and ensure a good turn out. Eggs should be mature by day 14, but might be mature before then. \n\nDay 14: We are calling this day of maturation. \n\nDay 16: Day of maturation + 2 is the day of harvest. Propofol may be used as an anesthesia for the retrieval. Anesthesia is optional, but firmly recommended as the \"safest\" option. Eggs are harvested and sperm is collected.\n\nDay 17:  A fresh transfer is an option, but because of my age and repeated losses, it is very firmly recommended that I do chromosomal testing called PGS.\n\nDay 17-21: Two become one! An egg cell and a sperm cell become a blastocyst (hopefully). The best of these blastocysts are biopsied (just a little sample from the outside of each blastocyst is taken). Then, the blastocysts are frozen, pending the results of the chromosomal testing, which takes 2-3 weeks to get back. Once we know if we have any good eggs, we have to schedule time to go back for the transfer (maybe the next menstrual cycle or maybe the one after that)\n\nDay 40+ Day of transfer: They might give you valium, so you'll need transportation home (not public transportation).\n\nDay 52+ (Day of transfer + 12): Take a blood test to determine the success of the IVF attempt.\n\nThe  doctor I talked to said that they will only do a retrieval up to 3 times a year. They like to give your body a good break between retrievals. I already know how I respond to the medication (poorly), so I'm only willing to do one retrieval cycle. After that, it's going to have to be donor eggs/embryos."], "link": "/r/IVF/comments/8ucz31/newbie_question_here_what_constitutes_a_cycle/"}, {"title": "Back to back ER without priming", "content": "*EDIT* In case anyone finds this post later on, I wanted to share my results of my back to back retrieval without priming!\n\nSo I did end up having a dominant follicle we had to sacrifice due to skipping the priming. AND our AFC this round was our lowest ever (7). But our results were much better!\n\n8 eggs retrieved --> 6 mature --> 5 fertilized --> 4 blasts--> 2 PGT normal \n\nSo even with fewer eggs retrieved than my previous cycle (12) I ended up with double the number of blasts. For this cycle, I credit the time lapse incubator, Omnitrope (0.8mg/day) and back to back.\n\nI hope this posts help anyone who might be hesitant!!\n\n--------\n\n\nHi! I've heard lots of great things about how back to back retrievals can yield better results. In my previous two ERs, I've always done a month of estrogen priming prior to my retrievals since my AMH is on the lower side. \n\nI just had my ER and am planning to go right into another retrieval without priming. Does anyone have experience with doing back to back ERs *without* priming? \n\nI'm really worried about uneven follicle growth without it, but I also want to try and see how my body will respond to the meds right away. My ER is leaving it up to me but now I'm second guessing myself. Thanks in advance!", "num_comments": 21, "score": 5, "top_comments": ["I did 4 back to back ERS DOR and very low Amh. No priming. And I got more follicles in every new cycles: 1st cycle 4 Follicles and last cycle had 7. However, always 2 to 3 eggs. That said... the emotional toll can become heavy. As a consequence of back to back cycles, I then went on to have back to back failed implant, early miscarriage and 2 biochemicals until my 5th embryo was the lucky one."], "link": "/r/IVF/comments/xwm25f/back_to_back_er_without_priming/"}, {"title": "How much do you pay for medication with insurance?", "content": "How much do you pay for medication with insurance?\n\nI have 10k for fertility medication, ded $3300, after ded I pays 20%. Since I haven't met ded I have to pay $3608 for all my meds if I want to apply UHC insurance. Thinking about just purchase at MDR pharmacy and self-pay with my discount card as it's less than $3608 ... What's the point of having insurance if it's even higher than self-pay? Ughhhhhh", "num_comments": 13, "score": 3, "top_comments": ["Ugh so sorry! For me My plan covers IVF in-network at 100% so I just pay my regular Rx co-pays ($5-$10 per Rx). Sorry you are dealing with the high prices :/ I will say if it's a possibility you will do another egg retrieval this year then you might want to spend the money to meet the deductible so that for your next round you'll be covered at 80%.", "Some meds are cheaper to do self pay. I know Menopur was way cheaper self pay. Gonal was cheaper if I got 900 pens vs 300 or 450 even if I got more meds than I needed.", "I had a $7500 lifetime max for meds through my insurance, for the first round I ended up paying $3800 OOP. This round, the pharmacy said my lifetime max is already met so I have to pay completely OOP. Using 2 pharmacy for my meds. One is $1980 OOP. And the follistim is $2154 OOP through Mdrx. Follistim at Freedom was going to cost me $7000 OOP."], "link": "/r/IVF/comments/15lrh3l/how_much_do_you_pay_for_medication_with_insurance/"}, {"title": "ARC Financing Plans Advice", "content": "My clinic uses ARC Fertility for financing. There are a few different treatment packages available.\n- 1/2/3 Cycles Plus IVF\n- 2/3 Cycles Plus IVF with Success Refund \n\nMy doctor seemed optimistic about this first ER and said we will cross the bridge for a second ER once we see how things go. I was a bit taken aback and I clarified this is regarding finances.\n\nSo my dilemma is what package to get? If I get the 1 Cycle Plus IVF and then we need another one, they will need to do a hard inquire on my credit again if I need additional financing. According to ARC, with the Success packages, you can’t “bank” embryos. And if I get the 2 Plus package I will have to do the second ER even if I don’t need it because they won’t refund the “unused” procedures. (if this information is wrong please let me know! 😭)\n\nAny advice/insight would be greatly appreciated.", "num_comments": 9, "score": 1, "top_comments": ["I am about to start with a new clinic because they work with ARC. We are going with the 3 cycle package to try and bank embryos. I am 41 so time is very important in our case. We would like one more child. We sent 4 beautiful highly graded embryos for testing last month and they all came back abnormal. 💔"], "link": "/r/IVF/comments/xeg4f8/arc_financing_plans_advice/"}, {"title": "Fastivf.com shipping label", "content": "I was really nervous about ordering Gonal from [fastivf.com](https://fastivf.com). I did my research and saw that plenty of people had really great experiences with it. The package came in the mail today, and there was no mailing label and the vials were not cold. I heard its safe to use the vials if I use them quickly. But I am concerned as to why I couldnt get shipping information. Its almost as though they are trying to hide themselves, which has me really concerned. \n\nAlso, for my credit card, the charge showed up as \"Pharma1 - Istanbul\". \n\nIs this everyone else's experience?", "num_comments": 8, "score": 1, "top_comments": ["The fact that it wasn’t cold sucks. Maybe you can call customer service? The rest, I’m not understanding. The package is shipped from Europe, so that country might mail things with different labels. It made its way to you, so it must have been labeled somehow.\n\nAlso, why is the charge suspicious to you? It lists it as a charge from a pharma place in Istanbul. I feel like that’s an accurate way for it to show up.\n\nAre you suspicious of them? What’s leading you in that direction?"], "link": "/r/IVF/comments/rhumjz/fastivfcom_shipping_label/"}, {"title": "Insurance Coverage", "content": "My wife and I just learned our insurance is not covering our treatment. We have no options left and are heartbroken. My question to this community is, if you’ve encountered this issue as well, what did you do? Are there any options for financial assistance anywhere? \n\nThank you, all.", "num_comments": 3, "score": 1, "top_comments": ["We went with CNY too. I got donated meds and we used our credit card points as cash."], "link": "/r/IVF/comments/17xlab1/insurance_coverage/"}, {"title": "Overall cost of everything - RANT", "content": "I know this sort of post is posted often but I just have to rant to people who understand.  \n\nI am constantly so stressed about how much this process is costing us. Our insurance covers nothing whatsoever. It took me forever to accept that the ER--after meds and procedure--would cost $22,000!!! but after my family offered $10,000 to help, I was able to stomach it. \n\nThen I had a hysteroscopy--another $2,000.  \n\nYesterday I had both my fallopian tubes removed and an endo scrape (luckily, THIS at least is covered by insurance, but I mean, it's not FREE, ya know?).  \n\nUp until a few days ago, I thought I had a clear understanding of what the FET would cost. Our clinic gave us an estimate (\\~$5,000) a while ago and we've been saving like crazy every since. BUT THEN, I spoke with a nurse a few days ago who explained the meds regimen leading up to FET and post-transfer, and these meds will cost somewhere around $10,000. Writing this out, I feel like I'm about to have another breakdown. What if it doesn't work the first time? I have to magically come up with another $15,000 to try again??? Where do people find the money??? I don't get it. I feel like I'm doing something wrong.\n\nI'm a high school teacher. We have burned through our savings, built up credit card debt, and gotten more help from family than I am comfortable with.  \n\nI'm just feeling so sad, frustrated, lost, angry with our healthcare system, depressed, anxious... sigh.\n\nI worked hard to become a teacher, and I found a school that I absolutely love, but here I am, looking at becoming a Starbucks barista or Amazon delivery driver so that I can get some coverage. I'm also considering a GoFundMe--has anyone else done this? I don't love the idea. I've applied for grants through TheGiftofParenthood but haven't been selected. Y'all, I made an account to sell pictures of my FEET.  \n\nHow do you all afford this? How do you stay sane? How do you not lose hope? How do you not give up?", "num_comments": 57, "score": 43, "top_comments": ["Wait- what meds are they putting you on for your transfer? 10k seems REALLY high for transfer meds. If you can find out what meds they’ll be prescribing, you can shop around at different pharmacies to find a better price.", "[deleted]", "Sending you hugs! This Reddit group is full of generous med donors, so I recommend keeping your eyes peeled. I was able to offset a lot of my drug costs through donations.", "I’m with you!!! America has horrific healthcare!!! It’s bad enough that we have to pay so much money for procedures but even worse is that we don’t know ahead of time exactly what things cost and have to live with the stress of seeing bills come from the healthcare providers over months …… \n\nHave you looked into charities? There is a few that help either provide money for the procedures or atleast reduced medications. \n\nDid you shop around for the meds? Village pharmacy, freedom pharmacy etc can sometimes be cheaper. \n\n10k is really high for transfer meds!!! Are you sure? Also sometimes they prescribe more than you need. Sit down and see how much you really need. \n\nDid you ask your clinic if they have any leftover meds? Some people gift leftover meds to the clinics.", "I think they tend to quote high because it’s worst case scenario. I used smp pharmacy and the pio was like $30 for a month so don’t worry about that! In my experience, it’s the retrieval drugs that are most expensive. We took out a loan for our IVF journey. I got hung up on the finances for a LONG time - you can always recover from money. And if your family wants to help, let them help. Accept their blessings - there’s so much of this already that they can’t help with - this is likely their way of doing the things they can do. \n\nNothing wrong with a gofundme either ;)", "Why bring a child into financial ruin?"], "link": "/r/IVF/comments/sq2gxc/overall_cost_of_everything_rant/"}, {"title": "Any stories after accupuncture therapy?", "content": "After failing my 1st cycle of IVF. I got a recommendation of accupuncture treatment from a few of my friends. I don’t know how it works and helps. Probably better blood circulation? \nIs there any good or bad stories of accupuncture therapy? I need some advice!", "num_comments": 7, "score": 3, "top_comments": ["I do think it's good in terms of forcing oneself to relax and take a break. There have been some limited studies showing increased success rates, but I also always wonder if those people who are relaxed enough people to do acupuncture would have had better results, anyway.\n\nFor me, I really enjoyed my acupuncture sessions BUT the drive got to be too much plus having to take off work in the middle of the day made things more stressful. This time around, I've ordered a simple TENS machine to help recreate some of those feelings at home."], "link": "/r/IVF/comments/15pkzrn/any_stories_after_accupuncture_therapy/"}, {"title": "Practical knowledge and/or wisdom gained during IVF? Please share. :)", "content": "What’re are some useful things you’ve discovered during the IVF process that you wish you had known or done at the beginning/sooner in the process? \n\nThis group has SO MUCH collective wisdom and practical knowledge to share, I’d love to hear your takes. \n\n1. I’ve learned that as much as you can try to plan things out ahead of time (from how many eggs to freeze/fertilize, to whether to do PGT testing, to what to do with potential leftover blastocysts, to transferring mosaics, to how many cycles to do, to wondering if you should try to bank for future siblings, etc.) based on how you *think* you’ll feel, it’s a much more intuitive process and you sort of have to go with your gut at the specific time of each decision point. You can’t pre-plan it all, so just get started. \n\n2. I wish I had researched a separate rewards-specific credit card that gives you bonus rewards based on initial or first year spending. (Not even sure those exist…I just think I should have earned a few trips international trips by now. 😂)\n\n3. I also wish I had known about the Omni***** Savings Program and timed getting the free vial every 28 days.\n\nHow about you all? What do you wish you had known/done?", "num_comments": 12, "score": 5, "top_comments": ["I wish I had never told my friends. I shoukd have just told my friends, I'm starting now, and I'll let you know when I get preggers. After having my support persons stick with me for a year, and finally getting pregnant after 4 egg retrivals, 1 friend has come out and told me that my journey effected her. I snapped at her, that in the last 18 months I've become a person she didn't like. I had tunnel vision etc. \n\nAnyway, I wish I had just shut up and suffered alone through my retrivals and losses and triggers about X amount of eggs.\n\nSorry for the vent. The conversation still stings and it was a week ago. I tried explaining that it gave me so much anxiety and made me feel terrible about hearing of her fertility/good amh/egg count. She said it wasn't a competition, and getting so many eggs doesn't garantee they are healthy and such and such friend is gping througg infertility too. (Wtf was she comparing my reactions to someone else?) \n\nAnyway I said, you don't understand what I've been through until you have experienced it yourself.\n\n\nAnyway, still upset, sorry for my vent. But yeh, I probably would've imploded by now had I not told my friends what was happening, but at least I wouldn't have dragged them down with me.", "I wish I’d known about the hunger games. Our first round was no blasts and it’s devastated me as I hadn’t even considered not getting to transfer. Getting a call saying it’s all over 2.5 weeks after starting stims was brutal.\n\nEdit: to add something positive. I wish I’d known how physically easy the process is. It was 10% of what I had built myself up to expect."], "link": "/r/IVF/comments/xfeyi7/practical_knowledge_andor_wisdom_gained_during/"}, {"title": "Helppppp!!", "content": "I’m at a loss I don’t know what to do. My wife and I were finally financially prepared to  go through the long journey of infertility, but with all the doctor fees that just keep popping up are starting to really get to us and our wallet is now limited. We try not to spend any extra money, we don’t eat out, our credit card balances have gotten a little high and we are starting to feel like we’re drowning with all these appointments and extra fees we didn’t know about. I’m supposed to have a Hysteroscopy on Monday then 2 weeks ish do a FET. Now because of having to pay extra out of pocket (since I’ve met my deductible) my wife thinks we should cancel everything and postpone it. I see the reasoning why but feel like we’ve gotten this close there’s no good reason to not go through with it. I don’t know what to do. Why is IVF so freaking expensive!?! I don’t want to be hurting financially while trying to bring a baby into the world either. That’s no way to start their life. What would you do?", "num_comments": 6, "score": 0, "top_comments": ["We were approved for a credit card with zero interest for 18 months including balance transfers. We didn’t want to pay interest on a loan. Our card is through Bank of America, but there are several other companies with similar card. I recognize this is a privilege, but it could be a good option."], "link": "/r/IVF/comments/yqyzuo/helppppp/"}, {"title": "IVF cycle will probably get canceled. Should I switch to IUI?", "content": "I'm on day 11 of my cycle and just had my ultrasound. I only have two dominant follicles, size 19 and 18. The next two largest are 10 and 10. I'm going to continue with medications tonight and go back for another ultrasound tomorrow.\n\nMy doc says that it's looking like I'll probably just have the two follicles ready at retrieval and asked if I wanted to convert to IUI.  I'm leaning towards no and canceling it all together because I'm 41 and the chances that one of those two eggs would be normal is probably slim. At my last cycle, 7 eggs were retrieved and only 1 made it to blast which was PGS tested normal. What do ya'll think? Should I scrap this cycle or take a stab at the IUI?  In any event, the clinic will retain $1,000 while the rest will be credited towards a future cycle.\n\nUpdate: I'm doing the IUI. My doctor said that if an embryo develops and is abnormal, it will most likely not implant or will be a chemical. ", "num_comments": 25, "score": 4, "top_comments": ["Do you have many others at 10mm? I stimmed for 14 days to let other catch up and from three follicles at scan we got 11 eggs because the smaller follicles had time to grow to 13mm and many had a mature egg.", "I would do an iui as you’ve used all of that medication already."], "link": "/r/IVF/comments/qdkrel/ivf_cycle_will_probably_get_canceled_should_i/"}, {"title": "Why is this journey so heartbreaking?!", "content": "We did IVF in February. We paid for everything “out of pocket” aka credit cards. We have male factor infertility and are both 30 years old. We ended up with 3 embryos, transferred one fresh on Feb 26 and froze the other two. \n\nEverything was going great! I tested positive on March 3rd, first ultrasound baby was measuring a tad small, but there was heartbeat! I had ultrasounds every other week to make sure baby was growing.\n\nOn Tuesday May 24th I went for my 15 week ultrasound and found out that our precious IVF baby no longer had a heartbeat. My midwife thinks the baby stopped growing shortly after my last ultrasound 2 weeks prior (around 13 weeks gestation). We had a missed miscarriage in the 2nd trimester. This is a 1-3% chance of happening. We are absolutely devastated 💔 This was my worst fear, but I was finally feeling confident that our baby was perfectly fine and was so excited to find out what we were having in a few short weeks (scan was booked for July 4th, my birthday).  \n \nThe worst part of this horrible nightmare is that we can't afford a frozen embryo transfer... and the thought of going back to \"trying to conceive\" is agonizing because I know deep down that we can't do it naturally. We are still trying to pay off the $16,000 that we charged to credit cards for our IVF cycle. I just feel like we can't catch a damn break.\n\nI feel so helpless and so desperate. My line of work involves seeing beautiful pregnant belles and newborn babies daily. My website is full of newborn photos. I can't escape it. I also can't take a medical leave because I'm self-employed and therefore don't quality for EI. I have to work. I have no choice. In saying that, if you are able to and would like to donate to our GoFundMe you can do so here: [https://gofund.me/34e2daf3](https://gofund.me/34e2daf3)\n\nIf you cannot afford to donate (trust me, I get it!) you can share it! Every little bit helps. All funds will go towards a frozen embryo transfer in the future. This is our original GoFundMe, but I changed the title and added an update. A frozen embryo transfer is $2,300 + meds. Any additional funds will go towards the IVF debt and any upcoming bills (mortgage and car payments 😳)\n  \nThis sucks. This sucks soooo fucking badly! I just want my baby 😭💔😭💔😭", "num_comments": 0, "score": 3, "top_comments": [], "link": "/r/IVF/comments/v31krw/why_is_this_journey_so_heartbreaking/"}, {"title": "Egg Retrieval yesterday- only 2 eggs", "content": "I'm 37 years old & did my very first cycle of IVF and stims. I just had my egg retrieval yesterday morning. They were only able to retrieve 2 eggs. 😔 They said my ovaries were hidden.. they said everything looked good at my ultrasound on Friday. But yesterday, they were hidden apparently. \n\nI am debating doing another round to try to get more eggs. My insurance doesn't cover it, I'd be putting it on a credit card again. \n\nI'm not trying for embryos yet, just doing the eggs because I'm getting older. I know it only takes 1, but still...\n\nAny thoughts? Words of advice?  Thank you!", "num_comments": 11, "score": 14, "top_comments": ["If you're just freezing eggs I would absolutely do another round, personally (assuming this will not put you in a bad place financially). Eggs aren't quite as hardy as embryos so while it's fairly uncommon for an embryo to not survive the thaw, it is relatively common for an egg to not be viable after thaw. Additionally it's rare that all mature eggs retrieved are successfully fertilized, even when the fertilization is fresh & done with ICSI. If it were me, I would not feel confident freezing only 2 eggs. \n\nI would speak with your RE to see what can be done about the hiding ovaries & see if there is a contingency plan if this happens again. I don't know much about hiding ovaries because I've not experienced this so I'm not sure if it would be possible but maybe they can position you differently for retrieval if your ovaries are hiding again or use a different method of retrieval?\n\nI am sorry that they were only able to get 2 eggs this round. Maybe your RE also has suggestion on how to proceed for the next round to focus on quality if quantity is going to be an ongoing issue.", "My wife had just 2 eggs at her retrieval as well. We're now 21 weeks pregnant with a boy. Hang in there."], "link": "/r/IVF/comments/jnchpy/egg_retrieval_yesterday_only_2_eggs/"}, {"title": "Starting IVF in January", "content": "I'm 33. We've been trying since 2017. All normal labs. Good AMH. We've had 4 failed IUIs. I've never had a positive pregnancy test. My best friend recently told me she's pregnant and I'm falling apart. \n\nWhat did you do to prepare for IVF? I'm technically considered overweight but otherwise healthy. I work out 4-5 days a week. Starting back up with acupuncture next week. Should I be eliminating caffeine this early? Fragrances? Did y'all swap out your makeup and skincare for natural only ingredients? \n\nI feel burnt out from all these years of disappointment followed by failed IUIs but I know this is just the begining so I'm trying to keep it together. Is there anything I should know that my doctors might not have told me?", "num_comments": 25, "score": 8, "top_comments": ["TW: pregnancy\n\nCOQ10 is a must for you and your husband. I’d say that you’re okay with caffeine as long as it’s not 2 pots of coffee a day, and I didn’t adjust fragrance or makeup prior to my cycles. \n\nMy husband and I dealt with unexplained infertility, and no miscarriages or IUI before we started IVF. My advice is to prepare mentally for needing multiple cycles. My first one bombed so hard, and it hurt way more then I thought. I don’t think I’ll ever forget how numb I felt when my doctor called me. I assumed we’d have one cycle and be done, and it really shook me up when it was a complete failure.  We both did COQ10 for our second cycle, and found out that we were expecting when it was supposed to start. Now I’m a few days shy of 16 weeks. \n\nBest of luck to you!!", "Start taking Ubiquinol/ CoQ10 and prenatals and read “ it starts with an egg”", "Our stories sound so similar. I cut out fragrances I started to use like free and clear detergents. I switched to decaf (I still have caffeine just not as much). I moved my body daily (nothing strenuous). Took supplements as prescribed for me and my husband. TW. we were really fortunate and got pregnant on our first transfer! After never having a positive pregnancy test, I never thought it was possible. Keep going!! It’s so worth it"], "link": "/r/IVF/comments/y1r2rf/starting_ivf_in_january/"}, {"title": "Any IVF financing companies offer no interest for first x number of months?", "content": "I have no experience with financing companies of this sort and can't seem to find any with introductory interest free timeframe. ", "num_comments": 1, "score": 1, "top_comments": ["My understanding is that fertility loans don’t have great rates. You can reach out to your nurse/clinic to see if they partner with any specific bank or offer their own financing options. \n\nWhat is a commonly recommended option is getting a zero interest credit card. Bonus points for one with great cash back or travel redemption."], "link": "/r/IVF/comments/16cm3ys/any_ivf_financing_companies_offer_no_interest_for/"}, {"title": "Does Progyny coverage start over when you switch employers?", "content": "I’ve been working at Amazon for the Fertility benefits. I just used both my smart cycles and it was a total bust—they suspect trigger failure since I had 15-20+ follicles at trigger both times but only got a couple mature eggs. I’m devastated but not ready to throw in the towel just yet… I’m determined to be a mom! 😅\n\nThere are a couple Progyny-offering businesses in my area that are hiring. If I manage to get a job at one, will my Progyny benefits start over since it’s a new employer? Has anybody switched employers and gotten more smart cycles?\n\nThank you for any info!", "num_comments": 19, "score": 7, "top_comments": ["Yes, your benefits will reset with a new employer. The employer will often refer to a \"lifetime maximum\" of smart cycles, which can be confusing. It's Amazon making the 2 smart cycle cut-off, not Progyny. A new employer will have its own lifetime max, and Progyny will have no problem honoring it.", "Your smart cycles are company-specific, so you get new cycles with every Progyny-providing job you have. So for example, I’m doing Amazon Progyny (via COBRA) right now. If I go through my full 2 smart cycles and still no live baby, then my back up plan is Tractor Supply (again via COBRA)."], "link": "/r/IVF/comments/10cw418/does_progyny_coverage_start_over_when_you_switch/"}]