[{"title": "Financing ", "content": "Me and my partner are doing shared IVF via CCRM (Minneapolis). We are getting to the point in our journey where we’ll have to pay the full fee for the retrieval and transfer (approx $25,000) this doesn’t include medication and other miscellaneous costs but for bills I can pay out of pocket that’s usually my preferred way before I go for financing options. I received paperwork for futurefamily, lending club, and capexMD. Can members share if they used any of these services? Which one did you choose and why?", "num_comments": 1, "score": 1, "top_comments": ["I didnt use the service. But if you have the funds to pay for a lot of it out of pocket. You could sign up for a credit card with great sign up bonus. Travel points, cash back etc and pay it off immediately or get one that has a 0% intro offer for like 12-18 months. That way you get at least something out of it for having to pay out of pocket"], "link": "/r/IVF/comments/1b3honm/financing/"}, {"title": "Ivf discount and financing", "content": "I need help urgently. My clinic is charging $16,900 for my IVF cycle and is due before they start the procedure. I cannot afford this humongous amount of what are my options?", "num_comments": 14, "score": 1, "top_comments": ["Open a new credit card with 0% APR for an intro period, personal loan, or try applying for grants. There are fertility-specific personal loans as well. I opened a Discover personal loan to pay for my donor egg lot and the money was deposited pretty quickly and my interest rate is pretty decent. Unfortunately this process costs a lot of money and won't stop at that initial $16k so make sure you have a budget and plan in place.", "How many cycle is included in this price?"], "link": "/r/IVF/comments/18rj1ca/ivf_discount_and_financing/"}, {"title": "Credit cards / financing", "content": "Did any of you open new credits cards to pay for any and all ivf related treatments? While insurance is covering the actual procedures (thank god), there are still a lot of out of pocket costs, into the thousands already. Curious if anyone can recommend a good card to be used either at pharmacies or that gets points for hitting a certain target number in the first few months of use. \nThanks for your help!!", "num_comments": 11, "score": 2, "top_comments": ["Did not use a credit card but did think about it at one point. The best credit cards with low annual fees for just general cash back from nerd wallet seem to be:\n\n1. Chase Freedom Unlimter - $0 annual fee, 1.5-5% cashback, intro offer of unlimited matched cash back\n\n2. Chase Sapphire Preferred - $95 annual fee, 1-5x points, 60,000 points for intro offer  \n\n3. Discover IT cash back - $0 annual fee, 1-5% cashback, cashback match as intro offer\n\nI’d also throw out two more specific options:\n\n1. Amazon chase credit card - if you have prime you get 5-6% back on Amazon/WF purchases then 1-2% on everything else. This is great card for post-ivf life if you spend a lot at Amazon/WF and since it’s chase you can transfer points to a different chase card, like the sapphire which has better travel redemption. \n\n2. Marriott bonvoy amex - $250 or $650 annual fee depending on which card you get, but you get 6x points on Marriott spend then 2x points on everything else (as well as a few other perks like dining credit). This is another great post-ivf card if you travel. I travel a lot of for work, and my husband and I travel a decent amount personally, and this card is so easy to wrack up points/marriott status. Just the points we get from our daily spend throughout the year tends to be enough to pay for our hotel for any trip for 7-10 days. Plus, since you get Marriott status, we can book the base room with points then get upgraded at no cost.", "we used a capital one card! 0% for 18 months and about to finally pay it off 🥳"], "link": "/r/IVF/comments/193gtuz/credit_cards_financing/"}, {"title": "Financing", "content": "Has anyone used Ally, lending club, or Future family? If not what other ways did you finance your cycle?", "num_comments": 5, "score": 2, "top_comments": ["Took out a loan with my credit union. If you can put something up as collateral you will get a better interest rate (in past I used our vehicles, this time our house)."], "link": "/r/IVF/comments/17kbw7q/financing/"}, {"title": "Opinions on Finance Lenders", "content": "Hello,\nLooking for advice on lenders. My wife and I have just begun the IVF process. We found out after a long time of trying her tubes are fully blocked. We just had our genetic testing done and are moving on to the next steps. \n\nUnfortunately, our insurances do not cover the costs (I am LE and she is a Special Needs Teacher). We are aware that this will be an expensive endeavor, but starting a family is our number one priority. \n\nAll that being said, can anyone recommend finance company options. Our clinic is partnered with Bundl and from what I've read it seems like they protect you from unsuccessful transfers. I am just looking for knowledge. \n\nI've been reading this reddit multiple times a day since we got the results from my wife's HSG. I appreciate you all sharing your stories and expierences.", "num_comments": 4, "score": 3, "top_comments": ["I would personally look into 0% interest credit cards. Some of them will give you 6 months or a year without any interest. Wishing you guys the best!"], "link": "/r/IVF/comments/174pdsv/opinions_on_finance_lenders/"}, {"title": "Finances?!", "content": "Hey everyone! I’m hoping that some of you would be willing to share your creative ways of funding IVF? I just learned that IVF is our only option at this point and I think i’m a little sticker shocked. \nI do have to add that no matter what, we are giving this a shot. But, i’m hoping to hear your stories on how you budgeted your treatment?", "num_comments": 8, "score": 1, "top_comments": ["Honestly the best ways seem to be finding a job with fertility benefits, checking out CNY (~1/3 the cost), and/or taking out a loan.", "Do you have insurance coverage for IVF at all?"], "link": "/r/IVF/comments/12tjle5/finances/"}, {"title": "Finances and insurance coverage", "content": "I returned to my fertility clinic after our 4th and last embryo transfer from our first and only egg retrieval turned successful pregnancy ended in a still birth. We're now gearing up to get into another egg retrieval cycle so of course we had to redo baseline blood work, seven analysis, etc. \n\nThe billing coordinator gets in touch with me and says that we've maxed out our insurance coverage. My insurance covers 3 ivf rounds. The question open to interpretation is whether that includes FETs. After our daughter died, and while we were in the throws of grief and anguish over next steps, I called my insurance to question it. They told me I had used up all of my FET benefit but had two egg retrieval rounds left of 3 covered rounds. \n\nSo big sigh of relief right? Why is the billing coordinator messaging me that I've maxed it out? Shouldn't they be fighting for me? Shouldn't they know the insurance ins outs tips hacks insider coding etc on my behalf as the patient??! \n\nSo now I have to wait for the billing coordinator to go work it out with the insurance again, or better yet, call and fight the insurance company myself now.", "num_comments": 3, "score": 2, "top_comments": ["i have this same issue with my second clinic. billing has been atrocious and im constantly having to get in touch with my insurance company to verify things or clear them up. the billing coordinator is just doing her job unfortunately, some clinics are more pro patient than others. assuming youre in the US, its technically our job as a patient to make sure what is covered/what isnt with IVF. where they can help is providing the CPT codes (billing codes) so you can quickly check with your insurance. i had an insurance nightmare w/ IVF, similar situation saying i was maxxed out and I truly wasnt. if i was you i would just bite the bullet and call the insurance company and have them go over it with you personally. mine turned out to be some internal glitch with the insurance company. hoping yours is an easy fix."], "link": "/r/IVF/comments/16hb015/finances_and_insurance_coverage/"}, {"title": "Pergoveris advice - finance question (UK based)", "content": "Hi all. I’ve been out of the game for a while and about to start up again at the end of the month. I’m trying to be as savvy as I can with prices this time (getting my meds in advance from ASDA instead of my clinic which I didn’t realise you could do, this should save me just under £500 per round). \n\nI’ve realised that my previous round on Gonal F + Luveris cost less than my round on Pergoveris (ie the pen that combines Gonal and Luveris into one needle and avoids all the mixing). I’m wondering whether to ask my clinic to go back to prescribing me Gonal F and Luveris, which will save me £200. I plan on doing 3 rounds so in total the saving will be £600. \n\nBefore I started this whole thing £600 was a huge amount of money. Now it seems small compared to the whopping overall costs. \n\nThis is so subjective and I know the only person who can ultimately answer is me but I’d love to hear thoughts from anyone, is it worth having to do an extra shot a night and mixing the meds myself to save £200 per round?\n\nSending you all peace and luck.", "num_comments": 1, "score": 1, "top_comments": ["I just want to weigh in pergoveris. I did my first ER1 with pergoveris and had great results and now doing my ER2 with it. I would highly recommend it. It has less side effects and gave me great results with DOR. Good luck"], "link": "/r/IVF/comments/17r9vxu/pergoveris_advice_finance_question_uk_based/"}, {"title": "Financing", "content": "Does anyone have any information or reviews or opinions on financing? Who did you use? How did it work? How bad was the interest?\n\nEdit:  I live in central California", "num_comments": 5, "score": 2, "top_comments": ["Maybe specific your location?"], "link": "/r/IVF/comments/12jrwqm/financing/"}, {"title": "Financing", "content": "We have an appointment this week with our clinics financial team and advisors, we are starting IVF after 4 IUI fails and I'm seeing that couples have gone through multiple IVF cycles and was wondering, how did you go about financing it all? Personal loans? Cash? And, did you set limitations on the amount of attempts?", "num_comments": 11, "score": 4, "top_comments": ["Insurance coverage was the only way we are able to afford IVF at all.", "second mortgage and 401K loans... My insurance doesnt cover any IVF procedures. (they DO cover monitoring appts after i hit by deductible I'm dreading the new year as I have to start all over again. :(", "We’re planning on using new hope fertility where a retrieval, transfer, PGT testing, & meds is going to be around 15k (way better than the 25-30k quoted)\nGoing to pay this cycle out of pocket and hope for the best. If we ever need another cycle I’m getting a part time job at trailer tractor supply"], "link": "/r/IVF/comments/zpu8lq/financing/"}, {"title": "Interest Rates When Financing", "content": "Hi! My husband and I are business owners and it looks like in order to get through the end of the year comfortably, we will either need to take out a business loan or get a loan for IVF.\n\nIs anyone is willing to share what their your recent interest rate is for your loan?", "num_comments": 2, "score": 2, "top_comments": ["My clinic had 2 years at 0% interest. This was in March 2022."], "link": "/r/IVF/comments/15lsvmm/interest_rates_when_financing/"}, {"title": "IVF financing recommendations?", "content": "Curious to hear about experiences with IVF financing companies such as Future Family— any recommendations? Many thanks", "num_comments": 0, "score": 2, "top_comments": [], "link": "/r/IVF/comments/13qjdkm/ivf_financing_recommendations/"}, {"title": "Financing for IVF", "content": "My husband and I never thought we’d have to do IVF, so we didn’t save for it. Nor do we really want to take a year or more to save before getting started…. It’s already been a grueling two years for us. So now we’re struggling to figure out how to finance it…, from a HELOC, to a credit card, to a personal loan, etc. \n\nI stumbled upon something called Future Family….. has anyone used this before? I’ve never seen anyone talk about it, so I’m thinking maybe it’s not trustworthy? \n\nThank you everyone!", "num_comments": 30, "score": 3, "top_comments": ["I definitely recommend against using the fertility financing companies (rates 11%+). We used a personal loan from light steam specifically for IVF (under adoption, medical, etc). Our rate was about 5.25% I believe. We avoided the hassle of refinancing or taking our a HELOC. You can also get a 0% cc and put it on that, some cc offer 24 months with 0%. Good luck!", "A heloc will probably give you the best rates and then you can use it as you go. We initially went with a Capex MD loan but the monthly payments were high and the interest was high so we just refinanced.", "AMAZON!!! one of the few companies that pay for ivf through PROGYNY. Check it out. I’ll be starting on January."], "link": "/r/IVF/comments/qrqt8s/financing_for_ivf/"}, {"title": "IVF Financing - 0% Anyone?", "content": "Has anyone found IVF financing with 0% interest for a period of time like 1 or 2 years? So far through all the big name IVF lenders I'm seeing 6.99% end up depending on credit score and the duration of the loan. My local credit union was a bust with absolutely horrendous rates. Thank you!", "num_comments": 25, "score": 4, "top_comments": ["I found a 18 month interest free credit card thru my bank.", "We opened credit cards with 0% interest for 18 months, 22 months if we made all our payments in time, which we will."], "link": "/r/IVF/comments/v7an9c/ivf_financing_0_anyone/"}, {"title": "Financing IVF", "content": "Hello all,\n\nWould anyone be willing to make suggestions as far as how they were able to finance the IVF? I dont mean specific private details, but maybe ways that worked best for you? Credit cards, loans, etc? Also, any advice for a family on 1 income?", "num_comments": 39, "score": 18, "top_comments": ["If you’re a one-income family, can the other person get a part-time job at one of the places with great infertility benefits? I know Starbucks is tossed around a lot, because you only have to work 20 hours/wk as a barista to access the excellent benefits, and I think B of A? I’m sure there are more but I’m not sure where.", "Financing is tough. I always suspected I would need IVF treatment so I eyed the type of infertility coverage offered by different jobs when I was looking. I know it’s different state-by-state and company to company but it’s worth it to me, to stay at my current job earning less than I would at another hospital, because I could never afford out of pocket what my coverage provides. Are there any career opportunities worth pursuing that would provide any infertility coverage? Obviously those are major decisions to make so I don’t suggest that lightly. Personally, I would consider moving for IVF coverage but I don’t have geographic family tires and I understand that can be complicated for a whole host of reasons.", "We applied for the infertility financial support that our clinic gave us information on. Unfortunately, we didn't meet the requirements. Ran every thing through insurance, many of the medications were covered and not considered fertility drugs. Used a rewards credit card to get cash back. Also, ask the doctor specifically if they are able to provide discounts. We went to two different clinics during our journey. The first clinic, the doctor waived his part of the fee for one of our transfers. The second clinic, they gave us a percentage discount. Never hurts to ask, worst they say is no.", "My partner and I used BetterMed (https://[https://bettermed.com](https://bettermed.com)) to apply for financing for our IVF treatments. You should not immediately pick the IVF financing option that your clinic is offering, as typically they may not be the best choice. I did my research for the past few weeks and fortunately I found Bettermed. We were able to get approved and at the same time use the fertility centre of our choice. Bettermed made it happen for us by working with the clinic and it was a very easy process. Not only that, I looked into carecredit and alphaeon and as well as other loans, and to be honest with you, I wasn't that impressed. You also really have to understand what they are offering. The interest rates are higher and monthly payments see to increase after a few months. With bettermed, there is a $999 application fee but it is truly worth it because when  you do the math, you are saving money over a long time and the monthly payments are lower and it makes it more affordable. I currently have a 0% interest rate for over 15 years and I am also deferring my payment for up to one year, as bettermed gave me that option. "], "link": "/r/IVF/comments/gdkpys/financing_ivf/"}, {"title": "Question for those who have financed with CNY & done more than 1 round-", "content": "I am on the newer side of this process – I’m supposed to start my first retrieval probably within the next two months. I am already concerned and worried that the fresh transfer either won’t take or I in case won’t be able to do one: I am wondering, for those who have used CNY, How much is the additional cost for a frozen embryo transfer? I know it says $995 but that doesn’t include medication, right? For those who have gone through it with CNY how much extra money do you have to pay per frozen embryo transfer? Including medication?\nThank you in advance!", "num_comments": 1, "score": 1, "top_comments": ["I have done two frozen transfers from CNY and they cost $1095 each which is $995 plus a $150 fee and then a small discount for paying in full before the procedure. That did not include medication. But my medication is covered by insurance even though my procedures aren't, so that was only about $200 total plus shipping from Metro Drugs (which is like $30, though!). I also had leftover meds from the first transfer so for the second one I only had to refresh PIO which has made it cheaper.\n\nEdited to add: They also charge me $100 every time I visit the office for a blood draw, I forgot to mention that. I am paying out of pocket so every time I go in, I get a $100 charge on my ledger. That was an additional $600 for the first transfer!"], "link": "/r/IVF/comments/1aoboyq/question_for_those_who_have_financed_with_cny/"}, {"title": "ARC Financing Plans Advice", "content": "My clinic uses ARC Fertility for financing. There are a few different treatment packages available.\n- 1/2/3 Cycles Plus IVF\n- 2/3 Cycles Plus IVF with Success Refund \n\nMy doctor seemed optimistic about this first ER and said we will cross the bridge for a second ER once we see how things go. I was a bit taken aback and I clarified this is regarding finances.\n\nSo my dilemma is what package to get? If I get the 1 Cycle Plus IVF and then we need another one, they will need to do a hard inquire on my credit again if I need additional financing. According to ARC, with the Success packages, you can’t “bank” embryos. And if I get the 2 Plus package I will have to do the second ER even if I don’t need it because they won’t refund the “unused” procedures. (if this information is wrong please let me know! 😭)\n\nAny advice/insight would be greatly appreciated.", "num_comments": 9, "score": 1, "top_comments": ["I am about to start with a new clinic because they work with ARC. We are going with the 3 cycle package to try and bank embryos. I am 41 so time is very important in our case. We would like one more child. We sent 4 beautiful highly graded embryos for testing last month and they all came back abnormal. 💔"], "link": "/r/IVF/comments/xeg4f8/arc_financing_plans_advice/"}, {"title": "Financing", "content": "Just wondering who’s gotten personal loans to finance ivf and had fair credit.  Prosper is a joke and not using them.", "num_comments": 1, "score": 2, "top_comments": ["CapexMD should work for you."], "link": "/r/IVF/comments/x1w83v/financing/"}, {"title": "Any IVF financing companies offer no interest for first x number of months?", "content": "I have no experience with financing companies of this sort and can't seem to find any with introductory interest free timeframe. ", "num_comments": 1, "score": 1, "top_comments": ["My understanding is that fertility loans don’t have great rates. You can reach out to your nurse/clinic to see if they partner with any specific bank or offer their own financing options. \n\nWhat is a commonly recommended option is getting a zero interest credit card. Bonus points for one with great cash back or travel redemption."], "link": "/r/IVF/comments/16cm3ys/any_ivf_financing_companies_offer_no_interest_for/"}, {"title": "IVF Financing and Insurance Reform Coalition", "content": "Good Afternoon and *VERY* long post alert, \n\nPlease advise if a post like this is not allowed and I can remove and re-address it in a more appropriate format, as this is specifically regarding IVF in the USA and its interaction with Insurance. \n\nWith that said, I wanted to dive right in. As everyone intimately familiar with IVF knows, you likely have a high level of the emotional stress involved in the process. From the realization that this may be your only option to conceive, the worry that it still won't work, and countless others. That's all before you even consider the finances and insurance components of this equation. \n\nWhile I know there are a handful of employers and insurance plans and policies that have some level of coverage, from my understanding, it's not at the forefront of most insurance policy makers' minds and the value is not placed on IVF and conception like we all clearly think it should be. \n\nDespite your status in life (married vs. unmarried/wealthy vs. poor) there is clearly not a value placed on IVF in our society that would cause there to be a significant change in the way IVF is perceived and funded, despite the fact that based on a recent article 33% of Americans have personally, or know someone, that has used fertility treatments. \n\nI am one of the lucky few that has a spouse with *some* level of IVF coverage and it's still a stressful and overwhelming obstacle to try and tackle amid the most crucial of times during IVF. \n\nMy purpose in reaching out today is to try and establish an IVF Finance and Insurance Reform Coalition. My hope is to set up a platform for those with stories to tell of finance and insurance hurdles to discuss those and outline them. While I don't exactly know what that entails or how this will play out, this has just become a passion of mine to pursue. As there is too much talk about the Right to Choose regarding abortion, yet the majority (if not all) of those pursuing IVF do not have a choice. It is our only option to conveive and yet we are left in the dark and alone more often than not. So while this is my first attempt at creating a movement and organization of this sort, a few thoughts on how it may play out are below. \n\nMy initial hope is to take some of these concerns and bring in medical expertise and experience to help put medical justification to our claims and hone in a few talking points that can be taken (with sound medical backing) to the policymakers in each state to hopefully push for insurance reform for IVF.\n\nAs an example, I am currently going through a prescription appeals process with our insurance company because they have placed the medication our doctor prescribed on their personal NDC Lock-out list. So she is not eligible for reimbursement. However, their approved substitute doesn't have a medical advantage, nor does the drug on the lockout list have overly adverse side effects or case studies to indicate it is ineffective. Her drug also doesn't have a generic substitute; however, the board of the lockout list decided that across the spectrum, there is an acceptable alternative (which coincidentally....) costs about 1/3 of the medication originally prescribed. Also is unsettling the number of drugs that have been added to these NDC lockout lists over the past several years. \n\nWhile I understand this our current model, insurance companies make modifications based on profit, it's also unfortunate that insurance is dictating medical practice to the degree they are. \n\nWhile I have tried to remain coherent, I fear I am rambling now. \n\nSo with that, I will leave it at this, if you feel strongly that there should be reform in the stigma around IVF and the impacts that have on financing and insurance to support IVF, please send me a direct message with an email address, I'd love to discuss. \n\nThanks", "num_comments": 7, "score": 7, "top_comments": ["I'm going to \"approve\" this post, though it skirts the line of \"self promotion\" or \"non pre-approved research\".... simply because you're 100% correct... the coding for IVF is complete BS and it needs to be fixed."], "link": "/r/IVF/comments/uj37wm/ivf_financing_and_insurance_reform_coalition/"}, {"title": "IVF Financing", "content": "Hi -\n\nWondering if anyone has any experiences with financing of IVF treatment.\n\n1. How did you find the financing provider?\n2. Any pitfalls or nasty surprised you experienced?\n3. Any recommendations?\n\nThanks!", "num_comments": 8, "score": 7, "top_comments": ["We researched a ton and then realized borrowing against my 401k was super easy and the interest you pay goes towards your balance. The only real downfall was missing out on any gains you would have during the time your money was out. \n\nAlso, it took like 3 clicks and then boom, check in the mail.\n\nAdded bonus - my clinic has a discount for check versus card, so that saved us money too, versus using a credit card.", "0% credit cards with 24 month payoff. \nhttps://www.nerdwallet.com/the-best-credit-cards"], "link": "/r/IVF/comments/j7kz89/ivf_financing/"}, {"title": "CapexMD, LLC financing", "content": "Has anyone use them before to get a loan for IVF? My clinic recommended them, and Lending Tree, but said Capex typically has better rates. Are they easy to work with? Get back to you in a timely manner? Any help would be appreciated!!", "num_comments": 8, "score": 7, "top_comments": ["Great to work with. Sent money directly to my clinic and to Igenomix for testing. Ask for more than you think you will need!"], "link": "/r/IVF/comments/jfjiy2/capexmd_llc_financing/"}, {"title": "Does anyone have experience with financing IVF loans?", "content": "We’ve saved up a fairy good bit but we just looked at the costs of the meds and sheesh! Do the IVF loans cover medicine as well? Is that possible?", "num_comments": 12, "score": 3, "top_comments": ["They do. For us our IVF clinic sent a plan to the loan company which covered stims, egg retrieval, freezing, PGS, FET, and all medications. Then they covered exactly what was needed, and transferred all money to the fertility clinic, and the pharmacy.", "My husband borrowed from his 401K. The interest was steeper (6% I think) than other options, but the “interest” was paid to his retirement account so it really just went back into our pockets. We were lucky to make some money when we sold our house and we immediately paid the loan down, so I can’t speak to how that type of loan works over the years.\n\nEdit: And we could use the money for anything. It was just a blanket loan. Just wanted to share in case that’s an option available to you that you haven’t explored yet"], "link": "/r/IVF/comments/mx81z2/does_anyone_have_experience_with_financing_ivf/"}, {"title": "ARC Fertility Packages & Financing", "content": "Has anyone gone through ARC for packages and/or financing? My husband and I are gearing up for our first cycle of IVF. Our clinic is in network with ARC and therefore we are eligible for their packages. They offer one cycle, two cycle, or three cycle packages that include up to two transfers per cycle. Plus, if you go with the two or three rounds, but are successful before proceeding through all of the cycles, you get reimbursed a (substantial) portion of the costs of the remainder. The packages are clearly discounted from what we would pay if we go directly through the clinic for pricing. They also allow you to finance through them. We feel like it sounds like a pretty good deal, but wanted to vet them first. Anyone have any experience or advice to offer? All insight is appreciated. Thank you!", "num_comments": 9, "score": 2, "top_comments": ["I went through WINfertility and they're pretty good."], "link": "/r/IVF/comments/ibop97/arc_fertility_packages_financing/"}, {"title": "Anyone have experience with ARC Fertility for financing?", "content": "My RE works with ARC for financing and I am wondering if anyone has experience working with them?\n\nIf not, what are financing options that you would recommend instead?", "num_comments": 7, "score": 3, "top_comments": ["I looked into financing for our 2nd round. I'm leaning more towards a 0% for 18 months credit card and if I can't get it paid off in 18 months I'll take a small loan from my 401k so that way any interest is paid back to me."], "link": "/r/IVF/comments/nsdwbe/anyone_have_experience_with_arc_fertility_for/"}, {"title": "What is your occupation?", "content": "Hello fellow IVFers! Was wondering what you all do for work to afford all these expensive treatments and medications?\n\nI (33F) quit my job a while ago to fully focus on IVF. My last job as a communications manager was quite stressful and I wanted to give myself complete relaxation and rest to prep my body the best I can. I know I’m very lucky and privileged to be able to do this! Currently relying on my savings and husband, who works in finance.\n\nI get moments of restlessness, wondering whether I shouldn’t have quit, especially now that I’m just waiting for IVF to start (mid Sep). Maybe it’s a good time for me to change direction!! So would love to get some inspiration from all of you.\n\nLet’s keep it general and avoid personal details where possible. ☺️\n\n\nEDIT: Wow lots of diversity, and it seems like most of you are still working full time, kudos to you all!! It must be hard to juggle both work and treatments. Glad to hear that many of you are covered by insurance", "num_comments": 320, "score": 35, "top_comments": ["Lawyer in commercial litigation-had 20k coverage originally at my firm and then they added another cycle of coverage firmwide after I pushed for it.  (But mostly out of pocket—we’re on our 4th ER and saving for surrogacy bc I have RPL). It sucks to work really hard and spend all of your money on doing something everyone else seems to be able to do for free while they are taking vacations and remodeling their houses.  I’m very thankful most of the time that my career can pay for us to do this, but it still stings.", "[deleted]", "Fintech, VP of Partnerships. Husband works full time in Product Development", "Pharmacist! And dipped into savings - it’s a beast?", "I'm a zoo keeper and my partner is a professional chef.  No insurance coverage, were using our HELOC to pay for IVF.  Both of our families have also been very generous pitching in financially as well.", "Engineer at a Fortune 500 company. We have insurance through Progyny. Once we exhausted all the smart cycles, we paid out of pocket.", "I'm an elementary school teacher in NJ- we have a state mandate that requires insurance covers 4 retrievals + 4 transfers at 100% (including meds for both). Our PGT-M is also covered, but we pay for PGT-A, cryopreservation +  cryostorage out of pocket every cycle. We are using savings for those costs.", "Engineering. My company healthcare benefit includes three smart cycles with Progyny. Otherwise we would have gone to Europe lol.", "Both my husband and I work in the oil & gas industry. My husbands employer covers 100% of IVF and my employer covers 10K lifetime (lol)", "Big4 in Canada. These firms offer about $15-20k lifetime coverage for fertility treatment. We are way way waaaaayyyy past that I have been paying mostly through my annual bonus $ bc my partner makes less money. As all of you know making a science baby is a small fortune. We have moved on to donor eggs so fingers crossed I will graduate from the “journey”", "I work in Corporate Finance but self-pay as my insurance provides no ART benefits.", "I am a student and my husband is military. Military insurance doesn't cover anything for IVF so we are using savings. We've done two retrievals so far and will have our first transfer in October. The pricetag so far is insane. I am baffled how people can afford 5/6/7 retrievals and countless transfers. Not to mention, how does everyone have the time for all of these last minute, mid-morning appointments?!", "Tech Support Manager. I use Progyny insurance. It helps.", "From Australia, I’m a recruiter. It’s a people centric role and my tolerance is real thin these days 🙃\n\nFortunately our clinic heavily subsidised by the government. Between that and our health insurance we have probably paid around 5k so far for 4 iuis and 2 egg retrievals", "Account Manager in SaaS. We have a four day week with 2 days WFH/2 days office which helps with appointments. Basically, half arse it during IVF weeks and pick up the slack in-between. We had one round funded on the NHS, two more privately with savings.", "Radiation oncologist. Husband is an intensive care doctor. Everything fertility related is out of pocket where I live. Funded treatment with savings and kind donations from parents/in-laws. Taking no pay leave from work currently to focus on IVF.", "I’m a freelance artist but my partner does technology engineering for a big bank in Canada we get 80 percent coverage for our first round with government funding. Had to pay like 3000 out of pocket for our first round with medications. We’re waiting on my FET and will have to pay more out of pocket if we have to repeat!", "I’m a Board Certified Behaviour Analyst working as a clinical supervisor , supervising clinicians who work with clients with autism and high risk behaviours. I work from home aside from when I go in home to supervise so that’s super helpful for appts and feeling like crap etc. My husband is a director in restoration insurance (people you call when your house burns or floods). We make decent money but it was still a big expense - we’re in Ontario, Canada but were not willing to wait for our turn on the waitlist for the one funded cycle so we paid out of pocket - my parents very graciously ended up giving us some money toward it. We do have some drug coverage through my husbands benefits (mine exclude all fertility related meds, so stupid). Our cycle was around $9000 CAD + meds.", "accountant but very new to the field after a background in retail. we’ve been financing through cny", "Corporate Marketing Director. My job covers one cycle of IVF (15k lifetime) plus 5k in meds. We’re probably paying 8-11k out of pocket for this round. My husband is a professor. We are lucky and have enough money earmarked for at least two rounds. After that, it gets tight.", "I do brand management and marketing for a tech company that is unfortunately high stress but worth it because I have amazing coverage through progyny", "Information Security Engineer and school counselor. No coverage. I think one of my bonuses covered a large portion and our parents chipped in too. Ironically, MIL paid for my TESE my parents paid for ER. meds and transfers we paid ourselves.", "Optometrist. No  longer seeing patients and now in a medical position for an eye care medical device company. Benefits are amazing and provides $35,000 lifetime max toward infertility coverage.", "I’m a licensed marriage and family therapist. My husband is a tele-communications engineer.", "I am a public school teacher. I inherited money from my mother who passed away. Wouldn’t be able to afford it otherwise", "I work in television as writers support staff (working toward becoming a tv writer and showrunner) and yes, that means I’m currently on strike. My husband works as a graphic designer and illustrator for a major studio/theme park.", "38F here. Working as an accountant, full time. From home. My social insurance pays my IVF treatments as long as I work or until my 40th birthday...", "I’m a software engineer. Things were a lot easier when I was doing my work from home job instead of an office position like I have now. Insurance only paid for some of it. Husband (roofing technician) and I covered most of it out of pocket", "I’m in HR tech and my husband is a civil engineer. He has great benefits BCBS and whatever isn’t covered he has paid for with his bonus.", "Canadian public servant and husband is in healthcare. Neither of us have IVF coverage, although our work benefits will cover the drugs (which are about $8k here for the ER portion, so I'm told). \n\nAlthough we are in a province that provides one round free, funding takes FOREVER to come up at my clinic (18+ months). So we paid this first round out of pocket and are hoping that if we need another, the timing will align (we've been waiting a year now). We can only afford it because I have known since my teens that I wouldn't be able to carry a pregnancy, so we've been saving for years to cover IVF and surrogacy costs (while watching our friends buy houses).\n\nI'm starting to learn there are quite a few American employers that are wayyy more generous with fertility treatment stuff!\n\nETA: although my employer is not covering treatment, they're being extremely accommodating with my absences for appointments etc.", "Product manager in tech. I really lucked out and my company switched to BCBS right before I lost my IUI pregnancy and qualified to switch to IVF covered by insurance. My partner actually has the same insurance through her PhD program, so if they hadn't switched, I would have gone as a dependent on her insurance and paid the full amount for my share (\\~$1000/mo).", "RMN", "I am a Talent Acquisition Partner and my husband is a AUTOCAD 3D and 2D drawer! My company paid 80% of IVF after we hit our deductible. Still with that help, we still paid a lot before hitting our deductible and for all of our medication over and over.", "My husband is a software engineer for one of the FAANG companies. So we have a work benefit that pays for the vast majority of our IVF treatments. We still ended up paying around 15k if you include travel and copays over the years, but compared to a lot of people, that is a drop in the bucket.", "Acupuncturist here! I was working about 6 days a week with my first (successful) IVF cycle 3 years ago...  Currently in my second cycle and writing 4 days a week still. I'm self employed and I don't keep my practice extra busy for my own sanity, but I also think being away from home makes the time go by faster when there's so much hurrying up and waiting going on with IVF!", "I'm a Program Manager at a group home for adults with mental health disorders.", "Lawyer-ish for public sector in a low cost of living area.  We have some coverage which helped a lot, but still paid a decent amount for our IVF journey.  It’s been worth it, though.\n\nBalancing appointments for IVF was actually super easy for me.  My supervisor was incredibly supportive.  Also the appointments were so early, it was rarely an issue.", "I’m a therapist. I actually work 2 jobs. I work a full-time job for a government funded program and I have my own private practice on the side. Despite working as much as I do, I’ve been able to juggle all the doctor appointments quite well. I’m hundreds of thousands in right now because I’ve had quite a few retrievals and transfers. (I’ve been doing this for years!) I also bought donor embryos and that still didn’t work. I’ve taken out loans and used credit cards with 0% interest introductory rates to pay for all of it, so I’m in debt up to my eyeballs. Lol", "My husband works in hospital administration and I own a baby clothes store and export 🙃. We live in Spain, but don’t qualify for public healthcare IVF, so it’s out of pocket for us.", "My husband & I are both in tech - I’m an exec in healthcare tech & he’s a SWE. His company had fertility benefits, though it was sadly just a drop in the bucket.\n\nIf looking for new work right now is too stressful for you, may I suggest just tinkering on a side project in an area of your passion? It’s not too tough these days to take up an artistic hobby, get involved in a local charity (particularly volunteering to take on a casual leadership role e.g. organizing the committee for XYZ project once you get to know them), or even start playing around with an entrepreneurial idea in a low-pressure way.\n\nYou never know what could lead to an exciting new career path, but more importantly in the near-term, having a sense of accomplishment & being a little occupied helps with calm, optimism, dignity, self-worth, something to talk about at parties, a reason to get out of the house, a sense of fun, etc etc.\n\nEveryone is different of course, but I’ve had periods of choosing not to have a full-time job for various reasons. The time that I decided to only focus on the one singular super-high-stakes thing I was trying to do, I struggled with stress and even depression. In contrast, the time I set some personal boundaries around how much time I’d spend obsessing over the one high-stakes thing I was prioritizing— and did enjoyable & worthwhile things with my remaining time— I was MUCH happier & actually more successful at the priority-thing.", "I’m an LCSW (not in private-practice but I’ll be heading there after I give birth). I am at the top of my earning bracket compared to others in my field, but as a social worker (in general) we don’t make much. Husband is in finance and makes 7x -8x more than me. His insurance covered IVF and we were able to store embryos for future use. I’m off his insurance now since it’s less expensive to pay for the FET out-of-pocket (versus paying for PPO premiums for our family of 3). My employer-sponsored HMO does not have IVF coverage but I was able to get my meds for FET covered (I don’t know how my MD authorized it to the HMO but she did me a solid). \n\nI took out an FSA to cover the FET which husband paid for and I’ll be submitting for reimbursement and I’ll keep the money since it’s being deducted out of my paycheck. We did that for tax purposes as we are in the highest tax bracket so any little bit of tax benefit helps."], "link": "/r/IVF/comments/15lyav4/what_is_your_occupation/"}, {"title": "New here - need advice for low-cost options after 5 losses", "content": "Hi all. \n\nI'm 35. In 2022 I experienced three miscarriages. In 2023 we had our first \"successful\" pregnancy - until we found out at 21 weeks that baby boy had a non-survivable heart defect due to T21. Our early screenings (nipt and ultrasounds) didn't catch it. We terminated at 23w.\n\nYesterday I had a first ultrasound for our 5th pregnancy and there was no heartbeat. \n\nWe get pregnant very easily so I've always thought if we just keep trying one will work out. But I think I'm ready to give up after 5. It's clear my egg quality sucks bad (multiple diagnosed trisomies) and it's just become too hard on my mental health to keep losing them. \n\nWe don't really have the money for IVF with genetic testing. We will have to ask our family and friends for support and will probably take out a loan. I'd love any advice you all have about affordable options (I live in the bay area, California). I am happy to travel to Mexico or wherever if I need to to save money.\n\nAlso, if any of you have done IVF due to RPL, I'd love to hear about your experiences. Sometimes I feel awkward in fertility spaces because my experience has been really different than the experience of people who can't get pregnant. I don't think one is harder than the other, but sometimes I feel weird saying \"I get pregnant super easily, but all my babies die\" to someone who's been trying a long time with no pregnancies. I also don't feel like I fit into miscarriage spaces because I had to terminate a 2nd trimester pregnancy and that shit is just...a whole 'nother level of grief. \n\nAnyway. Seeking advice. Whatever you've got, I'll take it.\n\n(Note - I've had everything tested. My partner has excellent sperm quality. Our only issue seems to be egg quality.)", "num_comments": 82, "score": 4, "top_comments": ["Hey there! I’m 33 and have had the same problem. I had 2 miscarriages as well and both times I got pregnant it was almost without trying. We had to make some tough decisions as my OBGYN just told me I had really bad luck the first two times but am fine. I mentally was not willing to do this again, and we opted for IVF. Here in NC it is about $35-40k for IVF and while we could take out a loan…that’s a lot for something that isn’t guaranteed. We are currently in Costa Rica getting IVF now, as the cost was $7,800 total for everything. We are hopeful, and so far I’ve received better care here than anywhere in the states. My IVF doctor does all his own ultrasounds, and has monitored me closely every day. Plus…we are in Costa Rica, so there’s that.", "I suggest you look at Ingenes in Tijuana, which may be a short drive from where you live (to reduce traveling costs). They have a package with a 100% refund guarantee of live birth after 4 cycles (the refund does not include meds or PGT testing costs). Also, meds and PGT testing are considerably less expensive in Mexico. I opted to do IVF in Mexico City with another clinic since it was less expensive for me, but I did not have to pay any lodging in Mexico City. I wish you good luck! \n\nETA: that the package includes donated egg and sperm in case needed and you want to follow that route.", "My clinic costs about 20k for IVF in socal. I saved money by doing a cycle package of 2ER and up to 4 FETs for 35k and getting some of my meds from friends and a fertility pharmacy in Tijuana. Meds are like another 5-8k out of pocket for me. I saved like 50% going to Tijuana for some of my meds", "I am also from the Bay Area, after 4 rounds of IVF locally funded by insurance I continued the journey out of pocket in Tijuana. I did monitoring with my OB (covered by my health insurance), so just 3 trips down to San Diego then cross the border to TJ for each cycle. There are many flights to San Diego, logistically a bit easier than CNY in Colorado.", "Very sorry for your losses. Genetic testing is generally not too expensive ($1-2K depending on number of embryos?) It seems to me that it would be very worth it given the issues you are describing. I know there are grant programs out there as well. I would suggest testing if at all possible."], "link": "/r/IVF/comments/19feuf6/new_here_need_advice_for_lowcost_options_after_5/"}, {"title": "To PGT or not to PGT?", "content": "Hey all. I've known this was coming but I've now officially gotten the news that IVF is our only option. \n\n(And dang, even though I knew what she was going to say it stung and I'm still having trouble processing!)\n\nWe're strongly considering CNY right now because of their in house financing/ bundle options/ reduced cost. I know PGT testing is a separate cost that's not included in financing options so we'll have to come up with significantly more money on the outset (their online cost estimator said around 4-5k I think?).\n\nI think it might be worth it for the higher success rate? It does mean waiting longer because I do not have just an abundance of money hanging out (I recently finished my graduate education and am NOW making good money, but it's a recent thing, and those student loans are just around the corner) or securing financing separately.\n\nIdk. What are y'all's thoughts? On a selfish note I'd like the option for sex selection, but not badly enough to pay an extra $5k by itself if the difference in success rate isn't worth it lol. I keep seeing conflicting information about the difference in success rates with vs without and I'm having a hard time processing all of this so I'm not sure how well I'm really retaining the info right now.\n\nETA: 29, secondary infertility/PCOS with anovulation. Husband is 32 and has a low count though we're still waiting on the full report (our area's *only* urologist was way backed up so all we have is the eyeballing of my OBGYN before IUI until next month). Two losses but not consecutive. Will be getting AMH, estrogen, and prolactin tested on CD3 next weekish.", "num_comments": 37, "score": 5, "top_comments": ["It’s definitely a personal decision but given the stats back up it taking 2-3 PGT normal embryos to result in 1 live birth we felt it was worth it to test and know we were transferring normal embryos and reduce the chances of implantation failure or a miscarriage.", "We did 2 egg retrievals, 1st one we did PGTA and our single embryo came back euploid but I miscarried at 10 weeks. We decided not to test for our second round and it was mostly because of money. It was too much to spend last time on something that I was going to miscarry either way. If money wasn’t an issue, we may have considered doing it again just for the extra information. But we also wouldn’t have discarded mosaics, so the information felt less helpful to us anyways. It’s a very personal choice and at the end of the day there are no wrong answers!", "Agree with Lindsayone for me personally. It may help get more opinions if you’re comfortable sharing a little about your personal situation. Diagnoses for you and partner, age, etc.? PGT is often not as strongly suggested for women under 35, for example. But if you’ve had RPL at any age, that’s a different matter entirely."], "link": "/r/IVF/comments/149nl5m/to_pgt_or_not_to_pgt/"}, {"title": "Cannot decide on PGT-A testing", "content": "A bunch of you recommended that I should opt out of PGT-A testing due to DOR. (Age 32 AMH 0.88). \n\nMy doctor said I have until ER to make the decision but nurse and finance wants to know now so they can include this in my protocol! They want a number if it’s below for example 4 or 5 embryos we will opt out of PGT-A\n\nI have done some research but wasn’t ready to make this decision today! Please help. On one hand I want to do the testing to potentially avoid heart breaks later. My doctor said current Next Gen Sequencing is pretty accurate and they allow some mosaics transfer if no major concern.", "num_comments": 183, "score": 12, "top_comments": ["I’d test. I didn’t and now I’m sort of regretting it after one failed transfer. I’m 33, AMH 0.8.", "I’d test. It really does take so much stress out of early pregnancy when you have the results", "I hope you don’t feel pressured into doing anything you don’t want to do. I am testing half of mine and leaving a few behind that will not be tested.", "TW miscarriage/living children \n\nThe entire reason we're doing IVF is for PGT-A testing, even though it's not a guarantee. I've had 3 losses (and tw, I have two living children). Two of my three losses were a full first trimester of absolute hell. Nausea, fatigue, etc. Everyone said my symptoms were such a good sign, but they were actually because my HCG was wildly high due to chromosomal abnormalities. One loss was a confirmed T21 and the other loss unfortunately couldn't be determined, but the HCG being so abnormally high in that one also indicates a chromosomal issue. (My losses occurred at age 31, 34, and 36. My live births were 28 and 31.)\n\nIf I could have been told that the embryo being implanted had a trisomy, I would have skipped a full 3 months of torture, a missed miscarriage, and a D+E. The \"you find out at 10 weeks\" rationale doesn't cut it for me, personally, when you weigh the cost of transfers plus the cost of the experience.", "I know you have plenty of responses, but I’ll just throw in my personal experience. I decided to test for two primary reasons. \nFirst, I didn’t want to waste transfers on embryos that weren’t viable. The stress of the hope and then the disappointment wasn’t something I wanted to deal with, plus the expense (I’m OOP so the transfer cost and the meds could be significant with failed transfers). While studies about end results seem to show about the same live birth outcome for most women when testing or not, there is a significant reduction in number of transfers and miscarriage. Testing might not increase your likelihood of a baby, but for me it reduces the emotional turmoil and the expense. \nSecond, which relates to the first, is just time. I’m almost 36 and was hoping to bank for more than one child if possible - it helps me to know how many normals I have because more ERs after a transfer might not be realistic. I would have tested no matter my age, but I definitely would have been more ok with the idea of skipping it if I was younger. \nI’m also really glad I tested - in my first ER I had 7 embryos and four were abnormal. The real kicker is that had I transferred based on grade, the first THREE would have been non-viable! That just blew my mind. \nA euploid doesn’t guarantee success but I just wanted to avoid guaranteed failure. \nGood luck! I’m sure whatever you decide will be right for you!", "I would test. I’m 34 and tested, I’m also banking because I would ideally want more than one. I don’t want to think I have enough embryos then find out when my reserve and euploidy is even worse down the line.\n\nIf you do get 4-5 embryos with DOR that would be incredible. Attrition sucks.", "I would agree with everyone else and test. 31, AMH 0.92. Got 7 mature and fertilized and 1 made it to where we could test and ended up testing positive for trisomy 13 and triple X. It’s a tough decision but would recommend testing.", "I thought it was 100 percent worth it. It was a big reason for why I did IVF.", "I’m going to tell you a story that hopefully sways your vote. We had plenty of embryos to test but only tested 8. Of the 8, three were 4AA “perfect health” one tested aneuploid and would’ve been born “intersex or had hermaphroditism” if we would’ve transferred off of grade. Our sweet baby would’ve had quite the trial ahead of them. Test them. And of the 8, 5 came back one gender, 1 came back the other, and the other two were aneuploid or inconclusive.", "I would definitely test.", "I would test!", "I would definitely test. I did my first retriever on 3/8 came back normal. (Age 40, AMH 2.7) and I just did the second retrieval because I’m planning to have two kids. We are waiting on PGT-A testing again. Nothing is 100% accurate, but it’s good to know that you started better grounding. I would totally do the testing to minimize any possible miscarriages.", "I’m on my 3rd round of IVF for baby #2. I was successful the 2nd round with a 5 day fresh transfer. I was pregnant with twin but one miscarried at 9w1d. Ive had 0 embryos beyond what is transferred make it to freezing during those 2 rounds. Fast forward 4 years. I’m now 42, DOR (AMH  is .3), my AFC was 2 at baseline. I had my retrieval last Wednesday. 8 retrieved, 5 mature 4 fertilized and 2 made it to blast. One is an early blast and the other is a 5AB. My RE only does FET and I’m still not testing them. More recent studies have shown that embryos can push abnormal cells outward where they take the same from resulting in abnormal test results. (That area turns into the placenta. ) \n\nTime is not on my side. Our insurance only covers 2 rounds and we are still out of pocket around 8k. They also don’t allow us to bank.", "I was in a super similar spot to you (33 with an AMH of somewhere between 0.7 - 0.9) and agonized over this decision, so I totally understand how you feel! There is no easy answer. I finally decided the day before. Personally, I am glad I did it.\n\nIt's great they transfer mosaics. While errors happen, the chances of a true aneuploid embryo working are low. I am actually cautiously 8-weeks pregnant right now from my first FET, and even with a tested embryo, I'm an anxious mess. I am so thankful for the 10% reduction in miscarriage rate with a euploid embryo. I also found prepping for transfer and the wait after transfer mentally and physically exhausting, so again in hindsight, I am glad I did what I could to up my chances a bit per transfer.\n\nThey had actually told me not to bother with my age, but 4 out of 10 were aneuploid, and one was mosaic. One of my aneuploids was a 5aa embryo that they very likely could have chosen to transfer first.\n\nWith low AMH, knowing how many \"good\" embryos I had helped me decide whether or not to do another ER before transferring as I want more than one child and know it will only get harder for me in the future, so I wanted to bank what I needed now. I would think of it more as a prioritization tool than a guarantee and decide if it feels worth it to you.\n\nGood luck!!!"], "link": "/r/IVF/comments/zefmip/cannot_decide_on_pgta_testing/"}, {"title": "What was the cost of your Ivf?", "content": "I have pcos and I don’t ovulate. The whole time my husband and I have been ttc I haven’t ovulated once. Currently waiting for our RE apt, but was curious about the cost people paid for Ivf. My clinic offers financing so we will be looking into that. We don’t know for sure if we will go the Ivf route or letrozole/clomid route, but we’re wanting to get pregnant soon and not have to keep trying. All experiences welcome, thank you in advance.", "num_comments": 74, "score": 18, "top_comments": ["3 cycle ER package is $32,500 not including meds and transfer. I’m in Southern California.", "With retrieval, 1 transfer, and genetic testing $20k out of pocket. My meds were 4500. I’m in Dallas TX.", "Paid 24,500 USD for 6 rounds of the shared risk program. Either you get a live birth or your money back. My insurance would cover it but they wanted me to do 6 IUI attempts first. Due to MFI my doctor thought IUI would not work. I didn’t want to waste time. Therefore, we bite the bullet to go straight to IVF. My insurance thankfully covered all my meds (except Lupron for some reason but I’m appealing) plus 1700 for PGT-A testing.", "Definitely check with your insurance. I say this bc I did not know I had coverage until i really looked into it. I live in Missouri but work in Illinois so some coverage is mandatory in Illinois as well as Arkansas, California, Colorado, Connecticut, Delaware, Hawaii,  Louisiana, Maine, Maryland, Massachusetts, Montana, New Hampshire, New Jersey, New York, Ohio, Rhode Island, Texas, Utah, and Virginia. I also have PCOS and tried letrozol and clomid, letrozol on its own first then both together but it didn't work. Our first round of IVF did work though! I paid my $4,000 deductible and everything wad covered included everything for my pregancy so far. Not saying you will have coverage but it never hurts to check", "$20k without genetic testing. Higher if you end up testing. I’m ~$25k in for a cycle with testing half my embryos. Southern California.", "All in - meds, IVF, transfer, genetic testing - just over $30k", "3 rounds of egg retrievals plus transfer and the medications plus labwork and testing cost us $53,000.", "2 retrievals was about $13,000 with meds. $9,000 of that was the optional genetic testing that I had done since I’m 42. The actual FET should be covered totally by the insurance (it covers IVF 100%, but not egg retrieval or testing). Insurance doesn’t 100% cover meds either, but I hit my out of pocket max now, so the meds are free until January. I will order as much as I can before that happens, and hopefully stockpile enough that I won’t have to buy any meds until I’m successful or run out of embryos. I’m stopping at what I’ve already spent regardless of what happens. So the price tag shouldn’t go up much farther than $13,000. I live in the Washington DC suburbs.", "In North Carolina. My discounted rate since I didn't have insurance was 13750. This included 1 ER and 1 FET. My med cost was about 4k and we opted to do PGTa testing which was also an additional 3500. The pgta testing was for 8 total embryos but we only had 3 at the end of our first ER to test. Each additional FET after the first one that is included is 3k.", "Luckily, my insurance paid…but the clinic billed $32k for egg retrieval, meds, ICSI, and testing. This was one round, and haven’t transferred yet. Dallas, Tx.", "In Durham, NC and without insurance it’s $35k a cycle + $7k for meds. Since my employer is based out of NY, I have NY benefits and only have to pay 10% of that, gratefully.", "I’m in SoCal and including meds I paid $20k per round of ER, which included ICSI and zymot chip but no embryoscope."], "link": "/r/IVF/comments/16jplcm/what_was_the_cost_of_your_ivf/"}, {"title": "Discouraged", "content": "Do you ever feel like it's just never going to happen for you, due to the cost of IVF?\n\nI am 37 years old, my husband is 31. We started working with CNY after it was discovered both of my fallopian tubes are blocked, with IVF being our only option. We chose CNY because they offer financing, which is great!\n\nHowever, while CNY finances the process, meds are out of pocket and our insurance doesn't cover most of these. Now that we're past all of the diagnostic parts, and next month we're due to start the official IVF process, we received a list of meds I'll need to start and the ones that are not covered by insurance are going to cost $2,000! We don't have that much money just sitting around.\n\nMy husband and I aren't broke. He is in the military, and I work a decent paying full time job from home. But we bought a house last year, and unfortunately, unforeseen fixes drained our savings. While we can afford the monthly payments for the financing, I just don't know how we are going to come up with the money for the meds before my next cycle. I'm tired of waiting to start IVF and I feel like I'm running out of time...\n\nI'm not really looking for advice, and I hope I don't get judged for us not having a bunch of money saved. I guess I just needed to vent....", "num_comments": 25, "score": 11, "top_comments": ["I hope no one would dare judge. The USA does so little to provide affordable healthcare. It can be such a huge financial burden, even when you have some insurance coverage or financing.\n\nWe had a number of unexpected expenses happen just as we started IVF. We opted to open a credit card with 0 interest for 18 months to put them on. This isn't advice necessarily, or even a recommendation (I'm sure some folks would say we're making a mistake), but this has enabled us to finance the medications for a few rounds.", "My husband is also active duty and idk how we’ll afford it. CNY is the only viable possibility for us because of the substantially lower cost but my god it’s still so much. I think I’ve cried 4-5 times a week since we started discussing starting the process because of the cost \n\nOur biggest hurdle is my husband’s MFI which has started since he’s been in the army which is even more infuriating because it’s not covered by his insurance despite clearly being from something he’s exposed to or something. \n\nIt sucks. It’s not fair. But you’re not alone", "Try shopping around for meds. Honestly $2k is pretty cheap for meds! So if that’s the regular pharmacy price you can definitely get it cheaper.\n\nI recommend IVF Smart. It’s a weird pharmacy abroad and you have to hand write an order form and email it to them but they were super responsive and gonal f was half price!\n\nI know it sucks. I’m sorry. And yes I feel the same as you do. It’ll never work but where we go again"], "link": "/r/IVF/comments/14egpjp/discouraged/"}, {"title": "One Normal Embryo", "content": "After our first round of IVF, we wound up with one PGA normal 5AA embryo.  Hubby and I are both 41.  Should we transfer or go through another round to try to get 1-2 more embryos?  I have concerns about not using a viable embryo if we have extras, going through all of the meds again, and of course finances.  I’m also aware that every month my eggs are aging and our chance of having normals decreases.  Pretty torn on this, I’d love to hear others’ experiences and opinions.", "num_comments": 67, "score": 27, "top_comments": ["If you want one child, I would transfer. If it fails, you won’t have lost much time. If you want more than one child, I would try to bank mote embryos. Best of luck to you!", "At 41, I will do another egg retrieval to bank. That and usually for the first egg retrieval, the protocol is a trial and error. By the second retrieval, doctors have a better idea on what works, what doesn’t and they will adjust your stims.", "First off that’s a fantastic result at 41. Second, I have a lot of experience in this, and would absolutely do another retrieval. We are using proven donor egg created embryos in a proven surrogate — my doc says even the best embryos have a 50/50 chance. It took us two tries to get pregnant — not at the end but close, due in December.", "We had one euploid after our first ER. We transferred. It failed. So we did another ER and ended up again with one euploid. We transferred it. CP. So, now we're looking at a 3rd ER. We're doing a refundable/cost share program which required us to transfer any viable embryos before moving on to the next ER and doesn't allow for embryo banking. It's been a frustrating process. If we didn't have those constraints, I would have opted for doing consecutive ERs versus going back and forth.", "Depending on your reasons for doing IVF and how many children you want, I would do another egg retrieval to have the chance at more normal embryos. If you decide to transfer, I would do all the testing possible to ensure success beforehand. I do have a friend that had one normal embryo only and after 7 or 8 miscarriages this one stuck. They were planning to have just one child and then a year and half later she got pregnant naturally at 42.  So you never know what can happen!", "I’d go ahead and transfer. Realistically I don’t think your eggs are going to change qualities in the timeline that a failed transfer would push you back. Meanwhile, another cycle is physically, financially, and emotionally taxing. \n\nFrom a risk versus rewards standpoint, I think it’s worth a transfer is worth trying."], "link": "/r/IVF/comments/16y8o36/one_normal_embryo/"}, {"title": "Do you hold the record over # of FETs with no live birth?", "content": "Just had my 9th FET and currently in the TWW. I can already tell it’s not going to work out this time either. It’s not even a “I’m in treatment” thing anymore, this is now my lifestyle. Just curious out there how many FET is many? Am I wasting my money doing this? Is there some sort of world record of FETs before live birth? Never mind it’s draining my finances, body and soul, but how long do the most resilient warriors out there keep up? \nIs the universe trying to tell me something? Sick of this. Thanks for reading my rant.", "num_comments": 54, "score": 83, "top_comments": ["12 FETs. 4 me. 3 surrogate my embryos, 2 surrogate donor egg embryos, 3 surrogate donor/donor embryos. Last FET in my surrogate has worked- so far but not close to a live birth yet.", "I’ve done 10 transfers in total - 7 FETs and 3 fresh. Just had 3 miscarriages. I’m doing my 8th stim now.", "I’ve transferred 8 euploid embryos over 7 FETs, and am currently scheduled for FET # 8 with embryo #9, but expecting to head into 2 back to back retrievals if (when) this transfer fails. We’ve said those next 2 retrievals will be the end of the line if no live birth but who knows. I don’t know how many is too many :( hugs to you. \n\nI will say there’s an article out there showing chances of live birth continue to improve up to 9 cycles (9 retrievals and transfer of all associated embryos)", "This thread kills me. I’m trying to do my third FET (cyst, thyroid, all kinds of issues & setbacks). I literally sobbed today that I’m so tired of this being my life. It’s hard to find joy in this season. I’m thinking of each of you. This is so unfair.", "Beta for FET#7 is tomorrow. I’m having major period symptoms so it’s not looking good unfortunately. 3 have been euploid (including this one). I have two untested low quality embryos left and then I’m done.", "I don’t have the record. But my heart goes out to you."], "link": "/r/IVF/comments/17a150a/do_you_hold_the_record_over_of_fets_with_no_live/"}, {"title": "Any BMI no rule clinic?", "content": "Hey everyone, I just found a ivf finance company I'm comfortable going with but my bmi is on the higher side. I'm in south Carolina I know there's a popular clinic in NY that doesn't care about bmi but is there any other ones out there anyone know about or can tell me?", "num_comments": 7, "score": 2, "top_comments": ["I went to Chicago IVF, and they never mentioned bmi at all."], "link": "/r/IVF/comments/1b2mw9b/any_bmi_no_rule_clinic/"}, {"title": "Pregnancy without fallopian tubes?", "content": "I had to have my tubes removed for a few different reasons. I understand IVF is now my option if I want to have another child in the future. Has anyone else ever had this issue? What was the outcome? What was the cost? I also understand IVF may not work the first time. Do you have to pay for each time you try? There is so much information surrounding this topic oic but I would really love first hand information from someone who has experienced it. What can I expect? Are there other procedures to accommodate those wanting to get pregnant without having tubes?", "num_comments": 48, "score": 9, "top_comments": ["IVF is made for women who have no tubes or have blocked tubes, so not having tubes is not a barrier\n\nIf you are in the U.S. and have no insurance coverage, you generally pay per egg retrieval, plus the costs of the mediation (high). A fresh transfer is usually included if you are eligible and not doing testing of the embryos to ensure they have the correct number of chromosomes\n\nFrozen embryo transfers average $4,000-$7,500 in the U.S. depending on your location, clinic, and whether it’s an ovulatory or non-ovulatory transfer", "My wife had 2 ectopic pregnancies rupture, resulting in both of her tubes being removed. IVF is the only option if you want to be pregnant. \n\nWe just did our first round of IVF (egg retrieval and embryo transfer), and it was unsuccessful. Thankfully we have 1 more embryo to try at a later date. We’ve paid ~$12k CAD for procedures, and about ~$5k CAD for meds so far.", "I was born with only one functioning tube, and it was destroyed with an ectopic pregnancy. IVF was my only option afterwards. I was extremely fortunate to have about $20K covered by my husband's insurance, but still out of pocket some. I was also extremely lucky that my one egg retrieval yielded enough euploid embryos for the 1-2 children we want, and so far my first frozen embryo transfer has worked. (I'm 13 weeks). Infertility is very unfair and very expensive. But it's absolutely an option for someone without tubes - you don't need your tubes whatsoever with IVF.", "I have blocked tubes and IVF was the only way I could get pregnant. Unfortunately the first transfer failed due to unknown reasons I never did the ERA test. I waited a few months to do my second transfer which did work and now I have a six week old! If you’re looking for a somewhat cheaper clinic there is one in Gilbert Arizona called new directions that was rhbmost affordable for me and my husband. I believe they are 6500 for the first round and the first transfer is free. Subsequent transfers are 2500. The price does not cover extra ultrasounds or labs but my insurance semi covered those. \nIf you don’t have any other fertility complications I don’t see why it wouldn’t work out the first time but they will do blood tests and ultrasounds to see more. They will do a baseline appointment to look at all of that."], "link": "/r/IVF/comments/1au4q7j/pregnancy_without_fallopian_tubes/"}, {"title": "What would you do? (Financial question)", "content": "We learned recently that IVF is in our future due to MFI.  On top of that, I hav DOR with 7-9 follicles total on my US last month. \n\nHere’s the dilemma… we’ve been saving hard with the plan to start house hunting in March.   We’ve never owned a home before so it’s taken us a long time to get to this place.   Now that we know we’re going to have to embark on this IVF path, we have a choice to make.  \n\nWe can:\n\n1) Go for IVF now:  This would require either spending our down payment money or financing $30k + less than a year before we’re trying to buy a home.  Given all the strikes against us I’m anticipating this to be a long, hard process that may or may not end with the result we want.   If we do this, I’m afraid we’ll end up with neither a house or a baby. \n\n2) Wait til next spring/summer:  This would let us buy our house and secure our mortgage as planned in the spring…. But it will significantly delay our working toward pregnancy.   We’d also definitely* have to finance the process if we did this.  I’m concerned that 7 follicles now could mean no follicles in a year…. What if we wait and its too late?", "num_comments": 75, "score": 11, "top_comments": ["I want to add another option here, consider a job opportunity with fertility coverage. There are some large employers that provide coverage. Understand if that is not on the table due to shaky economic conditions or seeking job longevity to secure house financing.\n\nPersonally, I would not want to wait.", "Can you consider doing it overseas? I saw someone recently did it in Europe and only paid $7K. You and your husband could work remotely for 2 weeks so there's minimal disruption except for timezone switching. It's hard to know the future. I've had scans that show 15 follicles and scan that showed 4, and my AMH was typical. I had 1 good ER with 10 eggs and 1 that I almost cancelled with 9 eggs but only 4 mature. \n\nI would do IVF now and let the housing market cool off further. You can make more money and the houses will be there, but the eggs may not be.", "You can always find a way to make more money and you can always find a way to get a house later. You can't make more eggs. I'd find a way to do IVF now. Do you have a 401k you can borrow money from? Not ideal, but some credit cards have 0% interest for 18-20 months (I used US bank). I've had friends with large credit card balances that will transfer to a new 0% card and pay 3% interest when the interest free period ends and just do that every 12-18 months until it's paid off.", "If you go option 1, it will impact your house financing regardless. If you go option 2, you can get a better rate on your house, and you will have no impact to the rate you get on the longer loan.", "This is what my husband and I did when we were in the same situation. So we bought a house but we specifically looked for a house with income potential. Our house right now came with a granny suite (kitchenette, bedroom, full bathroom) completely separate unit, all we had to do was buy furniture and create a walkway to the back private entrance and we now have an Airbnb which pays for our mortgage plus other moving expenses. This has helped immensely with affording our first round of IVF ICSI but will find our future second round as well!", "Have you looked into programs for new home buyers in your state? There are programs out there that allow you many benefits to purchasing your first home including lower (or no!) down payment.", "I personally would go for the pregnancy if you already have some odds against you, although I think my husband would prefer the security of a  home. Good luck with the decision", "In terms of costing , we pay out of pocket for IVF $12k (not included FeT)", "We got a credit card that had zero percent interest for 2 years. I have heard there are medical credit cards that are zero percent for 3 years. It’s still a lot of money but at zero percent it at least gave us time to figure out the financials since time was the concern on the IVF front."], "link": "/r/IVF/comments/wgwefo/what_would_you_do_financial_question/"}, {"title": "Friend upset with me", "content": "As you know ivf is hard financially, and everything else, I’ve told my international friend about ivf - she’s single, we usually go on a trip every couple of years, and she really wants to go on one, I feel bad since I entertained the idea of one but I no longer have a job, and just the unknown of getting pregnant or not is hard… we are going abroad for ivf and so that’s another cost and unknown, so I explained this to my friend about the money and unknown so it’s hard to plan, but I broke it to her about my finances, I FEEL SO BAD! ", "num_comments": 24, "score": 13, "top_comments": ["Wow your friend can suck it. Unless she offers to pay for your trip then she can f alllllll the way off.", "One sad thing about this process is that there will always be people who don't understand the physical, mental, emotional, and financial toll that IVF can take on a person. It's also confusing to them how you don't know what your life will look like a couple months down the road. Even I didn't really understand that when I set out in this process.\n\nI have been lucky that most of my close friends have been understanding as I've had to miss life events etc, but at the same time it has definitely put distance between myself and friends who don't really understand the way that IVF can consume your whole life, especially when you are on this journey for longer than you initially planned."], "link": "/r/IVF/comments/1azyfsb/friend_upset_with_me/"}, {"title": "Pharmacy recommendations for medication??", "content": "Hi - starting my first round of IVF soon.  The finance team at my doctors office recommended I pay out of pocket for all the meds because the pharmacies will charge me less out of pocket vs using my insurance which has a lifetime maximum I expect to hit if I go through multiple cycles (very fortunate my company covers a lot of my treatment). \n\nDoes anyone have recommendations on less expensive pharmacies they’ve used or been in a similar scenario?  They want to charge $17k to my insurance but after talking to the finance team they believe I can find meds for $5-7k if I pay out of pocket.", "num_comments": 23, "score": 4, "top_comments": ["I used Freedom Fertility!", "Schraft's 2.0 in NJ has the most phenomenal service I've ever seen. They got meds to me on Labor Day within hours of me calling them when my cycle started unexpectedly early. There's someone on call there pretty much 24/7", "Alto if you are in the States. I used Freedom for two retrievals and then switched to Alto and what a difference it made! They have an app that basically works like Amazon once your clinic sends the prescription in. You just click on the medication, it goes into your cart and just check out! I am in California too so they have a same day delivery service (literally If you order by 11am, you get it by 9pm on the same day)"], "link": "/r/IVF/comments/y2m76d/pharmacy_recommendations_for_medication/"}, {"title": "How do I afford IVF", "content": "Our fertility clinic said the best chance for a successful pregnancy would be IVF with embryo testing. We have unexplained secondary infertility with recurrent pregnancy loss. The cost comes to nearly $20k for ivf with embryo testing. I know it is so expensive, but I have extreme anxiety of paying for that and then it not even being successful. How do people afford IVF? Do they finance it? It seems so unrealistic. I’m a SAHM and have desperately applied to multiple jobs that do offer fertility coverage but have had no success. I just feel so hopeless.", "num_comments": 26, "score": 3, "top_comments": ["I used the cheap clinic CNY as a travel pt for 6k. They offer financing. They have several locations. I’m", "Not super helpful but from savings. You didn’t owe it all at once. Egg retrieval is the most expensive chunk. Then you can/have to wait to do transfers. So you could save up before doing a transfer."], "link": "/r/IVF/comments/17patqz/how_do_i_afford_ivf/"}, {"title": "Random question… could an egg retrieval and a frozen embryo transfer be done on the same day?", "content": "I’m getting ready for my first transfer in a few weeks. I’m already paying for ultrasound appointments to check my lining, and I have a bunch of leftover meds from my other retrievals. Could I squeeze in another retrieval at the time of transfer? Or is this dumb? I mainly ask this because of finances…. Could it potentially save me money doing it this way? And do you think it would be tolerable to do an egg retrieval without anesthesia to save money?", "num_comments": 20, "score": 0, "top_comments": ["Absolutely not, ethically. An egg retrieval is done after minimal or no exposure to progesterone in the body. A transfer requires many more days of exposure to have a reasonable shot at success, due to the need of progesterone to put the uterus in the right state. Doing a transfer the day of retrieval gives almost no chance the uterus will have been ready. Alternatively, you are highly likely to have ovulated all those eggs if you DID wait until the correct transfer day to retrieve, and if you didn't, high levels of progesterone before retrieval is shown to lead to very poor outcomes in that retrieval. Either way, one of the two is going to have a bad outcome.", "The timing of your egg retrieval is largely determined by how your body responds to stims - which is why they measure your follicles to estimate how many mature eggs they are likely to receive. Without stimming, you’re likely to get between 0-2 eggs, and it’s very unlikely that those eggs would even be mature on transfer day."], "link": "/r/IVF/comments/191dn3j/random_question_could_an_egg_retrieval_and_a/"}, {"title": "Supplemental Fertility Insurance experience?", "content": "Just at the beginning of the journey and feeling overwhelmed by the finances of it all, finding insurance coverage for IVF etc. Does anyone have experience with supplemental fertility insurance? What are the monthly premiums like and does it have to be the same company as your primary health insurance?", "num_comments": 7, "score": 2, "top_comments": ["Dang. We have no coverage but we have demanding jobs already.  Can’t believe not a single dollar is covered in our state plans. 😡"], "link": "/r/IVF/comments/18yv5oe/supplemental_fertility_insurance_experience/"}, {"title": "Egg Freezing Dilemma", "content": "I’m 33, AMH of .4, and have around 4-6 follicles per cycle. I just had my first egg retrieval and got two eggs. \n\nI was super sick during the cycle, with a cold or flu. Only three of my six follicles matured and I wonder if more would have grown if I hadn’t gotten so sick.\n\nMy hope was to freeze eggs for use with a future partner. One thought I’ve had is to keep doing retrievals. Even if I only get two or three per retrieval, four retrievals could get me to around ten eggs. But I’m getting a lot of advice to freeze embryos using donor sperm. \n\nHelp?\n\nPs - finances are no concern\n\n\nPps - I just learned that only one egg was mature and will be frozen. Praying for more eggs next time\n\nUpdate:  second retrieval froze four more", "num_comments": 59, "score": 15, "top_comments": ["You're not nuts, but the advice to freeze some embryos as well is also not nuts. If you can afford to do many cycles, I would strongly consider freezing both eggs and embryos. Frozen eggs have a good thaw rate at good labs, but it's not 100% (more like, 80 to 90% somewhere with good stats), *and* unpredictable things can happen. Embryos freeze and thaw more easily and reliably, plus you've then moved past several enormous attrition stages. Not all eggs will thaw, but then not all thawed eggs will fertilize, not all successful fertilizations will develop to day 3 embryos, not all day 3 embryos will make it to day 5 blastocysts, etc.\n\nSo where with eggs you have the most future options, with embryos you have much, much more information. You can't really tell much about eggs' quality just by looking at them, and freezing some embryos would give you tons of new data about fertilization rates and embryo development/quality. And drastically better odds, with more confidence--where you often need dozens of frozen eggs to have a reasonably high statistical chance of a live birth, one highly graded embryo can have live birth odds over 50%. One euploid PGT-A tested embryo can have live birth odds that are even higher.\n\nSo while I know freezing embryos would be a paradigm shift, given your plans, it's definitely worth considering if you can. Freezing eggs isn't a bad option, but it has a lot of unknowns. And IMO even if you decide to mostly do egg freezing, even one round of embryo freezing would give you some seriously useful new insights into what you might expect from those frozen eggs in the future, insights that can also inform your planning.", "My AMH was 0.23 and I had between 2 and 6 eggs each time. My last cycle at 42yo gave me 3 eggs and one whole baby 😂 I would keep collecting. They say 15 eggs per child that you want, if I remember it correctly. I did a bunch more rounds before because I want two children(at least). Every cycle is different. It can be many factors. Or just coincidence. Keep it up!", "I had a friend tell me that freezing embryos was much better than freezing eggs, so I asked 2 different doctors I met with about it.  Both doctors explained to me the comparisons of embryo vs egg freezing success rates can be misguided because it’s not *apples to apples*.  \n\nAn egg is 1 cell.\nAn embryo is 100 cells.\n\nNot every egg will successfully turn into a viable embryo. Also not every embryo will be viable or lead to a successful live birth.\n\nThat helped clear it up for me. Hoping it can help provide some perspective.", "Your firs cycle usually yields lower count because it is s test trial. Doctors usually adjust protocol after a low yield cycle. As for embryo storage, i highly recommend it.", "For people who freeze embryo as well as eggs, do you go on multiple cycle straight? Is the hormone injection going to affect fertility or health? And what is in your mind if your are choosing to use donor? I am having panic attack.."], "link": "/r/IVF/comments/16qzzq6/egg_freezing_dilemma/"}, {"title": "Never felt more alone", "content": "Just found out our IVF transfer failed right before Christmas - devastated doesn't even begin to cut it. I'm not sure feasibly with age and finances what the future holds treatment-wise.\n\nContacted the hospital for their IVF counselling service and was offered an appointment in early March. So shocked they can give you a treatment that pumps you with hormones that create mood instability and depression, watch you be dealt a devastating blow, then not offer any mental support for MONTHS. My private therapist isn't available and we haven't shared widely shared our struggle (for several reasons) so now I just feel absolutely lost, isolated and genuinely worried about my mental health and the darkness of my thoughts.\n\nHow does this get better? Does this get better? I guess I'm just looking for some hope that I can move forward...", "num_comments": 34, "score": 17, "top_comments": ["I am so sorry. I just found out yesterday that my first FET (12/22) is likely being cancelled today because of a polyp. I am older, the door is closing, and I only have two embryos. I am petrified of how many months this is going to set us back.\n\nThe nurse was concerned that I was going to be afraid it would be cancerous (rare)... but if I'm being honest, my brain immediately defaulted to *'if this isn't going to happen, then please let it be malignant'*. (If I'm being honest, I'm still \"there\", and am kind of in \"I'd rather be hit by a bus than have to deal with the holidays right now\" mode.) \n\nI was completely unprepared for how fraught and isolating this process was going to be.", "I’m so sorry. Its heartbreaking. First attempt I miscarried at 8 weeks. 2nd FET was successful and I have a healthy 4yo. Be kind to yourself, you will get through this. It will be a sad road but hang in there.", "Sorry to hear this, it can be a very isolating feeling.  Is this your first?\n\nOur first was the hardest, but it did get better.  Strangely, it got better as time went on, and we didn't actually start our first round until we were 39 (F) and 42 (M).  3 failed cycles, and we were lucky to have it all work on 4th cycle.  Similar to someone else's suggestion, we were getting concerned at how long each completed cycle was taking, so in order to make the most of our current egg quality, we done back to back retrievals to try and bank as many high quality eggs as possible.\n\nWe had access to a genetic counsellor but not an experienced counsellor with fertility knowlege... this would have been helpful.  We also didn't tell our families and also 99% of our friends...  so it did feel very lonely at key times... especially when each of us were also struggling in different ways.\n\nThe only way I can say it got better for us, was when we shifted our goal from having to have a child (which is the overall goal) to us doing the best we possible can with the capacity and resources that we have.... this became our guiding star, as we could then rest assured if we had done our very best and it didn't work, then we would have to be ok with this.\n\nWish you all the very best with this challenging journey, and know that you are not alone."], "link": "/r/IVF/comments/18jpwpp/never_felt_more_alone/"}, {"title": "This has been a cruel journey for me", "content": "Hitting the two year mark of transfers, first MC, 3 failed, discovered I had a septum, surgery, 5th transfer worked but bleeding at 15w ruptured my sac - TFMR, baby would’ve been due 12/24, more egg retrievals, transfer last week failed. WTF @ whatever higher power has decided I shouldn’t be a mom. \n\n\nI’m just over this…i don’t have endless finances to keep doing this and clearly my body has failed me.\n\n\nEdit: most recent transfer was a chemical, thought I saw a faint positive on Tuesday but tested negative since and beta today was at 3. I think this make it worse, grasping onto what else could I have done to make it stick 😞", "num_comments": 22, "score": 43, "top_comments": ["Right behind the 2 year mark for me too and I struggle with the same thought about the higher power making a judgment on me and deciding I’m not meant to be a mom, but I try to remind myself, I never ever think that when other people I know go thru infertility. I never think it’s a judgment of the universe. And I don’t think it’s true for you either- you deserve it as much as anyone else. Sending you love, be as kind and gentle to yourself as possible. The upcoming 12/24 must be hurting. Hope 2024 brings you some peace.", "I’m so sorry! Infertility definitely isn’t fair! You don’t deserve any of this. No one does! Prior to my IVF miracle babe, I used to get really upset when I would see losers getting pregnant and having kids they were unable to care for. Don’t give up! I’m hoping you get your miracle babe, too! 🍀🤞", "What a long and draining journey. My heart goes out to you."], "link": "/r/IVF/comments/18nqdll/this_has_been_a_cruel_journey_for_me/"}, {"title": "Future Family Membership", "content": "My husband and I are considering taking advantage of Future Family’s 0% interest loan for our IVF cycle. To access this financing, we must enroll in their membership to gain access to their fertility coaching team for $599. Has anyone here had experience with Future Family that they can share, both their financing and the fertility coaching? Is it worth it?", "num_comments": 7, "score": 3, "top_comments": ["I’m not familiar with this program, but it seems like a good option. For comparison, my clinic offers six months of financing for $675. The only other suggestion I have is to consider your credit card company. Mine offered me a one time 0% interest personal loan for a term of one year. I just might do that since meds out of pocket was a lot."], "link": "/r/IVF/comments/10j4mjp/future_family_membership/"}, {"title": "On to the next clinic", "content": "I’m 9dpt today, negative tests, with our only embryo that came from 19 mature eggs. \nWe took out a loan to make this work and now are forced to go to a clinic with in house financing. \n\nAny tips or tricks for using CNY Buffalo as a travel patient? I’m 6 hours away, and plan to do most things remote and drive to and from same day for procedures, possible one over night", "num_comments": 6, "score": 5, "top_comments": ["I’ve heard such good things about CNY! I hope you get super lucky your next cycle ♥️"], "link": "/r/IVF/comments/18um09s/on_to_the_next_clinic/"}, {"title": "Any advice on when to start IVF?", "content": "I’m 31 (will be 32 in July). My partner and I are on month 16 of TTC and I’m getting so worried. So far we’ve had all testing done except a laparoscopy (I have suspected endo). All tests have come back normal except my AMH is only 1.5 (for some reason my RE didn’t flag this as abnormal). I am on the wait list for a laparoscopy and was told I should be able to have the surgery within the next few months. We were recommended to try IUI first which I have another appointment with my RE in May to discuss IUI if I don’t hear back about the lap before then. I’m just worried about waiting too long but IVF is sooo expensive and I was hoping to save for another year before starting the process. I’m just worried if I wait another year I will regret it. Did anyone wait to start IVF because of finances and have success? Any advice would be soooo appreciated! ", "num_comments": 23, "score": 1, "top_comments": ["Start sooner than you think/want", "Everyone will tell you: start before you think you want to. I can’t tell you how much I wish I started in January 2023 instead of January 2024."], "link": "/r/IVF/comments/1bima82/any_advice_on_when_to_start_ivf/"}, {"title": "To buy or not to buy?", "content": "My partner and I have 4 embryos on ice. \nHoping to start our transfer process next year. I have low AMH. \n\nOur donor has one vial of sperm left. I’m conflicted, whilst my partner wants to be optimistic and save money,\nI want the opportunity to have another vital as a back up plan even though my AMH might be even lower. \n\nWe don’t have money saved but I can buy now and pay later.\n\nWe want two children by the same donor if possible. \n\nShould we save money for our transfer or pay for another vial? \n", "num_comments": 10, "score": 2, "top_comments": ["So wish we'd sprung for another vial before conceiving and our donor ran out. Worst case you unnecessarily spent $1k but not having enough donor sperm really sucks."], "link": "/r/IVF/comments/1be1098/to_buy_or_not_to_buy/"}, {"title": "What is the average number of FETs? (failed FET)", "content": "Was just curious.. do most people do a number of transfers before they get pregnant / have a live birth?\n\nI really thought that my 3rd one will work but my period came just before my beta test. I thought I was quite okay but when night came, I just bawled and felt the loss so hugely. It felt hopeless too as I couldn’t understand why 3 embryos couldn’t implant. \n\nUnfortunately, we can’t do testing where I’m at so I wonder how many times I have to keep transferring before my finances and faith run out. \n\nIVF is really so tough and lonely. My close friends feel bad for me but praised me for being brave. But I’m really not. I’m still sad and feeling lost. Just can’t believe my 3rd one didn’t implant as well.", "num_comments": 29, "score": 13, "top_comments": ["I’ve seen it floating around on here that 95% of people will get pregnant with 3 FETs of euploid embryos, but I’m not sure where that stat comes from. \n\nUnfortunately a lot of us on this sub need more than 3, and definitely a lot of us need more than 3 for a live birth. Folks who have success with #1-3 often move on from this sub.", "Highly age and medical history dependent, but in [this study](https://www.nejm.org/doi/full/10.1056/NEJMoa2103613#author_affiliations&uccLastUpdatedDate=2021-09-12%2004%3A39%3A23.44%20%2B0000&uccLastUpdatedDate=2021-09-12%2004%3A39%3A23.44%20%2B0000) without testing average number of transfers to live birth was 1.3. But this was women under 37 without RPL. \n\nIf you can't test the embryos, is there other testing you can so? Like endometrial biopsy or laparoscopy?", "In my country testing isnt allowed either. It can be very discouraging to never test positive. I had 4 transfers without even implantation. The 5th took but unfortunatly resulted in misscariage. There is one study saying the number of embryos you need for one euploid. For 39 its 6 for example. Its a numbers game and it can take way longer than expected in the beginning. I remember my first transfer where I couldnt believe that it didnt work out. Clinics need to inform better in my opinion."], "link": "/r/IVF/comments/186a7pw/what_is_the_average_number_of_fets_failed_fet/"}, {"title": "Quit teaching during ivf", "content": "I won’t be given any time off for my ivf esp as getting time off is impossible. I worry about finance but want this to happen, I want a career change. Has anyone here gone through ivf and is a teacher? How did you manage the stress. \n\nThe reason is I’m so scared bc my colleague got hit in the stomach whilst pregnant and just viruses going around… thoughts please. I’m miserable in teaching it’s such an anxiety led job.", "num_comments": 12, "score": 8, "top_comments": ["I retired from teaching to focus exclusively on giving IVF our best shot. 💉\n\n(You can read about my reasons why on [this](https://www.instagram.com/p/CiY90R6MHDg/?igshid=MzRlODBiNWFlZA==) post.)\n\nI do not regret my decision at all—even though a year later we are still in the IVF trenches.\nWhat I do regret, however, is sticking around as a teacher for as long as I did. A year away from the classroom has allowed me to reflect and objectively reason that it was never worth it & I should have retired sooner.\n\nIn TX, being a teacher is not worth it. Not financially. Not emotionally. Not even for the promise of a future (& insultingly small) pension. It’s a very low-paying job, with very little upward mobility, with little to no chance of keeping up with inflation, and it’s so incredibly stressful. So much unpaid labor is required to stay afloat…& it’s not getting any better. What other job requires HOURS of unpaid labor to plan lessons for a substitute that may or may not even show up?! \n\nI also believe that it’s impossible to be a good teacher AND a good parent. (My students who often struggled the most were often teacher’s kids, & I don’t believe this was a coincidence.) It felt like you had to pick one; either you’re a good teacher who neglects her own children or you’re a bad teacher in order to be a present parent. I’m not going to be okay with either of those two choices, ever. \n\nI miss my students. I miss witnessing and guiding their development every year. But that’s about it. For nearly 15 years, I sacrificed my sanity, my physical health…& for what? To essentially raise OTHER PEOPLE’s children? Not anymore.\n\nIn the end, even if we end up childless-not-by-choice, I will never regret my decision to retire from teaching, because I know that I have tried by absolute best on this infertility journey, including ridding myself of the enormous stress that teaching provides. Perhaps one day I’ll return to the teaching trenches, but at this point, I rather just find something easy that pays the same sad salary (like working at Target!).\n\nI acknowledge that leaving the classroom to focus exclusively on IVF is an enormous privilege that not many can afford. I’m grateful for the opportunity & wish that it was possible for everyone.", "I’m 2 years into this process and a high school teacher. If I could leave, I would. Last year I used all my sick time almost right away for IVF. Then lost my baby at 5 months pregnant and went on disability leave for a month in the spring. \n\nIn an attempt to stay sane, I do only what I have to do at work. I never work beyond my contract hours. I lay down on the floor for any prep time and breaks. I plan my days knowing I may feel emotionally and physically bad at any time. Even with that, I feel anxious all the time. I feel like the students and staff are judging me for not doing enough. Probably no one even cares, but that’s how I feel. If I could take more time off, I would 😔", "I did a couple of rounds of IVF. The first round I did during school and was unsuccessful. My school was not supportive. When I took time off to go to doctor appointments, they always made me feel bad about it. I also had to carry a lot of heavy things on my own. Even though they knew I was going through IVF, I was given the worst class. The second round of IVF I did was in the summer and was successful. I will try for implantation, but I'm worried that the stress will affect my pregnancy. I have also seen many of my colleagues get hit and kicked too."], "link": "/r/IVF/comments/15wi5yr/quit_teaching_during_ivf/"}, {"title": "2nd FET failed - give up or try again?", "content": "\n\nHi all! I’m posting again because my first post didn’t get any traction and I’m new to Reddit and unsure how this works. But anyway I’m looking for some advice. None of my friends have had to do IVF and just don’t understand.\n\n\nHow do you know you’re done with IVF? Or how do you justify continuing when your exhausted?\n\n\nLong story long, we did two egg retrieval a year ago and ended up with two embryos (we had a 4BB & a 4BC). Then I had surgery this summer to remove a uterine niche that would have interfered with implantation. We transferred the 4BB in November and it failed. Then the 4BC in December, and I was just notified that it also failed. So no more embryos and we’re back to square one. \n\nWe were able to afford this through employer benefit. We originally said that if both FETS failed we were done. However, we have enough left on the employer benefit to do 1 more retrieval BUT any embryo transfers would be out of pocket. We’d likely only do 1 more transfer regardless of how many embryos we get because of finances and emotional warfare.\n\nI’m really torn on what to do. I’m tired of the medications, the affect on my body, the appointments and all of the disappointment. I’m also turning 36 this month so I don’t know how much longer I want to do this to my body. My head logically says it’s time to throw in the towel, but my heart is having a hard time letting go, especially knowing that the average for a successful pregnancy is after 3 transfers (I also know that just an average not a standard and it can take more or never happen). \n\nWe also do have two beautiful children (6 & 3) and we started this process to have a third. Our kids have been asking for a sibling for awhile now and it’s so hard to tell them it’s not going to happen.\n\nI don’t know if it’s worth doing another retrieval just in case we get more embryos only for my heart to be broken again by a failed FET or for my heart to be broken by not getting embryos at all. I’m also not sure I’m ready to close this chapter. I’ll take any advice or perspective. I’m still grieving so I don’t really trust my judgement at the moment.\n\nI’ll take any advice, perspective, hope, thoughts, anything.", "num_comments": 16, "score": 4, "top_comments": ["in gonna try to approach this from a practical level:\n\nyou can afford it, you’re only 36, you’ve only had two transfers (you said it yourself, 3 is avg for success) and if you’d had enough, you wouldn’t be asking.\ngive it another go; you might regret it if you don’t, and even if it doesn’t work, would you regret trying? probably not", "Hey there, I'm in a similar situation in terms of background - have two kids (6 and 4) and have also had surgery to repair a uterine niche (c-section scar defect). I haven't gotten to transfer yet, I've had four cancelled due to fluid that was likely caused by the niche. But my monitoring appointment in late December showed no fluid so we're hopeful the surgery was successful. FET will hopefully happen this upcoming cycle. \n\nHowever, we have slightly different circumstances as we do still have embryos banked after two ERs. We agreed that if we go through all the embryos we have without success we're done, but that would mean more transfers than is statistically expected. I think if I was in your place I would want to transfer at least three euploids before giving up, as I would see being on the other side of a 95% success statistic as a sign that my body just couldn't do it again. But it is also valid to say you can't handle another ER (I am so grateful we only needed two, I don't think I could have done another) and you're ok with your family being complete. It doesn't really sound like that though, and I suspect you would regret it just as much as we would if you gave up now.\n\nBest of luck to you, I hope it all works out regardless of what you decide ❤️"], "link": "/r/IVF/comments/18ztizb/2nd_fet_failed_give_up_or_try_again/"}, {"title": "First ER was a bust", "content": "I had my first retrieval yesterday. I knew I'd have lower numbers due to bilateral endometriomas, but I had nine follicles that were big enough to retrieve and they got all nine eggs. I was feeling good yesterday. But only one of them fertilized, and I know how often they stop developing so I'm feeling defeated. We really don't realistically have funds for another cycle (maybe could scrape it together on credit cards - but then how to pay those, you know?). We were going to do a fresh but now are recommended to do frozen if we get to that point (they had to go through the endometriomas), and obviously recommended to do more retrievals.\n\nWe're 5 years into ttc with our only positive (from spontaneous conception) resulting in loss at 16 weeks. I know we could keep going and bank embryos, but finances are our limiting factor. Part of me feels like it's just not going to happen for us because of money and I am devastated.\n\nAny words of support would be appreciated.", "num_comments": 15, "score": 11, "top_comments": ["[deleted]"], "link": "/r/IVF/comments/1bkzkin/first_er_was_a_bust/"}, {"title": "Winfertility and denied claims", "content": "Does anyone on here use Winfertility and get denied claims over and over again?\n\nI’m trying to find the culprit and everyone is pointing fingers at everyone else. \n\nI’ve looked at posts on here and everyone speaks wonders of winfertility. I just don’t seem to be getting the same experience. \n\n\nMy first egg retrieval was submitted incorrectly by my fertility clinic as they only selected IVF when there was clearly and option for IVF, ICSI and Assisted Hatching. Luckily I had a previously approved pre authorization for another clinic I was interviewing and they said they can fix it. This was back in April and the claim stands denied. \n\nSecond egg retrieval approved with a new pre authorization just fine. No denials. Same exact procedure. \n\nTransfer is now denied due to lack of labs and it says my clinic didn’t get a pre authorization, which I have the confirmation that it was approved. \n\nI’ve reached out to Winfertility who points the finger at my clinic. \n\nI call my clinic, the finance lady is never polite nor respectful and blatantly blames Winfertility. \n\nI’ve called empire BCBS and they just always tell me they are waiting on more information from the clinic but won’t provide me with more information because it’s “information I wouldn’t have”. \n\nI’m so frustrated. I can’t get clear info. I’m about to sit in my clinics finance office for a day and call everyone on their shit. \n\nHelp. If you have any guidance, personal experiences with any of these groups or even like a reporting agency to threaten these people with I’d appreciate it.", "num_comments": 2, "score": 1, "top_comments": ["Yes!!! This happened to me 1928382929 times; there is a form your clinic needs to submit to WIN, then WIN can back date your approvals after they call you a month later to ask if you need counseling for a thing you’ve already done.\n\nI just kept calling both sides - but found the problem was on my clinic for the original paperwork. Even now only my first egg retrieval is correct and I just keep throwing away $30K bills from my clinic until it’s sorted. ANNOYING HOW THEY MAKE THIS ALL SO MUCH HARDER"], "link": "/r/IVF/comments/16menmb/winfertility_and_denied_claims/"}, {"title": "Good prices for IVF in US", "content": "I just wanted to share some ideas for people who are in the “shopping around” stage. I thought anyone in the US who felt they got a reasonable deal could share. Please don’t put what your price was AFTER insurance covered. It’s not really helpful as the majority have no insurance for ivf.\n\nIn 2016:\n\n**University Of VT Medical Center:** $6995 for everything. **Included meds**, transfer, and monitoring. My meds even had to be upped and they had me come in and gave me the extra meds, free. Sperm vials were only $250. They did not do PGS testing, but would ship it if you wanted it.\n\nNow:\n\n**CNY**: $5000. ICSI, monitoring, transfer, and a year of storage included. Meds and all other extras not included. Offered reasonable FETs and PGS also.  3 places in NY, one in GA, one in CO. Financing with no credit check and 200% acceptance. $250 for every 6 months of financing.", "num_comments": 34, "score": 30, "top_comments": ["[deleted]", "Are you doing your monitoring thru CNY? I'm curious how much it usually costs if you're traveling to CNY and have to do monitoring at a home clinic? Also, if you're traveling was it easy to get your home clinic on board with monitoring? Basically curious how all that works."], "link": "/r/IVF/comments/r3m4s4/good_prices_for_ivf_in_us/"}, {"title": "Poma vs SRM", "content": "Hi all, we(35F and 37F) had our first ivf consults with poma and SRM. Need some info/insights into the experience you all had. I happen to have insurance coverage but there is a lifetime max limit. I want to know how much was on average the cost of the ivf cycle. \nI have a history of pcos and have AMH levels of 4.01 - we are going for an antagonist protocol with lupron trigger shot. \nVery new to this group and making the first post here. Appreciate any detail. Thank you all. ", "num_comments": 6, "score": 1, "top_comments": ["You should plan for about $20,000-$25,000. \n\nIVF Meds - $5000\nEgg retrieval - $12,000\nAnesthesia - $1,450\nICSI (optional) - $1,500\nPGT testing (highly recommended) $5000\nIf you’re using doner sperm $500-$1000."], "link": "/r/IVF/comments/1b7rc5j/poma_vs_srm/"}, {"title": "IVF Drug Discount Programs?", "content": "Starting IVF soon. Insurance will cover treatment and diagnostics but not most injectable meds. Does anyone know of a discount program for low income families? Not a grant or financing program as we don't have good credit and I'm sick of paying grant application fees to only get nothing in return.", "num_comments": 3, "score": 3, "top_comments": ["Your clinic will likely have relationships with the pharmacies they recommend. Reach out to the financial coordinate / billing department!"], "link": "/r/IVF/comments/175haox/ivf_drug_discount_programs/"}, {"title": "Another failed FET…I’m broken", "content": "This morning our 3rd FET has also failed… I’m so broken and so sad and honestly having very dark thoughts. \n\nI’m not sure what else to do? We are in the uk so we don’t have as many tests offered as I see here but what shall I ask for our next try?\n\nThis time we tried Lupron for a month then transfer - i was taking lubion + pessaries and estrogen. All of the embryos transferred were untested high grades. I have endometriosis (even if my uk doctor does not believe me…) but that is the only issue for us we believe. We always transferred one at a time but maybe next time I will ask for two but I’ve seen it doesn’t often help. \n\nIt’s going to mark 7 years we are trying next month..im devastated. I feel like a shell of myself.", "num_comments": 19, "score": 18, "top_comments": ["I know no words will make it better. But I'm so sorry. Are you seeing a counselor? They can try to give you tools to use, when you are feeling particularly shitty.\n\nIt is such an emotional rollercoaster and the drugs don't help at all. \n\nWould you consider another clinic? \n\nI'm going through my second failed fresh transfer, we did one embryo first time and two the second time. I had to shut off from the world for a few days, only trying to come back into reality. For me this meant having a routine of taking daily showers and drinking 3L of water a day. It doesn't seem like anything but to me, if I achieved both it was a successful day.\n\nThinking of you 💚", "Just wanted to add a note to say I see you and I am feeling similarly. I’m in the process of either a chemical or ectopic with my second transfer and I am feeling very, very defeated and broken. I’m so sorry you have experienced this a third time. None of it is fair or makes sense, and this shouldn’t be happening to you."], "link": "/r/IVF/comments/17ux0pd/another_failed_fetim_broken/"}, {"title": "Embryo or just eggs donation", "content": "So mine is a very nuisance like case. 43 f, 45 husband. We are not living together for almost a year even married only 16 months. He refused sex altogether and I was forced into ivf. \nNot that my age will bring natural pregnancy easily but point is we didn’t even try.  He doesn’t have a job or money so it’s all my finances for the ivf. His sperm is good but my Amh is super low. \n\nAfter an year of unsuccessful efforts and all clinics asking me to go for donor eggs I’m starting to read about it too. \n\nI have a hard time using his sperm and donor egg. Last time he refused to sign for donor aperm. Divorce takes forever in India if he refuses to sign consent for donor embryo. \n\nI keep thinking of reconciling with him but these thoughts stop me. \nI don’t know what I am seeking but maybe a rant or asking your thoughts about this.", "num_comments": 24, "score": 9, "top_comments": ["Why are you trying to have a child with this person that has no job or money, doesn't live with you and doesn't want to have sex with you? Why are you even staying married to him? And yes, I'm half Indian, and I understand the Indian cultural pressure to be married, but this is ridiculous.\n\nReconciling with him is a bad idea. Don't waste your life on this person.", "If you just want to have children regardless of this guy..then embroy adoption.. otherwise, unfortunately, you are better off waiting to see where this marriage goes. You can also look into adoption in future. I am not sure I difficult & lengthy adoption is in India", "Please seek professional help for counseling, for yourself. You sound desperate for a kid that you are not paying attention to all the problems with your partner . First , you need to be mentally strong to recognize the issues and fix those first . Then go for IVF treatment with a donor. Your marriage has nothing left to offer . First get yourself out of this toxic marriage before bringing a child to this world. You won't be able to raise a kid like this . Also IVF treatment is very stressful and you need to eliminate extra unnecessary burden from your life , especially someone like your husband. Think thoroughly before you proceed . Best of luck ."], "link": "/r/IVF/comments/191gefp/embryo_or_just_eggs_donation/"}, {"title": "How many IVF Rounds are standard?", "content": "I’m 24. I am starting my first round this month. I know I may seem young to be doing this, but my mom had about 6 miscarriages before she had me and I was pregnant last August and miscarried. How many rounds do people normally do before they get a positive test? I’m so nervous and just scared about losing the baby again.", "num_comments": 9, "score": 1, "top_comments": ["Its different for everyone as there are different factors like age, your infertility diagnosis. I started my fertility treatments right before i turned 23. Praying for you🙏🏻"], "link": "/r/IVF/comments/1almo7v/how_many_ivf_rounds_are_standard/"}, {"title": "IVF in Mexico", "content": "First, I want to say I am not benefiting in any way by sharing this. No referral discounts or anything like that. I just want to share information about IVF in Mexico for those who have a hard time affording it here in the U.S\n\nThe clinic I go to is now offering financing, sounds silly since I just mentioned it's cheaper in Mexico lol. They are hosting an online event to talk over that and other info about IVF there. It's online and free to attend you just have to register\n\n\nhttps://www.eventbrite.com/x/how-much-does-it-cost-to-go-through-egg-freezing-or-ivf-in-mexico-tickets-851046291367?utm_source=eventbrite&utm_medium=email&utm_campaign=reminder_attendees_48hour_email&utm_term=cta&ref=eemaileventremind", "num_comments": 2, "score": 6, "top_comments": ["Can you give the TLDR version of how much it cost you for a cycle?"], "link": "/r/IVF/comments/1bi0924/ivf_in_mexico/"}, {"title": "Help with Medica insurance from the University of Minnesota for IVF", "content": "I'm looking for anyone who has gone through IVF as an employee with the University of Minnesota using the Medica Elect/Essential plan. Or for someone who understands insurance gobbledegook! \n\nMy plan says for fertility treatments that it covers \"80% to an annual maximum of $5,000.\" That sounds to me like anything costing over $5,000 will be out of pocket. I just don't know what Medica defines as a \"fertility treatment\" and what dollar amount is part of that $5,000 (the amount charged, the allowed amount, the coinsurance, my copay, etc??).  \n\n\nHas anyone lived through IVF with this particular insurance plan and could tell me about your experience? I've called my insurance but struggle to get good, clear answers I can trust. I have even been given conflicting answers! I have a long, itemized list of procedures and costs from the clinic, but I don't know what Medica will deem a \"fertility treatment\" vs. just a regular medical item (like ultrasounds and bloodwork). It's making estimating my financing needs a bit of a nightmare.", "num_comments": 20, "score": 2, "top_comments": ["Are you in the Minnesota Infertility group on Facebook? Someone there may know"], "link": "/r/IVF/comments/1adfy4g/help_with_medica_insurance_from_the_university_of/"}, {"title": "ARC fertility bundling question ", "content": "Our clinic uses ARC fertility for financing. We planned to just pay in cash directly to the clinic but we saw that ARC offers 2 or 3 cycle bundles that would be much cheaper than paying for 2-3 cycles individually. My question is - can I use the bundle to do back to back retrievals or do I have to transfer all embryos from the first cycle before I’m able to do another cycle? \n\nMy thought process is to just buy a bundle, pay it off immediately with no interest, and bank a bunch of embryos at a much lower cost than completing multiple individual cycles. \n\nAlso, if you have any other experience or insight with ARC that you can pass along let me know! It almost seems too good to be true… ", "num_comments": 3, "score": 1, "top_comments": ["I am also struggling to make this decision also with ARC fertility but my fear is doing the bundle for 3 retrievals-/if one or two retrievals don’t work (I have a genetic thing I’m trying to avoid passing along), am I even going to want to do a third? I’ll lose out on money if I don’t buy what if it’s too much on my body 😞 I haven’t received any sort of actual estimate from the clinic now that I think about it but I’m sure it’s much more"], "link": "/r/IVF/comments/1b54guq/arc_fertility_bundling_question/"}, {"title": "Anyone have success on second or third try?", "content": "I just had my first failed FET and I want to know if there’s any hope of this ever working (I had four failed IUIs before this too), so I just feel like my body can’t get pregnant. I know it’s just my anxiety but looking for some hope that it COULD still happen.", "num_comments": 12, "score": 2, "top_comments": ["It took me 3 PGT embryos. I am 39 weeks tomorrow from my 3rd transfer", "Definitely possible. Success doesn’t often happen on the first try. Did you pGT test your embryos ? And what is your age? Those are the real factors that influence success."], "link": "/r/IVF/comments/18x9csv/anyone_have_success_on_second_or_third_try/"}, {"title": "Pay as you go- cost estimates?", "content": "Hi, I am exploring whether or not to pay as I go or if I want to finance. I am curious if anyone can share the cost of the following: embryo transfer and PGTa testing? I recognize these are usually done by different providers and that there is going to be variation. Just looking for a ballpark. \n\nAlso, does anyone feel strongly about their own pay as you go experience? Insights welcome! \n\nI have low AMH and am 37.5. Doing IVF.", "num_comments": 7, "score": 1, "top_comments": ["Transfer: $4-$6k\n\nPgt-a\nBiopsy - $1200 (per retreival)\n\nTesting $2800 (per batch that’s tested.. could be per retreival but may not be.. very clinic dependent)\n\nPpl often go the 0% apr credit card route"], "link": "/r/IVF/comments/154s7mo/pay_as_you_go_cost_estimates/"}, {"title": "Any good recommendations for IVF Fertility Clinics? Is my experience with ours normal or common??", "content": "My husband and I live in Nevada, and so far we were going to the fertility center of Las Vegas....the doctor was incredible, however the staff there were just such assholes about getting me an appointment. We felt like we had to keep chasing them down, constantly beg them for an appointment - come to find out they were refusing because my husband had a balance of $6.90...lol we paid that and told them to kick rocks...(wasn't going to keep begging to be seen only to be left on read)...\n\n&#x200B;\n\nWe now found another fertility clinic in Las Vegas, where the doctor is said to be the \"best,\" and I had such a positive experience at the clinic, with the doctor, but the nurse who is going to remove my polyps didn't give me the time of day (I give her the benefit of the doubt because I assume she's busy), but the finance lady was just a bitch on wheels....she accidentally left me a voicemail after I left stating a patient's full name and last name and saying \"Oh GOD She's getting on my last fucking nerve.\" And when I called to ask her if I should do my due diligence about my PCOS or if the doctor has me covered, she immediately  became defensive and told me I shouldn't 'money pit' into IUI and need to stop extending IVF (which we were not doing, nor was it the question I asked). After reassuring HER over the phone, I hung up feeling so icky that there was no sense of compassion or calmness in that call....I should be getting reassured, not doing the reassuring, lol Imo anyway...\n\n&#x200B;\n\nI still love the doctor at that clinic, but I worry about how everything will progress with the nurse and finance lady... I guess my question is, were there minor problems with the clinic of your choice? Was it an overall smooth ride?\n\n&#x200B;\n\nIs there anyone in the Nevada or surrounding state areas that had a clinic experience that was astounding? If so, please share. My husband and I are desperately seeking other clinics so that we can keep this process moving, but there's a part of me that just wants to settle with the clinic we're with now just so as to not waste any more time than we have on our emotions n such. \n\n&#x200B;\n\nFwiw, my husband has a blockage so he will need a TESE procedure, and I have polyps which will need to be removed and I think I may have PCOS. He's 51 and I'm 32.\n\n&#x200B;\n\nTl;dr: desperately need clinic recommendations, and maybe some input on how smoothly the process went with the clinic of your choice! Just want to make sure my husband and I are not making choices due to us rushing and wanting to start our family! :) \n\n&#x200B;\n\nTHANK YOU SO MUCH <3", "num_comments": 4, "score": 4, "top_comments": ["Ugh I'm sorry that really stinks!\n\nI'm using a smaller clinic that's not part of a chain and I haven't had any experiences like that at all. Never a problem to get an appointment and everyone has been super nice."], "link": "/r/IVF/comments/1awi2f6/any_good_recommendations_for_ivf_fertility/"}, {"title": "Midwest doctors", "content": "When all the way to California to have my final fet canceled last week. Unsure if my dh and I want to pay for a second trip. We can but would make finances uncomfortable for a couple of years! Any recommendations on doctors with great SART scoring in Midwest?", "num_comments": 4, "score": 1, "top_comments": ["I go to Cleveland Clinic and love all the drs, nurses, and staff. Cannot recommend them enough!"], "link": "/r/IVF/comments/15r467n/midwest_doctors/"}, {"title": "It’s over", "content": "I had one shot at IVF due to finances. I’m bloated and in pain from my retrieval but I was feeling positive because we were able to get 12 eggs. I got a call from my doctor that nothing fertilized. We were using a sperm donor so the problem has to be my eggs. She said the eggs were disintegrating. She offered more options but I can’t afford any of them, and even if I could, if my eggs are this poor would I even have a chance? I’m trying to convince myself I don’t need children. I’m so heartbroken that all this time I had hope and it ended like this. And the side effects of the retrieval are a further slap in the face because I am in pain for nothing. I’m heartbroken. I hope the rest of you have a better time with your journeys.\n\nUpdate, and I don’t know if it’s positive or negative: I found out they did a day 1 ICSI on one of my eggs and it did in fact fertilize, but I was told the chance of it making it to blastocyst are slim. They also said 6 to 8 of the eggs degenerated which isn’t normal. The glimmer of hope I got is what one commenter said, that this is a “practice” run. I want to thank everyone for your support and I’ll see if my doctor can recommend a way to make this more affordable, but for now I just have to pray that my one embryo defies the odds ", "num_comments": 54, "score": 85, "top_comments": ["We also only have one shot due to finances. It makes me furious that this isn’t something that is covered for everyone. I’m sorry, the grief and loss through this process is astounding. Let me know if you want tips for coping with ER, or a review of financial options. But you are probably already familiar.", "Sending a virtual hug 🤗 Maybe you could find a job that offers fertility benefits if you aren’t really ready to give up. Also, I am not sure where you are located, some people talk on this sub talk about a less expensive clinic called CNY I think.", "I'm so sorry you are dealing with this 😔 my first round was also pretty much a complete fail with one blast that did not implant. I pay out of pocket so I figured that was it.. but I found CNY which is much more affordable, even with travel costs for me and donor eggs (I gave up on my own after the first round mainly because of my age and this being my last chance financially). It is a third of the cost that I paid locally. \n\nSending you big hugs ❤️", "I’m so sorry you are going through this. And it’s a bitch that finances are the reason. If you ever want to or are able to I’ve heard people have gone and gotten part time jobs at places like Starbucks which offers IVF benefits after three months of work (assuming you work 20 hours a week). It’s not ideal but just thought I’d throw that out. \n\nBest of luck and warm hugs and well wishes for whatever your journey brings you ❤️❤️❤️", "Are you in the US? If so there are some reasonable ways to get insurance for additional IVF cycles.", "I’m so sorry and can completely relate to the financial barrier! If you do eventually decide to try again, check out Aimee Raupp and all her amazing resources including her egg quality diet. It was a game changer for me. Also, I eventually figured out it was cheaper to get my meds with GoodRx than it was via my insurance! I wish more clinics were better at mentioning this as it can literally save you hundreds if not thousands.\n\nAnd if you don’t decide to try again I would completely understand and wish you peace and happiness!! ❤️", "Hi there! Thought I would comment because I had a similar result of degenerating eggs with all 3 of my retrievals!  I could not find anyone similar.\n\nSome of my eggs always came out degenerated in my retrievals, but not all.  I was also told not to be hopeful. HOWEVER, the ones that they were able to fertilize had a good fertilization rate and blastocyst rate. Most of my blasts ended up being top quality and I also had euploids. My first FET took, but I miscarried because of issues in my uterus that had not been diagnosed. I have since fixed those issues and had a second FET recently that took. Currently 6 weeks 3 days. Saw the heartbeat at our last scan.\n\nI don't know your age or AMH level. For me.. I was 38 at retrievals with an AMH around 5 and FSH also around 5/6. My numbers looked picture perfect and I had a lot of eggs.\n\nAfter THREE retrievals it is my personal opinion that degeneration happens due to over exposure to meds and eggs growing too fast and too big. For example in my retrievals, my eggs always grew crazy fast and all over the place in size and some would end up in the mid 20smm. My doctor kept having to reduce the dose EVERY SINGLE time. Whereas in a regular cycle (i did IUIs and just had a natural transfer cycle), my normal egg size is only 18mm. I am of the opinion, that these large 25mm eggs they are getting from me are the degenerated ones and the ones that they get that are good are the ones in the 18mm range. Although there is no way to tell what eggs came from which size sac, it works out that way when you look at the numbers for me in terms of how things were measuring.\n\nThe is all just my theory. You can't just take a person with naturally low hormone levels (non elevated FSH), a lot of eggs, and eggs that grow to 18mm naturally.. and then start pumping them with loads of drugs and make their eggs grow huge.\n\nI hope you can do another cycle. And please take my experience into account.  Doctors are so used to people that don't respond to meds.. they don't often consider the fact that some people are OVER responding.\n\nDon't take this to mean your eggs are sh\\*t. I did at first and then was pleasantly surprised after that they became good blasts. Doctors are just really \"stumped\" on egg degeneration and don't know why it happens."], "link": "/r/IVF/comments/17xz6qa/its_over/"}, {"title": "If you could ask anything…", "content": "I have a consultation with my doctor this afternoon, and we’re about to start another retrieval cycle (possibly our last, depending on finances).  I want to ask him what we can do differently this next time, and a couple other follow up questions. But I feel like there are probably some key questions I should ask at this point, and I don’t want to waste this opportunity (it’s not easy to get time with him). \n\nI’m 44 yrs old and our last cycle resulted in 3 fertilized, 1 made it to blastocyst but was aneuploid.  We know my uterus looks good, it’s an issue of egg quality.  What would you ask? What questions have you found helpful to discuss?\n\nThanks!", "num_comments": 9, "score": 3, "top_comments": ["I think a realistic discussion on what are truly the odds that this will work is super beneficial, to manage expectations."], "link": "/r/IVF/comments/18dng8a/if_you_could_ask_anything/"}, {"title": "ER yesterday ", "content": "I had my first egg retrieval yesterday and had 22 eggs. 17 were mature and 12 show signs of normal fertilization. The embryologist says they hope 50% of these 12 will make it to blasts but we will be updated and days 5 through 7. \n\nMaybe I am not sure how this works/what to expect, but am feeling sad at how much the numbers have already gone down and worried I wont have any or maybe only 1 blastocyst. My husband says its good if we have 6 but we do not have the history of the good normal for medical especially with babies. With 11 years of trying, 3 pregnancy losses, 2 MC , and one ectopic. On top of that we had years of unexplained infertility and I was just dx with endometriosis and PCOS. \n\nJust looking for support and also encouraging words or to know if we will need another round, which we can’t do right away withh finances and upcoming travel for my brother’s graduation. ", "num_comments": 5, "score": 6, "top_comments": ["I think doctors need to do a better job at the outset preparing people for the attrition- most will lose 70-80% from start to finish. \nMy numbers were so similar- 23 retrieved, 22 mature, 13 fertilized, 6 at the end of day 5. Then 5 of the 6 were normal after PGT-A. My doctor was really pleased with our numbers, but I was pretty anxious before the testing phase as he anticipated we would lose another 2-3. \nValid that you’re anxious but it does sound like you’re on a normal trajectory! Hang in there!"], "link": "/r/IVF/comments/1bq1ac1/er_yesterday/"}, {"title": "Billing issues rant", "content": "Did any of you get to the retrieval but unfortunately had no 5 day embryos? Mine did not make it to the biopsy stage but they still charged Aetna for the biopsy, freezing and storage. Aetna denied, I knew they would, and they applied my self pay fee to my invioice which added to my confusion.Trying to work this out with billing right now but wondering if it’s common practice? Am I missing something should they still have been able to bill those procedure? Gearing up for round 2 and with Aetna’s policy of not covering if you have any on ice hoping this happens and it won’t cause a delay. Billing and insurance is seriously a full time job", "num_comments": 3, "score": 2, "top_comments": ["My old clinic charged me in advance for biopsy and cryo, when I had no embroys I called every day until I got that refund and demanded to speak to the head of billing every time."], "link": "/r/IVF/comments/1aegnts/billing_issues_rant/"}, {"title": "To PGS test or not", "content": "Ugh! My husband and I are stuck on if we want to PGS test our embryos. To be fair my retrieval is wed so I'm not sure how much we will have to begin with. \nWE are MFI only and using a sperm donor, I'm 34 with no known problems. \nThis is our first try at IVF but we are close to maxing out our finances and everything I read seems to be split on which way to go. \nDoes anyone have an opinion on which way to go?", "num_comments": 75, "score": 11, "top_comments": ["When you read about PGT, look for findings about the efficiency of transfers and rate of miscarriages. If you only consider the rate of live birth then you may be discounting failed transfers or miscarriages that PGT might have helped prevent. Compare your clinic's cost of transfer against the cost of PGT.", "I was 34 at my retrieval and 5/15 of the embryos I tested were abnormal - and that was actually a little better than expected for my age. Three had the chromosomal abnormality that is the most common cause of miscarriages, one may actually have survived (turners syndrome) and one was an alphabet soup of extra chromosomes and was clearly never going to make it. So it seemed worth it to me not to waste time/drugs/energy on embryos that aren't viable.", "We opted not to test, for the following reasons: PGT-A testing does not improve live birth rates for most women, testing can damage the embryo (how do you know the cells removed for biopsy are not necessary for progression of the embryo?), false positives, the ever-emerging research that shows that embryos can self-correct in utero (as our bodies do everyday), and the fact that testing 5 cells of the trophectoderm does not provide the ploidy status whatsoever for the entire embryo. If you scroll through this subreddit, it seems like every other day there is a post on a failed FET with a tested embryo; that coupled with the lack of research supporting the use of PGT-A testing to improve outcomes helps me to know we made the right decision.", "MFI was our diagnosis and we chose to test the embryos. Reason being I wanted to avoid any possible heartbreak with loss. Can you still experience loss with a normal embryo? Yes. There are also some risks with damaging the embryo when they biopsy it. However, these risks are small compared to transferring an abnormal embryo and experiencing a loss or abnormality with the baby. To us, the extra money was worth it.", "We would never. A PGS tested embryo can still fail to implant or result in miscarriage. Also embryos can self correct... The science does not seem quite there yet. Also I don't believe manipulating an embryo that tiny could be good. I personally would never feel comfortable potentially discarding embryos that could result in a healthy baby.", "After spending a lot of time on this sub, it seems it comes down to perspective. Some of us like to throw money at our problems and some would rather shoulder through it (I'm the former). When I got married, we paid way too much for our catering but I didn't have to think of a single food or drink related thing all night. Some people would rather save $5k and yeah maybe they have to send their dad out for a beer run or find serving staff on Craigslist but it's worth it for them.\n\nThat's basically how this breaks down. Some people are okay with spending more up front and maybe losing some embryos that may have worked if it means a surer shot or at least more clarity if the transfer fails. Others are better at dealing with the unknown and having miscarriages or transfers not working and they have to spend more to figure out why is worth the chance that an embryo just does its thing and maybe you won't have to do another retrieval.\n\nSome people think testing is a con. I think that's a sad way to look at it. Finding out you can't or aren't likely to conceive on your own fucking sucks and the icing on the cake is that you have to spend a pile of money only to have your heart broken, even if things go relatively well for you. Wanting to use science to lessen that burden isn't a con. Some people think full service catering at a wedding is a con but I got to dance with my loved ones all night (the only thing I wanted for my wedding) so I think I came out ahead. It's all about your personal cost-benefit analysis.", "We did PGT-A (PGS) and it was worth every penny.  We had6 viable embryos but only two passed PGT-A (PGS).  The other 4 would have likely miscarried.  That $2,000 saved us several miscarriages and associated expenses with implanting those eggs.  We are now 12 weeks pregnant and I don’t regret it at all."], "link": "/r/IVF/comments/owjwnp/to_pgs_test_or_not/"}, {"title": "Loan for IVF? Help", "content": "Has anyone ever had to take out a loan to help assist with IVF cost? If so how did it go? Where did you get the loan from? \n\nMe and my wife are thinking about taking out a personal loan to assist in the finances. We are doing a shared risk situation and will probably cost around 30k we have about 75% of that in savings but wanted to take a loan out for the additional.", "num_comments": 9, "score": 2, "top_comments": ["We did the Lightstream loan through Suntrust. It was super easy to apply online and we got the money SO FAST. Good luck!", "we had to apply for 18 months interest free credit card"], "link": "/r/IVF/comments/159bd9m/loan_for_ivf_help/"}, {"title": "Advice on when to move on... 40F, four ERs, zero euploids", "content": "I know that no one but me can answer this question but looking for other's perspectives and feedback.\n\nI did three rounds of IVF at one clinic at 39.  Three retrievals, three fresh transfers, two failed, one chemical.  Between the three retrievals, there were also five embryos that made it to biopsy and freezing.  No euploids. All aneuploid except one is only segmental.  First two rounds med protocol was gonal F/Menopur/cetrotide.  Third round was lupron flare protocol.  Dr believes the fresh transfers failed due to chromosomal issues, but of course we'll never know.\n\nI took a few months break over the summer, switched clinics and turned 40.  Decided against fresh transfers after three failures.  Protocol was Letrozole, Gonal F, Menopur, Cetrotide. \n\nJust got my PGT-A results back.  Five embryos, no euploids.  Four are aneuploid and one high level complex mosaic.  Clinic says none, including the mosaic. are suitable for transfer.  \n\nThis feels like a huge blow.  We had more eggs and more blasts than any other round.  I really thought one out of five would come back euploid.  \n\nI'm definitely going to do one more round, but feel like I have to start thinking about when I would move on.  I know donor eggs are an option but don't know yet if thats for me.  I could see myself doing many more retrievals hoping for euploids, but each time is harder and harder emotionally.  It just feels so defeating - I know you want 2 euploids for one live birth, and I still have zero this far into the process.\n\nIf you were in a similar situation, at what point did you decide to move on?  Or have others had 4+ rounds (or 10 tested embryos) with no euploids and had success in a future round?  Any thoughts or experiences would be greatly appreciated.", "num_comments": 18, "score": 10, "top_comments": ["Hi there! Just wanted to add some more solidarity here. I’m 41, and I finally got 5 blasts (all abnormal) and then 3 blasts (all abnormal). I’m heading into another ER today. I’ve seen people on Reddit and other forums who finally got a euploid in their 4th or 5th round, after testing 10 or more blastocysts, which gives me hope that it’s just a numbers game (and I’m working with a below-average normal percentage). \n\nFor me, I’m trying to view this whole process as an expensive hobby and not base too much of my happiness on it. Anything I can do to take the mental and emotional pressure off has been helpful. It’s so, so hard. Just know that there are others in a similar position with you. I wish you all the best with your next steps!", "Did you consider using Omnitrope ?"], "link": "/r/IVF/comments/16mdp5a/advice_on_when_to_move_on_40f_four_ers_zero/"}, {"title": "Would you delay?", "content": "I was supposed to have a baseline appointment today for day 2 full flow. I recently switched clinics for IVF round three. My past two cycles with the last clinic, I started stims on day 2. New clinic calls me yesterday that my insurance never cleared finance so they won't see me until it does. I said that's not possible as insurance just approved and paid their portion of meds etc. Also how did we get this far, I had been seeing the doctor and creating the plan for months (it isn't because it's a new year, my insurance never changed). Either way, they said come in Monday and they will baseline me and hope that their Finance department has everything sorted.\n\nI feel very uneasy starting stims days later than my last cycles (day 5 vs day 2). The medication is so expensive to not do it by the book. I am not a doctor so maybe it is totally normal but they also commented that if there is a dominant follicle already growing that it would gobble up all the meds.\n\nI feel like I should wait a month and I just cried all day thinking about it. I am 40yo with very low amh (.35). Thoughts?", "num_comments": 3, "score": 2, "top_comments": ["Come in Monday and talk to finance before you have your appt. Then you can decide then 💜"], "link": "/r/IVF/comments/114dsl8/would_you_delay/"}, {"title": "Used up all my IVF benefits - what’s next?", "content": "We have gone through 4 cycles and only produced one good embryo. \n\nThat’s all my insurance will cover. \n\nWe decided we will go with donor eggs and I have issues with my egg quality and I’m also turning 39 soon. \n\nAre there any financing options that worked for you? \n\nI was told donor eggs cycle can range from 30k to 60k in total so having a 0% APR credit card is not possible to cover the cost. \n\nI’m looking at financing but not sure what’s the recommended one. \n\nAny recommendations? Thanks!", "num_comments": 2, "score": 2, "top_comments": ["I don’t have recommendations on the financing but I recently changed jobs to get access to additional fertility benefits. If you do, look for a company that has Progyny as they allow donor eggs in exchange for a cycle. Not sure if Maven or Carrot do that but they may as well. \n\nI do think there are some fertility focused personal loans and I’d ask your clinic about those."], "link": "/r/IVF/comments/xuw49l/used_up_all_my_ivf_benefits_whats_next/"}, {"title": "Acupuncture for FET", "content": "For those that did acupuncture prior to FET, how often did you go beforehand? Do you think it helped? Thank you!", "num_comments": 5, "score": 2, "top_comments": ["My acupuncturist specializes in fertility and does something called “the protocol.” She recommended 5-7 sessions once I started my medicated FET cycle, and then she came to my FET appointment and did acu at the clinic right before and after the transfer."], "link": "/r/IVF/comments/188ows0/acupuncture_for_fet/"}, {"title": "Self pay nyc", "content": "For everyone who was self pay, do you have any recommendations of company’s for pharmacy plans/ ivf programs/financing plans that made the experience a little more bearable financially ?", "num_comments": 6, "score": 2, "top_comments": ["I self paid for my meds and my clinic said to use apthorp on the uws since it was the cheapest. Not sure if they have a payment plan tho. \n\nhttps://apthorprx.com/"], "link": "/r/IVF/comments/119yff2/self_pay_nyc/"}, {"title": "Carriers: how/why did you choose IVF with PGT M? And how long/how expensive was it?", "content": "Spouse and I just found out we are both carriers for an autosomal recessive disorder. Without getting into the weeds, would likely have a 25% chance of having a child with juvenile onset blindness. How did others whose prenatal screen came back positive make their decision and how did it turn out in terms of timeline and finances? Thanks!", "num_comments": 14, "score": 2, "top_comments": ["As my nephew got older he wasn’t getting teeth, so after genetic testing it turned out he has a disorder that affects teeth, hair, and sweat glands. I’m a carrier and we basically decided that IVF would be cheaper than ALL the dental work our possible son would need. Several rounds of kid dentures as he grows, teeth implants, etc etc etc. our first round was roughly $12k out of pocket plus genetic testing which was another $10k. Our second round we have insurance so it’s been basically nothing.\n\nMy timeline is bad because we weren’t in a rush to start trying for kids, but, assume a 6 month process before being ready to try to get pregnant. There is a LOT of waiting, and if you haven’t been trying for a baby already it’s kind of nice to take things slow and feel less pressure/urgency to get pregnant", "Same thing here, if you look at my post history we ended up on the path of making the PGTM probe. I had a lot of good comments on the thread I posted on. I still am not sure 100% if we’ll do IVF or take the chance (we did get pregnant naturally while waiting for the probe, but then recently miscarried). The probe is still not finished and won’t be until march. It is a long wait, but even more grueling to raise a child with a severe genetic disease. You can try to talk to people living with the disease in question to see quality of life etc."], "link": "/r/IVF/comments/10js9a1/carriers_howwhy_did_you_choose_ivf_with_pgt_m_and/"}, {"title": "ADHD & Fertility Journey", "content": "Does anyone have experience with a partner with severely active ADHD and going through the fertility journey? \n\nBoth my husband and I have ADHD (medicated and seeing our own counselors). We are about to start our 3rd round of IVF stim, our first two cycles were difficult and considered \"unsuccessful.\" During the first two rounds, our home experienced separate water damage incidents with alternating unusable kitchen and bathrooms (our home was a construction zone for 15 months). \n\nWe've struggled with family not being supportive of our almost 4 year fertility fertility journey and feeling judged for what we feel is our only current option to build our family. We have discussed that this is likely to be our last fertility process due to my diminished ovarian reserve, endo, PCOS, finances, etc.\n\nDuring all of this, my husband was going through a grueling masters program and we finally got him graduated. For the past two years, he's always looked at jobs and applying to the most random positions (\"I've always wanted to do this...\"). I know his current job isn't a dream job, and I've supported him looking and going for what would help him feel productive and happy to do for 8+ hours each day. \n\nI literally have talked in depth about needing support and to feel like this round is important and finally gets focus, rather than chaos in our life. He then shows me job postings, all random, and thinks uprooting any shred of stability would help us get through this process.\n\nThis is hard enough, but he seems to cope by introducing the thought of changing jobs because it scratches and itch or helps him look for an exciting thread elsewhere. I understand he may feel like a new job would help our finances and prospects, and I've communicated it severely stresses me out to discuss during heavy fertility treatments. I thought we agreed on focusing on one last round, I only have so much time in my fertility process left, give it one last push.\n\nCan anyone help me find grace in these moments as we gear up for another round? I feel selfish for asking him to please focus on us, make it through these next few weeks.", "num_comments": 1, "score": 3, "top_comments": [], "link": "/r/IVF/comments/17jigfe/adhd_fertility_journey/"}, {"title": "Any Success Stories with 3BB Embryos?", "content": "Our 4th egg retrieval (22 eggs, 9 fertilized) yielded 5 testable embryos, only one of which came back euploid. While I am incredibly grateful for this one, I’m not gonna lie, I’m frustrated that we’re back in the “our only chance” scenario yet again. I want to stay positive and hope for the best, but it’s so hard when it’s been nothing but bad news for nearly 3 years. It’s looking like we will be a go for the FET of this embryo in March. It will be our third transfer (1 failed and 1 chemical previously). \n\nOf the 5 tested, the euploid was the lowest graded of the bunch, 3BB. Does anyone have any success stories of transferring a 3BB? Even better if you were older at the time (I’m now 42). \n\nMy mind, my body, my heart (and my finances) can’t take much more. Just hoping to hear some positive stories to help continue to fuel my hope and positivity. So desperately wanting this little embryo to stay strong and go the distance.", "num_comments": 4, "score": 2, "top_comments": ["Im currently 16dpt of a 3BB. I’ve had two betas so far and both were really great 338, and 850 two days later. I got a positive on a home pregnancy test on 5dpt. It’s still super early for me but things are seeming hopeful 🤞🏻"], "link": "/r/IVF/comments/1as1k5e/any_success_stories_with_3bb_embryos/"}, {"title": "IVF disaster first round, why keep going", "content": "I just had the IVF round from hell, stimmed on and off for 63 days until my body decided to grow 4 mature looking follicles & then I ovulated after trigger & before egg retrieval & the so we lost 3 eggs, the dr was able to retrieve one but it was no good. I spent $26k out of pocket for this & I’m equal parts angry and depressed. I don’t know what to do. Of course the dr is telling me to do a round 2, but why tf would I expect round 2 to be any better? Seriously a nightmare. I’m 39, have 9 follicles, normal FSH but low AMH around 0.5. I don’t have time to take a break, but the financial, emotional & mental burden is very real. Anyone been in a similar position? How do people finance this? How do I prevent early ovulation? I took the meds to prevent it. Just feeling hopeless", "num_comments": 22, "score": 12, "top_comments": ["You mentioned stimming on and off, was it always the same protocol? Did you have regular periods between stim cycles? 9 follicles is not bad at all. Maybe ask for a protocol change with duo stim.\n\nEarly ovulation needs to be blocked with meds. I've done it with progesterone pills, and with cetrotide.\n\nAbout the cyst, it depends. I grew an endometrioma during my round 2, which turned out pretty good, so it's not a definitive reason to cancel the ER.", "I had a similar experience and have decided to get a second opinion from a different RE to see if they can recommend a different course of action"], "link": "/r/IVF/comments/13amwoo/ivf_disaster_first_round_why_keep_going/"}, {"title": "Fuck infertility", "content": "First let me acknowledge that I’m going to say some fucked up things here, but these are my honest feelings right now. \n\nFuck infertility. We’ve been trying for 2+ years, unexplained infertility, 4 IUIs, a pretty successful ER, and a failed FET, and now finally I have a clinical diagnosis for endometriosis. I’m on orilissa for that right now before the next FET. I’m just fucking sad right now. \n\nOn top of all this, I’m jealous. My younger brother got married and started a family without much forethought, without regard to finances, and frankly the mental state of his wife. She was already a little on the depressive side before kids, and now with 2 under 2 and barely enough money to survive, she’s making some threats that have made the family question her ability to care for their children.\n\nDon’t get me wrong, I’m praying that she utilizes the help and support being offered (medical and familial… this is all new and developing, so the jury is out on how drastic of measures will be taken). I want the best for her because it will be the best for my brother and their babies. \n\nBut damn it, I’m fucking jealous. My husband and I have our shit together, we’re begging for a baby and can’t have one and it is so painful to hear about another person being able to so easily have children yet takes them for granted, and is incapable of providing proper care. \n\nI just want to know when is my turn. I don’t expect things to be easy, but I will love that baby so fiercely, I will provide for it, nurture it, and protect it. I just want to hold my baby and I feel like that is such a distant dream for us. I’m fucking sad, I’m jealous, and I know this isn’t nice. \n\nWe’ve made it known to my parents that we’d be willing to essentially foster the kids for any time length if things got to that point. I pray for their sake that it doesn’t because babies should be with their mothers to the greatest extent possible. We just want them safe and well cared for. I think that’s more of a break in case of emergency type of plan, but if my parents deem it worth a mention to my brother then it’s probably the right thing (we’re obviously treading lightly). \n\nUghhhhhhhgggggggg FUCK INFERTILITY! Thank you for coming to my ted talk. I hope this message finds you better than me.", "num_comments": 89, "score": 159, "top_comments": ["I hate infertility. My 2 SIL, which are older than me, one with twins and other expecting. And I am here… waiting my turn. The one expecting told me “oh, we tried 2 cycles and it was so easy, we are very good at making babies, hahaha” (and she looked her husband and winked).\n\nThis is my life.", "Sorry you’re going through this. It’s so tough seeing others get there SO easily, especially when you feel like you’re more ready and capable, but then it’s damn near impossible for you. Such bullshit. I feel like we are told this lie that you can just wait to have kids. Focus on your career. Everything will be fine. So and so got pregnant at X age. But in reality it just doesn’t work like that for everyone. I have endo too, which had a major impact on my egg quality, and I never even knew that was one of the issues with endo. How is none of this talked about more?\n\nAnyway just want to commiserate and say fuck infertility. I’m sorry you feel like this right now. I hope your next transfer is the one ❤️ ", "Ur def not alone  in having these thoughts. Every single one of my fds has had one kid already and here I am  wondering what's wrong with me. I do have fds who are still single  ir they just don't want kids however my husband and I are the only married couple left who do want kids and can't seem to get there. Just this week I had to go to the family doctor to check out my throat as I be been coughing over a week now which wasn't getting better. During the checkup I was asked if I still doing fertility treatments since I only really see my fam doc once a year for physicals.  That really made me sad  and it was another reminder of how long it's been since I initially asked for referral  to the specialist", "It seems like the more disfunctional people are, the more fertile they are.\nYou see women eating loads of junk food, heavy drinkers, they have a different partner every week, some even use heavy drugs and still manage to easily get pregnant.", "My sister has two children, the first an accident. She loves her kids, but she doesn't like being a mother. I remember her saying how she disliked breastfeeding, like it made her feel like an on-demand milk bar. She misses her freedom, resents having to put her career on hold and sees only lost opportunities. Meanwhile I have a nice house, plenty of disposible income and can't have kids. It's ironic how we're jealous of each other's problems.", "Oh yes I hear you.  My brother is CFBC but my younger cousin (10y younger than me) got pregnant easily and uses my aunt as a nanny (basically 24/7).  My aunt is basically the child’s parent, and now she is pregnant with #2.  \n\nIt’s so unfair."], "link": "/r/IVF/comments/1aj1m1t/fuck_infertility/"}, {"title": "The IVF Process: Beginning to End", "content": "Background: Mid 30’s couple, middle class, no fallopian tubes (reproductively healthy otherwise).\n\nBeginning: We were told that one of my wife’s fallopian tubes might be operable (doctor was enthusiastically optimistic). Had the surgery to remove and repair tubes. Post surgery, doctor informed me that he had to remove both tubes (I was asked to tell my wife). We were both devastated given the initial positive diagnosis, but we now know the next steps to take.\n\nIVF Route: Consult with doctor post surgery (3 weeks), and discuss the next steps to take. We move forward with IVF — now we needed to secure financing for the process. (Financing was secured through one of the large IVF specific medical creditors). Cost is roughly $27,000 to be payed in 5 years (auto deduction is encouraged and interest rate is discounted ($480 monthly). \n\nPrep for Egg Retrieval and Egg Retrieval: Numerous medicines will be delivered to your home or designated pharmacy. Be prepared to help your partner to take shots (extremely uncomfortable for them) in the butt. Eggs are retrieved in an outpatient setting. The doctor retrieved 19 eggs. \n\nEmbryo and Genetic Testing: After assessing the viability of the eggs, 12 were deemed healthy for the next phase. I submitted a sperm sample and eggs were fertilized. After this process, 9 eggs turned to embryos. After genetic testing was done (significant cost), we were left with 4 healthy embryos. Because we had more than 8 embryos, we had to pay an additional $1,600 out-of-pocket. Fine print on our contract allows for 8 embryo genetic testing. All 4 embryos are boys.\n\nTransfer: Additional shots, pain, and discomfort will be felt by your partner as she preps for transfer. We opted to transfer 1 embryo at the suggestion of our doctor. This transfer itself is a very quick outpatient process. \n\nWaiting Period: We waited roughly 3 weeks to find out that the embryo transfer was successful.\n\nPregnancy and High Risk Doctors: IVF and over 35 patients are “required” to see a high risk doctor monthly during pregnancy. Months 1-4 of the pregnancy were relatively easy (occasional heartburn). \n\nDevastating News Month 5: During a visit to the high risk doctor, we were told that our baby had enlarged ventricles in the brain. No other information/outcomes were forthcoming. At this point, we start to panic and worry our baby will have developmental issues. Subsequent visits prompted us to have a fetal MRI done during month 7. The results “confirmed” enlarged ventricle beyond normal ranges (14-18 range), corpus callosum was not fully formed, and the brain was too smooth for the developmental stage.\n\nWaiting in Dread and Marriage Counseling: We both had issues processing the devastating news, which led to us seeking marriage counseling. No definitive answers were ever given by the high risk doctors. Neonatologists counseled us that seizures, developmental delays, cerebral palsy, and other issues could present themselves. We were devastated by the news, but our marriage was strong.\n\nLabor and Birth: Wife was induced at 1:30am 5/11/2023, 1 day short of full term, and our baby was born 5:49pm of the same day. \n\nAwaiting bad news: Neonatology doctor and nurse were present during birth and he was later taken to have a head ultrasound done to asses issues.\n\nWaiting: The next day both neonatologists came to our room and told us after consulting with pediatric neurologists, our son was cleared of any possible brain issues.\n\nNow: 5/17/2023 We have a healthy and beautiful baby boy with zero issues. Doctors were wrong, and we stressed for no reason. Don’t lose hope, because you don’t know until they’re born. Doctors thought they might see something, they guessed based on partial information, and they got it wrong.", "num_comments": 25, "score": 231, "top_comments": ["https://preview.redd.it/1g1ung2yhe0b1.jpeg?width=3024&format=pjpg&auto=webp&s=dc00585d53c47584356b61a7a07bb344f9c8fe27\n\nBaby Fox.", "Wow! That was a rollercoaster!  So glad you were able to start the family you wanted ❤️", "Congratulations! He's such a cute baby.", "I was wondering after the devasting news did you still have other options or did you have to continue the pregnancy?"], "link": "/r/IVF/comments/13jwieh/the_ivf_process_beginning_to_end/"}, {"title": "Poll: what would you do?", "content": "I'm 38F (39 in July), and my husband (40M) and I did our first egg retrieval in early December for our first child. We luckily ended up with three euploid embryos! We are unsure if we want a second child down the road, but we're also not 100% set on being \"one and done\". I've heard that for every one live birth, you should have two to three euploid embryos. I took one full cycle off to let my body recover, and now I need to decide very soon: do we do a second ER or do a transfer of one embryo (that's all my clinic allows per cycle)? Finances are luckily not a big concern, as I had some coverage via insurance my first round.\n\n[View Poll](https://www.reddit.com/poll/s351uv)", "num_comments": 61, "score": 4, "top_comments": ["If you may want more than once child, I’d probably do one more retrieval. If you transfer and are successful after a first or second transfer, it would push any future ER into your early 40s. Success rates for getting blasts drop off rapidly at that point. \n\nOne alternative might be trying one transfer, and if that doesn’t work doing a second ER. That’s not a super long delay. If it does, you’d still have two embryos for a future child.", "Since finances are not a huge concern I would do another retrieval that way the option is there if you decide later on to have more children or if it takes multiple transfers", "I am a 37 and got 4. My RE suggested starting by doing a transfer. If the transfer worked, we’d have 3 left. If transfer didn’t work, she suggested another ER before another transfer. That way we wouldn’t lose much time but also not do an unnecessary ER.", "Are you def set on testing all embryos you get? If not you can do an egg retrieval and then a fresh transfer/test and freeze any remaining", "Thanks again to everyone who responded! Think we’re going to try a transfer next month and just see what happens. 😊"], "link": "/r/IVF/comments/s351uv/poll_what_would_you_do/"}, {"title": "Does Boston IVF let you do back to back ER’s?", "content": "Just trying to get my head around how long this whole process could take us if we need to do more than one ER. Does anyone who is at Boston IVF know if they have/let their patients do back to back ER’s? Not sure of the reasons why you wouldn’t do it that way to be honest.", "num_comments": 4, "score": 1, "top_comments": ["If you are going through insurance, then their finance team will take their sweet time and we had to push a lot to get things moving. If you are out of pocket then it’s probably easier."], "link": "/r/IVF/comments/17luj9l/does_boston_ivf_let_you_do_back_to_back_ers/"}, {"title": "Fertility access program advice ?", "content": "After 8 IUI’s (one ectopic) we are now being encouraged to do IVF. Wondering if anyone has used Fertility Access for financing ? We are worried that the first cycle won’t result in a good amount of eggs and we will have to finance another cycle. Looking for any advice on if anyone used this program or any other financing advice", "num_comments": 1, "score": 3, "top_comments": ["I used WinFertility. If you have access to a 401k, I'd look into doing a loan through there first.i ended up paying off my Win loan with my 401k. I got a better ROI and was able to cut the loan in half."], "link": "/r/IVF/comments/ovk6gz/fertility_access_program_advice/"}, {"title": "Insurance Woes", "content": "TW: Insurance Coverage \n\nThis past Wednesday, my insurance company had an issue with their system, and my planned egg retrieval was denied. According to my insurance company, everything is fixed and my clinic should be able to run it through again. My clinic has not been providing updates about when/what they have done. I'm expecting my period as soon as Tuesday, and I still need to complete a nurse consultation before I can proceed with the cycle. I am not allowed to schedule this until I get insurance approval. \n\nI think I'm going to miss out on this retrieval, and I won't be able to do another one before the end of the year (when my insurance year ends) because the embryology lab closes in December. It's basically a cycle and can't make up.\n\nI am feeling very disgruntled.", "num_comments": 4, "score": 2, "top_comments": ["Don’t give up. Early tomorrow morning, call the clinic and your insurance and tell them you need expedited approval.\n\nEven if your period comes on Tuesday, you have a few days to start. Not everyone begins on day 1. Also, you could do a mid-luteal start, which is what I do. Stay strong! XO"], "link": "/r/IVF/comments/17j763z/insurance_woes/"}, {"title": "After how many years did you start IVF? What is normal in your country?", "content": "Dear all,\n\nI was just wondering; after how many (probably) years of trying did you start IVF? And why? I can imagine that many factors could influence this decision; biological, psychological, financial.. etc.\n\nMy partner and I (F34) are 'diagnosed'  with unexplained infertility. In my country (The Netherlands), it's quite normal to wait.. and wait.. and wait.. We did a few rounds of  IUI, but after three years of infertility they finally wanted to start IVF. I don't like our 'waiting culture'. Fertility isn't getting better if you wait. And the fact that - in an ideal world - I would love to have more than one kid, and that it takes its toll psychologically.. are not taken into account by my doctor.\n\nI'm just curious about other 'infertility cultures',\n\nGood luck to everyone, I hope all your dreams will come true :)\n\n&#x200B;", "num_comments": 17, "score": 5, "top_comments": ["In USA the guideline is 6months of trying if over 35 and 1 year of trying if under 35.  If you’re not pregnant then go for elevated fertility testing and fertility clinic. Whether you do IUI or Ivf is largely up to you.\n\nA lot of this is driven by what insurance will cover.\n\nPersonally we only tried 6 months. Month 7 was an Ivf round.  I was 37.5 when we started trying on our own and I didn’t want to waste time.\n\nThere’s also a vague def of what’s considered trying. In USA some drs consider trying as long as you’re having unprotected sex w no birth control.  So for us even though I was timing sex to non ovulation windows and we were pulling out, they considered that trying.\n\nI think if you want kids on a certain timeline in the USA you have to push and advocate to get things fast tracked.  Some people are ok to keep trying on their own for a year or two before stepping it up. Others aren’t and you hit diff roadblocks w diff drs", "I’m in the US. I have PCOS and documented lack of ovulation, so my doctor referred me to a fertility clinic after only a few months of “trying” (can’t really try without ovulation), and I was able to get an initial appointment within a a month. I think the wait times are longer now, post-covid. Fortunately, my insurance allowed us to move on to IVF after three failed IUIs, but some plans require up to six failed IUIs before IVF is covered. Even with the relative quickness of being referred to the clinic and beginning treatment, there was still so much waiting involved between tests, medication, and insurance authorization. It’s a very difficult part of infertility."], "link": "/r/IVF/comments/147y5ih/after_how_many_years_did_you_start_ivf_what_is/"}, {"title": "Charging Husbands Insurance?", "content": "My husband and I both have the same good fertility benefits that come with our insurance.\n\nWe are doing the process for PGT-M reasons and have gone through our first round of IVF and have day 5 blasts. To this point everything was being charged to me but I was thinking once an egg is fertilized and an embryo is created, everything is half him as well. I could argue that some of the procedures such as fertilization or genetic testing of embryos can be charged to his fertility insurance. \n\nBut my insurance/finance rep at my clinic never flagged this as an option. I wanted to ask if anyone has had successfully charged some post embryo IVF related procedures to thier male partners insurance? If so which ones?", "num_comments": 13, "score": 4, "top_comments": ["My clinic was really reluctant to do that. The invoice needs to be generated in the name of the patient who is going to be billed. My clinic told me that they must be informed before the procedure is performed and that we have to submit the invoice to husband's insurance by yourself. I'd ask your clinic exactly what you need to do to bill your husband's insurance. Alternatively, another option is to exhaust your insurance and switch to husband's insurance. You may be able to get more cycles covered this way.", "I am in the midst of this right now. My clinic refuses to bill anything to insurance that is donor related, and they seem so bewildered by that possibility, which is absurd  - they are a fertility clinic, that's all they do! I think they just don't want to do the work.\n\nSo I am billing it myself. It's a pain, but for tens of thousands of dollars, worth it! We have maxed out my fertility benefits with 3 rounds of own egg IVF and are making progress getting our donor cycle covered under my husband's insurance. Embryology and embryo testing as well. I wish I had known about this earlier, I'd have tried to get some of the embryology and testing costs covered under his insurance in our earlier IVF rounds too. The whole \"you're the girl, so everything IVF related is on you\" thing is so dumb.\n\nThey sure don't make anything easy on us! The main thing I've learned is to always double check and follow up and ask a million questions to make sure! They don't always know what they are talking about, don't always do it right and don't always tell you all the options. So frustrating, but we'll get through it. Good luck!"], "link": "/r/IVF/comments/12xh02m/charging_husbands_insurance/"}, {"title": "Third round results", "content": "I froze eggs only so I won’t have any embryo info anytime soon\n\n35 no known fertility issues \n\nRound 1 11 eggs 8 mature \nRound 2 13 eggs 9 mature \nRound 3 20 eggs 8 mature \n\nI am now done with egg freezing as far as is reasonable enough for  my body and finances \n\nI know in rounds 2 and 3 several of my eggs were too big and overcooked/atretic but the maturity rate was still really low this last time.  5 were m1 so I guess the rest were either too big or GV. I think at least 2-3 were overcooked based on my trigger day follicle sizes. They saw 16 follicles the day of trigger so I think 8 were M2, 5 were M1, 3 were overcooked, and 4 were GV \n\nDoes low maturity rate speak to quality at all? I know it can be a crapshoot. I wish I had gotten more of the 20 just retrieved from rozen but I am grateful for what I have.", "num_comments": 0, "score": 1, "top_comments": [], "link": "/r/IVF/comments/1anm6ez/third_round_results/"}, {"title": "Genetic Screening for IVF - has anyone regretted opting out of this test?", "content": "My partner and I have recently began the process for IVF. We decided to decline the genetic carrier screening and testing. We weren’t exactly sold knowing that a positive test still had a lot of uncertainty on whether a child might have something (25-50%). Plus, the added cost and time it takes for the testing discouraged us. It came across more as a money grab and way to squeeze an additional $1000-2000/person in an already expensive process. But, the paperwork they make you sign has felt a little fear-mongering and I’m wondering if there’s something I’m missing. \n\nSo, my question is whether anyone has declined the testing and then regretted it? Alternatively, has anyone gotten the testing and regretted spending the money? Just curious on experiences and thoughts. \n\nEDIT TO ADD: \n1. The costs are from the provider the fertility clinic chose. It is not covered by my insurance (I checked). My partner does not have insurance right now (between jobs, longer story) but we will check with his once his new contract is in place. \n2. The cost included the genetic consult counseling session that is required before moving forward, once results are in. The paperwork says neither cost is covered by insurance (mine verified), but we could check with my partners new insurance once issued. \n3. I am very anxious by nature and I think I would worry extensively if I was a carrier (illogical worry, especially if partner isn’t) but that was probably a subconscious factor. \n4. The percentages were whether the embryo/hopeful child would have what we tested for or not. I did not factor in the additional testing of the embryo to select those options out (also do not have the cost of that process, but anticipating it will be another $500-1000 based on a convo with the clinic today). \n5. This insight is really helpful. My partner and I are going to talk thru this more and may end up going for the testing after all. \n6. Special thank you to the person who mentioned a program that helped them with the finances. I’ll look into that! \n7. No history of any genetic illnesses in either of our families that we could find, but I understand that we can still be carriers. \n\nThank you!!", "num_comments": 91, "score": 0, "top_comments": ["There are a lot of people here who discovered they are both carriers for the same recessive trait and thus are doing PGT-M testing to obtain embryos that aren’t affected. I personally would not opt out. A termination for medical reasons is a lot more horrific than the cost or wait to do carrier testing", "I’m a carrier for sickle cell. My uncle died from this disease in his 30s. I wanted to make sure my husband was also not a carrier. I don’t regret doing the genetic screening at all. I would want to have as much information as possible going into IVF. In the large scheme of things, if you’re already paying $30k for everything, an additional $1000 for the peace of mind is a small price. This is just my two cents.", "We did the genetic screening, it’s just bloodwork ($700 each here in HCOL and not covered). We found that we didn’t have anything in common so we opted out of the PGT testing for the embryos.", "Before I started this IVF process I didnt want all of the extra testing and all of the things I thought were money grabs. But after just barely having a first failed transfer I regret not testing my embryos. I wish I could go back and test, like a lot of people have said knowledge is power and to me the extra testing is worth it. We did do a genetic carrier screening test, where we found out that I am a carrier for cystic fibrosis, my husband however didnt test positive for that. But now we know and it put our minds at ease that we wouldnt potentially be passing down a genetic diseases to our future kids. \n\nFor my next transfer, I am going to try to do every test in the book to see if anything else comes up. We are doing an RPL panel, and receptiva test, just to be sure nothing else comes up and to give our minds that peace for the next transfer", "We did it and found out we were each carriers of something, luckily not the same one, but it’s definitely peace of mind and would be vital if we had the same disorder. I really would recommend it. My clinic and gyno both recommend it as well", "I would say it's worth the money.  While it's rare for both partners to be carriers of the same thing, it definitely happens.\n\nIt turns out I was the carrier of a rare genetic condition where the kid would die of kidney failure by age 5.\n\nSince I was positive for this, my doctor typed up a letter and we sent my results to my husband's insurance company and they covered his 100%.\n\nLuckily he tested negative for it.", "We opted to genetically test me. I, thankfully, only came back with 1 (relatively mild) genetic condition that, even if my husband was also a carrier AND our child was affected it is treatable and not a concern. However, if I had come back as a carrier for a more serious condition we would have tested him to see if he also carried to condition and we could PGT-M test to reduce the chance of an affected baby. \nI always feel that knowledge is power and probably worth the extra turn around time. Also, we were lucky and our insurance paid for the test, so we just had a minimal copay (but I would have paid out of pocket if I needed to)", "I was advised not to do it only because I have so few eggs, if we can manage to create an embryo we’ll be lucky. There’s a small chance of a healthy embryo being flagged falsely as genetically abnormal. But I was originally quite gung-Ho for genetic testing. If you have a few embryos I think it’s worth it.", "Nope don't regret a thing. My fertility doctor doesn't promote genetic testing unless there is a known reason because abnormal embryos can push out the abnormal material, creating a perfectly healthy embryo, but when the exterior shell is biopsied, the embryo will flag as abnormal and that puts you at risk for dumping perfectly healthy embryos. He said he's had many couples have nothing but \"abnormal\" embryos but still wanted to give them a chance and resulted in healthy babies. I almost regretted it when I had a chemical pregnancy on my first transfer but we did a second and I am now 24 weeks pregnant with a healthy baby girl. I am not a carrier for anything major so I decided to forgo testing. Also, with ivf everything is so planned that you don't get to have those special \"surprise\" moments like other couples do so I didn't care about knowing the gender either lol"], "link": "/r/IVF/comments/18gvj3w/genetic_screening_for_ivf_has_anyone_regretted/"}, {"title": "I'm tired of waiting and feeling bitter.", "content": "I'm sure most here can relate to this, but I need to get it out. \nI'm 32 years old with low ovarian reserve, and male factor infertility from my husband. Had 1 failed FET a year and a half ago with our only embryo - it broke me, physically and mentally. We didn't try again due to finances, but now we're planning on embryo adoption in January. I just feel like I'm always in this limbo of having to sit and wait for the next step in the IVF road while I watch friends and relatives grow their families, seemingly monthly. I'm tired of feeling jealous of the success stories I read. It's like I can't even be happy for other people because I'm so wrapped up with \"will it ever be my turn?\". I can't even bring myself to feel optimistic about the embryo adoption because I need to guard my heart. \n\nIDK. Not looking for advice, just needed to scream into the void for a bit.", "num_comments": 15, "score": 65, "top_comments": ["This is the place to scream. No judgement zone, friend.", "I feel this. Early 30’s doing ivf for genetic reasons after multiple losses. Our first FET just failed and it’s disappointing. We only have one chance left then we’re done. Multiple family have gotten pregnant in the time we’ve been trying. Wishing you all the best."], "link": "/r/IVF/comments/14ub4of/im_tired_of_waiting_and_feeling_bitter/"}, {"title": "IVF after total tube removal", "content": "Hi everyone, new here! I also don’t post on here about anything really so forgive me if I make a mistake. \nI’m 31 years old and had both of my tubes removed after my last baby. The reason I decided to go through with that was because I was in a marriage with a man who thought I was cheating if I did not have sex with him and caused many fights. I wanted to make sure he could never get me pregnant again. He was often violent and I had no way out of the marriage at that time. That resulted in 4 amazing boys. I am now divorced with full custody of my kids. \n\nFast forward to today. I am in the BEST relationship with another man. Marriage is imminent and we have had talks of having just one child together as he does not have any of his own. \n\nMy question is really, has anyone gone through with IVF after having their tubes removed? How many rounds? I’m sure I’ll have more questions the more I think about it but I’m hoping for any insight. \n\nThanks in advance!", "num_comments": 11, "score": 0, "top_comments": ["I had 2 successful retrievals and a successful transfer after having my tubes removed. \n\nFair warning, I’d had two unsuccessful retrievals beforehand, so the dr had already had a few rounds to figure out what protocol worked, or didn’t work, for me by that point."], "link": "/r/IVF/comments/14xzals/ivf_after_total_tube_removal/"}, {"title": "Lower AMH - Plans for Future", "content": "TW: past successful pregnancy\n\nPlease delete if this is not appropriate for this sub. Not trying to overstep or make anyone uncomfortable….\n\nI have one prior pregnancy conceived via IUI as I am in a same sex relationship. We are thinking of trying for a second and our RE brought up that my AMH dropped from 1.8 to 1.4 in under 3 years. I am also 30 so it’s a bit low for my age. He mentioned doing an egg retrieval soon to ensure better chances to conceive and if we want to wait a couple more years we could.\n\nThoughts on the situation? Not sure we could afford it as it would be all out of pocket but could finance it if we needed. I hate closing the door and maybe having issues later on.\n\nAgain sorry if I shouldn’t post this here. If there are better suited subs please let me know.", "num_comments": 6, "score": 2, "top_comments": ["You have better quality and quantity when you are younger. Im 35 my AmH is 0.89 and i regret not retrieving sooner. My outcome could not be so shiny"], "link": "/r/IVF/comments/15sg2zp/lower_amh_plans_for_future/"}, {"title": "Working overtime to fund IVF", "content": "Shout out to everyone else out there busting their ass to pay for IVF that should be covered by insurance but isn’t. I’m on call tomorrow, but if I get called in it will be day 1 of a 13 day stretch. The first of many. I have 213 more hours of overtime to work to pay for a round in Mexico. The sooner I work it, the sooner we can start again. Good luck and stay strong!", "num_comments": 11, "score": 80, "top_comments": ["I have been working 6 days a week for the last year in a half. Good luck 🤞 it will feel good not to be in debt after.", "I couldn't do it. We financed ours through Future Family."], "link": "/r/IVF/comments/11034f8/working_overtime_to_fund_ivf/"}, {"title": "Egg freezing/IVF - HDHP or OPA?", "content": "My company is moving to Cinga for our health plans in 2024 and I am looking to freeze my eggs. I know there’s a chance this won’t be covered under any plan because they technically only cover IVF rounds, but in the chance some of it is I’m trying to decide if I should go with the HDHP or an OAP plan. Here are some details:\n\nHDHP\n\n$0 a month\n\nDeductible: $1,750\n\nOOP Max: $2,500\n\nCompany will put $875 into my HSA for the year \n\nCo-Insurance is 10% after I hit the deductible \n \n\n\nOAP\n\n$90 a month\n\nDeductible: $500\n\nOOP Max: $3,500\n\nCo-Insurance: 20%\n\nCo-Pay: $20-$30\n\nWould love any help! I can’t decide if I go for the HDHP assuming it won’t be covered and at least I’ll get some money in an HSA, or if it’s safer to go the OAP route/would end up being cheaper if some of it is covered by insurance. I’ve tried to call a few fertility centers but haven’t been able to talk to the finance department and enrollment closed tonight. Thanks!", "num_comments": 2, "score": 1, "top_comments": ["I don’t think Cigna ever covers eggs freezing. I have the best coverage possible with Cigna (can do as many treatments as I want for whatever number of children I desire) and egg freezing is not part of it. \n\nI think you need to read the policies and compare their fertility coverage. Regardless of your OOP Max there are fertility lifetime maximums and once you meet them they won’t cover any more treatment. Example, an insurance can have 20,000  or 250,000 life-time maximum and sometimes this maximum is inclusive of medications. Medications alone can be over $20,000 when billed to the insurance. So read the insurance booklet, ask for a copy of the proposed plans.\n\nProgyny covers egg freezing. This is something your company can add as a benefit."], "link": "/r/IVF/comments/17vb9tw/egg_freezingivf_hdhp_or_opa/"}, {"title": "husband wants to wait.....", "content": "Just got into another argument on how he keeps changing his decisions and wanting to wait until next year.....hes supportive but when I bring up ivf... He will get mad and say \"talk about it again and we won't do it\".\n\nIt has been frustrating for the both of us especially when we're surrounded by newly pregnancy and/or families. His friends keep sending pictures of their babies/kids in his group chats and we're always left in a corner awkward when there are gatherings. So I understand the pent up frustration.\n\nI am 34 and husband is 37 this year and am diagnosed with low egg reserve and anovulatory. I use lh strips and I see when it peaks but I'm actually not ovulating 🤷🏻‍♀️ my Dr doesn't know why either.\nI don't respond to 7.5mg letrozole and waiting for AF to start7. 5mg letrozole+gonal f. also, Dr says he's \"normal\" but it seems like he is on the lower spectrum of \"normal\" sperm wash was 3.8m.\n\nanyways, husband wants to wait until we move into the new house before trying for ivf. as the economy is looking unstable with a possible recession, he wants to see where our finances at after selling and moving into our new home in Dec. (new home was purchased in 2020 before diagnosed with infertility)\n\nThis completely makes sense to me however, time is really not on our side either...did I mention he doesn't care about having kids. We're only doing treatments because I wanted to... Also mentioned that we will only do 1 ivf in 2024 and if it fails...\"too bad! \"..... Its just so frustrating.....its not like we're financially incapable but he's always been like this. Example, he wouldn't propose (10 years dating relationship) because weddings are expensive but its ok to buy an 100k car 🙄🙄🙄🙄 then i persuaded him to finally have a covid wedding because it's alot more \"affordable\" that ended costing more than most covid elopement  weddings 🙄🙄🙄", "num_comments": 117, "score": 22, "top_comments": ["“Talk about it again and we won’t do it”. \n\nThat is very manipulative and abusive. I would seek counseling before starting.", "If you can afford a 100k car, you can afford IVF. I’m sorry you are going through this.", "I'm not a \"see a therapist\" type, but y'all should see a therapist/counsellor to mediate this one. We were in a similar boat, and came to the agreement of one egg retrieval that we did now. Waiting would have been torture for me, and now we've agreed to a plan, all has run pretty smoothly. Unsure yet whether we will be successful and have a child, but I can live with however it turns out from now. Wishing you peace and a resolution that works for you both 🤗", "He has a $100K car????? Wow. And won’t commit to IVF. Something not right.", "Your husband keeps moving the goal  post on you because he’s not interested in spending money on things that aren’t important to him - and your wants are historically not important to him. I think you need to consider how badly you want to be a parent. If it’s something you really want to do, you need to consider that the fastest way to do that is by doing ivf on your own with a sperm donor. Would you really want to have a child with a man who doesn’t actually want them?", "if he's not absolutely invested in this, you are not going to be happy raising a child with him\n\nall i see here are red flags, and i'm so sorry but that's not the kind of partner you deserve", "The behavior you have described + him not caring if you have kids screams him running out the clock. If you want children, you may have to move forward with or without him (coming from someone pursuing this on their own).", "He sounds terrible. Does he want kids or not? If not, he needs to tell you now and not delay and waste your time and faff about. If he does, then you just need to start or agree on a non-negotiable start date because you’re right, time is not at all on your side.\n\nI don’t mean to sound un-compassionate. This is a very hard situation. But he is frankly being awful and you should look out for your own life goals.", "It's not appropriate for him to be making unilateral declarations like \"ask me again and we won't do it.\".  And threatening to take away your ability to have a child to control your behavior?  That's abuse.  Please see the red flags and think long and hard about whether you want to have a child with this man.  He's abusing you and he won't be any nicer to the children.  You and your future children deserve better.", "First of all, I’m sorry to hear you’re going through this. \n\nThis is still so tough when we have all the loving support we need around us — let alone when we don’t. It sounds like your husband is already weaponising your fertility issues against you in arguments, which is really not a healthy dynamic. If he already feels like the “whole kids thing” is *your* idea and he doesn’t really care, will he be a fully present partner throughout any pregnancy and potential childbirth? How likely is it that he may harbour resentment against you, and ultimately your child(ren) for sleepless nights, major lifestyle changes, serious financial reorganization, etc? \n\nNot trying to sound harsh, but having kids brings a whole other suite of issues into a relationship dynamic even beyond the struggles of the IVF process to get there in the first place.", "[removed]", "It sounds like you two have really different priorities. I’m sorry. Neither is right or wrong but you two are not on the same page whatsoever. \n\nI have a little suggestion if he’s dragging his feet..\n\nAsk him to visualize what life is like when you’re in your 60s, retired. Does he see himself having adult children?\n\nIdk why but I have some friends really kick into gear on the kid stuff when they think about their life many years from now.\n\nGood luck with everything", "You know what? I usually don’t like to go online but today, I feel the urge to rant, and I saw your post! My husband is the same, he does NOT want kids! I wonder why there is a human like this on earth? However it’s too late for me to find out. So now, I ask him to leave, it’s either cooperate on IVF, or GO away. I will do IVF. And don’t wait.", "I’m so sorry to hear this.  Pursuing IVF is a tough financial decision so both of your feelings are valid.  It’s that they’re not on the same page and I’d honestly seek counseling before having a child with him."], "link": "/r/IVF/comments/104c4r1/husband_wants_to_wait/"}, {"title": "Is there any reason not to bank?", "content": "I recently finished my first round IVF and my fresh transfer of a 5 day early blast ended in a chemical pregnancy. I have 2 frozen embryos (6AC and 6BB) from the same cycle. I'm 39, and my instinct is to try another stim cycle before an FET. My follow-up with my doctor isn't until June 8th, but I'm wondering if anyone here has any opinions on whether to bank or transfer. Aside from finances, is there any reason not to bank? Is there any reason the doc might advise against it? Thank you!", "num_comments": 27, "score": 5, "top_comments": ["I'm 38. First cycle we got 1 euploid. Because I had some fertility coverage, and I wanted the possibility of 2 children, I did another cycle.  We got insanely lucky and got another three euploids cycle 2. For me 4 banked embryos gave me the security to move to transfer. The biggest reason not to bank is not wanting more than one child in my opinion.  Plus you have to consider what you plan on doing with any of the embryos you don't use. I'm currently 8w4d and fingers crossed I get to use another for child 2. After that I'll likely donate to someone if qualified or donate to science.", "If finances were no concern I would for sure bank!  I just turned 39 yesterday. My first FET ended in chemical last week. I have one pgt lower quality and one “no result” embryo left. I’m gonna transfer both - i am fortunate to have insurance coverage but they will not pay for banking. I have to use anything viable before they will pay for another ER."], "link": "/r/IVF/comments/ur5o2y/is_there_any_reason_not_to_bank/"}, {"title": "Starting IVF earlier than I thought...really overwhelmed ", "content": "I've posted a few times in here and wow. It's happening and idk whether to feel sad, excited, angry I have to do this or hopeful. I have a mix of emotions and just not sure where to turn to. My husband and I have been TTC 3 years, I had severe stage 4 endo and had two laps last year, my last one in November with an endo specialist who removed all of it. I had a chemical in September but other than that nothing. We went to a clinic today and long story short, my husband is ready to start IVF. I was shocked as we discussed the end of the year due to finances but I suppose he heard for himself what our chances are naturally and his mind has been changed to get started asap. Of course I'm so grateful to have a supporting and loving husband, who said he cares for me deeply and wants us to do this together but now I'm overwhelmed with emotions. I really thought I'd be the lucky one to get pregnant right after my lap... that I'd be in that window of success and I wouldn't need IVF.  My husband and I are 25/26 so time is on our side but not so much with the endo. I guess I just wanted support, advice, hugs... as we are keeping this entire process on the down low aside from a select few. I'm just really nervous 😥 but I'm in love with the clinic we have chosen to go with, I feel like we are in good hands. ", "num_comments": 11, "score": 9, "top_comments": ["my husband and I are coming up on our first round of IVF and I hear you on all those feelings. i was so overwhelmed and couldnt believe it when we came to the realization that IVF was our path forward.  I would say try not to get too caught up in other peoples experiences when it comes to comparing them to your own. it's so easy to go down a rabbit hole of seeing ourselves especially when peoples numbers are similar to our own but know there are SO MANY moving parts and you are on your own unique path. For me, I really love to gather information so in the early days I listened to SO many hours of podcasts about the whole process (make sure you are finding one with real, science based information!) and knowing a baseline of it all made me a lot more calm and not panicking about all the things. the ivf process is so complex so just take it a day at a time and most of all, be gentle on yourself :)", "It's awesome you're getting started now because it doesn't get any easier as you age. Go for it and good luck! "], "link": "/r/IVF/comments/1b3czbl/starting_ivf_earlier_than_i_thoughtreally/"}, {"title": "How many ER did you have to go through ?", "content": "Wondering how many cycles of egg retrievals people go through. We are trying to gauge finances and with the most money going to egg retrievals wondering how many ER are common.", "num_comments": 22, "score": 5, "top_comments": ["There’s no “common” answer.  Other than it’s common to need more than one.\n\nI’m on my 4th.  We’ve only had 1 blast from the 3 previous ones.  No diagnostics that pointed to these outcomes.  My amh and afc are ok for my age (I’m 38), so it’s likely sub par egg quality", "It’s extremely variable on your personal biology, age, response, how many embryos you want, whether you’re going to do PGS testing etc.\n\nI’m almost 39 with below average egg quality and I’ve done four rounds to get 6 total embryos but only 2 euploid and 1 mosaic after testing. We wanted to end up with at least 5 embryos to try to have 2 kids. Haven’t transferred yet.\n\nMy friend at 38 did one round and got 5 embryos total, didn’t test them, and had success on her third FET. She only wants one baby.", "Will depend on a ton. \nI am 35, about to be 36. Amh 2.6, good afc, etc. Got 12 eggs first round, nine mature 8 fertilized four blasts two of which were normal. But I already did two transfers which both failed so about to start round 2. We would be fine with just one child so really hoping this retrieval is it. We are going to be a bit more aggressive with medication this time around in hopes of getting a few more eggs", "We’ve done two so far and looking at at least a third. Probably a fourth."], "link": "/r/IVF/comments/owscxd/how_many_er_did_you_have_to_go_through/"}]