[{"title": "Supportive Parents", "content": "This may seem off the wall, but I’m genuinely curious how other parents, specifically moms, have supported you during your IVF journey (finding out, stim, retrieval, transfer, etc.). Do they call? Did they spontaneously do nice things? How do they show their support? \n\nMy mom has been awful and I’d like to think this is NOT the norm. \n\nPlease share all the nice things your mom/parents have done for you and your SO through your journey! Or friends and extended family!\n\nLet’s get some positivity going! ✨", "num_comments": 255, "score": 44, "top_comments": ["My mom was great. Would ask how things were going and was very interested in the process. We used donor eggs and she says it was our miracle. But she still annoys me about many things!", "My mom makes comments that annoy me. Asks too many questions that annoy me and if I could I wouldn’t  have told her we were doing this but needed her sample for PGTM to build a probe.", "My parents have been amazing. They loaned us some money without hesitation so we could get the process started. My mom knows not to ask prying questions, but will text me the morning of any scan, procedure, appointment, etc and just say something like “❤️❤️❤️” or “love you!” and it makes such a difference. She also dropped off my favorite homemade muffins the day of our retrieval.\n\nMy dad is new to all of this and it’s been kind of funny to hear him try and use the lingo, but I know he’s just excited and hopeful for another grandkid (and the first from me). My husband’s parents have been great as well. My MIL shipped me a soft bunny rabbit stuffed animal and a box of chocolates. We’re very lucky.\n\nEdited to add that my husband was out of town for my very first stims shot and my sister (who is a PA) did it for me while my mom held my hand.\n\nAll that to say, I’m so sorry you are in this situation. That’s not fair and you deserve to feel supported. Wishing you the best!", "Never told either set of parents. My mom can’t keep anything to herself and is very unaware of how insensitive she is at times eg. After I had an ectopic pregnancy and needed emergency surgery (so we had to tell them about that one) she decided it was appropriate to give my son (who was is our IVF baby) some pyjamas that said ‘brother bear’ on them. On the in-law side, again can’t keep anything to themselves and although supportive in other aspects of life can also be quite insensitive at times. Ask a lot of question’s without actually listening to answers and have rapid fire question sessions where they’ve moved onto the next question before I’ve had a chance to even answer the first. We just found it was easier not to say anything to family, but have a close network of friends who have been through similar struggles.", "We didn’t share with my husband’s family because they can be overbearing, also I am not close with my mil, she has been obsessed with us getting pregnant and thinks that we don’t have kids because I am childfree but the truth is 2 of her sons have MFI. I did tell my mom. She knows a ton of people who went through IVF and doesn’t look at it as something negative. We never shared the transfer day with anyone, I mean sharing a possible conception date is weird to me. We will share in the 2nd trimester with my mom and a few more close friends, and maybe the rest - when the baby is born or 3rd trimester.", "My mom knows I did it but thats about it dad and husbands family have no idea", "My mom randomly texts me “I’m thinking of you and I’m so proud of you” out of the blue. This is 100% related to IVF. She also gave us ALL of her frequent flyer miles. Like 200k miles on United because our clinic is out of state. We used them all. \n\nMy dad also gifted us money a couple of times when we hit bottom but I don’t dare ask again.\n\nMy in laws just said “oh” and “wow” when we told them about our losses and doing IVF. Then they’ve done nothing but complain about how we don’t come to visit with all the money we don’t have to pay for that.", "My dad has paid for a few things, like a couple sessions of acupuncture, always calls to check in, sends flowers when I get bad news, and comes with me to appointments if I need (like a ride home from ER).", "My mom calls to check in on me and we have a group chat with my sibling where we post updates (not just IVF related). When my husband had to leave me home alone post-retrieval, she came and spent the day with me to make sure I was okay. My dad mostly just chills lol. He’s a typical, emotionally stoic kind of fellow (except when it comes to sports 😜).", "Both my parents and my husbands parents have been VERY supportive. We just very clearly explained what we are doing and why and they were just so excited to see us go on this journey. My mom does ask a lot more questions and wants to know what’s up. She made me bone broth to drink in preparation of egg retrieval and doing sweet things like that. When it came to embryo transfer time we didn’t tell anyone the date so that we weren’t being pestered about results. We waited till end of first trimester to tell our parents that it worked. Wanted that big of surprise factor that other couples feel when they conceive unassisted. \nIf you aren’t getting a good response from your parents then setting those boundaries might be best and setting up other support systems like friends, coworkers, etc. even my acupuncturist essentially became my fertility coach and I leaned on her A LOT.", "TW: Success\n.\n.\n.\nWe just finished our first try for baby #2. My parents have known the entire time (including our try for baby #1) but when we told them the second transfer was successful, they immediately started talking about putting their house on the market again so they could be closer to us to help.\n\nMy parents and my in laws have been absolutely wonderful through our entire IVF journey.", "My mom calls to check on me but doesn’t understand the process no matter how many times I explain it. But she is super supportive and send me positivity and prayers lol. Otherwise she does call to ask what’s next or what I’m doing lol.", "My mom listened to me very carefully and did NOT ask me specific questions about my ivf process and we only discussed it if I brought it up.. but I did tell her whenever my procedures were and she’d text me sweet things without being obvious about what i was going through .. this was great for me because I did not want to speak about it sometimes.. it’s a lot to explain when your mind is already constantly on it! She may not realize (and now I’m going to tell her) that she’s been super great about it and it’s been really supportive for me 🥰", "My parents are super supportive. Checked in on me everyday made me dinners every night offered to come clean my house for me even offered to do my laundry while I was doing all my shots. I couldn’t be more greatful. My husbands parents also checked in on us and offered to help with dinners and whatever they can support with. Sorry your mom isn’t being supportive. Going through this without a big support system is hard.", "Did not tell them a single thing about our IVF journey. Would have been more stress! Don’t regret it at all", "My mom has been extremely supportive. Day of egg retrieval she stayed with me to help me and also to help with my dog (letting dog out, feeding her, etc.), she doesn’t ask if I don’t give her updates, she crosses her fingers for us always hoping for the best (which has been a big deal for me - I’ve been very quiet about everything but having another person rooting for us has been helpful mentally). I keep her updated and she gets tears in her eyes when we get good news, and cuddles me when I’m going through the worst.", "My family (grandparents, parents in law) paid for my ER and transfer since I have no fertility coverage through insurance. My parents got me a care package with little gifts (ranging from fuzzy socks to chocolates to a silk pillowcase) to open each day of stims during ER.\n\nThey also got fries on transfer day and found the cutest little fry stuffed toy. I don’t even know where my mom found it. My in laws bought us flowers and also got the fries.\n\nAll family members check in on us often. I couldn’t do this journey without them.", "My little sister is an IVF baby, so my parents have first hand experience and know what it's like and have been very supportive. My mum has a folder with all her info from when she went through it (~25 years ago), and it has been very interesting comparing notes and seeing how things have changed in that time.", "My MIL has previously suggested to my wife that we should just opt for adoption instead of trying IVF, and most recently told us that IVF was too expensive and that money would be better served spent on traveling across the country to visit her more often.\n\nSo I can definitely relate to everyone who is struggling with their parents making ridiculous comments. This entire experience has been one of the more challenging obstacles of our entire lives, and unfortunately the comments from my MIL have definitely strained the relationship between her and my wife.", "My father is pretty cold but deep down he cares. He just doesn’t always know how to express it. He’ll send a message after he puts the phone down having been cold on the phone and I know he cares.", "When we found out my tubes were blocked, my parents offered to pay for everything. So I'm so grateful to them for that.\n\nBut I wish I didn't know every step of the process... My mom constantly ask questions And has been so excited. It's added pressure... \n\nWe told everybody we weren't telling when we were doing the transfer and she got mad that I included her on that list... She thought we would just tell her because she was paying for it 😂 \n\nBut we would have had to take out a loan to do it without them and I'm already 31 and just cant imagine waiting much longer. Especially since id really like 2 kids.", "My mom made me soup after my retrieval and other meals. She is a great mom but still makes comments about wanting grandkids and puts pressure on me with what she says often. It sucks."], "link": "/r/IVF/comments/1ai59th/supportive_parents/"}, {"title": "Apparently if you can’t conceive naturally you don’t deserve to be a parent ", "content": "On Instagram earlier I saw a post from Kari Lake who is running for Senate in my state. One piece of her platform is advocating for more access to fertility treatment. The comments ripped her apart for supporting IVF. \nSome examples:\n-ivf sounds beautiful on the outside, but no one is entitled to children at the expense of these little ones own rights and dignities. \n-ivf is bad! It’s worse than abortion!\n-no one has the right to be a parent. It’s a god given privilege. \n-ivf is inhumane. Ivf is playing god. Ivf is an unnatural way of creating human being in a lab and then destroying and discarding the humans you don’t want. It’s just as horrific as abortion. \n\nThese people are so horrible. I went through 100+ comments and every single one has the stance that you are a murderer if you do ivf. Women use ivf for a variety of reasons and telling someone, “oh you don’t deserve to be a mom because you can’t get pregnant naturally” is so cruel. Reading those comments made me want to cry. Why should we be punished because our bodies don’t work the same? Its comments like these that make me afraid to mention anything about an ivf journey because I know that hearing these in person would destroy me mentally and emotionally. ", "num_comments": 108, "score": 194, "top_comments": ["Someone said something to me recently - if anyone ever says IVF is an unnatural intervention, ask if they have ever used antibiotics or had a broken bone fixed or cancer treated. People are highly hypocritical. Not everyone believes in god, some believe in science, some believe in both. I bet they believe in it if it helps them and condemn it if it doesn’t. \n\nIgnore those folks!", "My future sister in law (call her Mel, married to brothers) is one of these people. I was never met with with such a lack of hatred and empathy before.\n\nHere’s what we need to remember… these people like Mel usually have no idea what infertility entails. When Mel’s own brother started IVF, I saw her attitude change because someone she cared about finally experienced infertility and well frankly.. that’s just not fair so of course she will have different standards for someone she doesn’t like/know versus someone she does.\n\nAnd here’s the biggest kicker, if Mel is infertile guess what… I have no doubt that she will completely shift her attitude and go through IVF herself. That’s how these people work.\n\nSo next time you see these nasty inhumane posts of folks who are anti IVF, just remember how quickly they’ll betray themselves if they are told they need IVF to conceive.", "Lack of empathy is their core issue. I’m sure they will rush to seek “unnatural” medical intervention if they get sick themselves - even though their god intended for them to get sick and die (according to their logic).\n\nDon’t give into them! They don’t know what they are talking about. \n\nAlso, some of these people are adopted orphans who take IVF as an insult to their existence. Getting abandoned as a child is such a tragedy that I would not blame them if their anger was misguided toward infertile couples. It’s sad.", "With so much plastic in our food and water supply and the fertility issues that are becoming more widespread globally, IVF is going to be mainstream in a decade. People are still going to be idiots in a decade too.", "Here’s the holes in her fallacy:\n\nIf we’re basing laws on what one particular person deems is God’s will or unholy - then the door is opened to what is God’s will. If you get cancer- it was God’s will - so no treatment for you. If you get into a car accident - no treatment - only the strong survive. Also - sweetie - this is how EVERY CULT STARTS. With ONE PERSON DECIDING WHO GETS TO DO WHAT BECAUSE GOD TOLD THEM. \n\n2. To everyone who god has given children - does that mean they are the chosen ones? The people who abuse their children? The people who leave them for dead? The people who solicit their children for child pornography? \n\nPeople are allowed to be as ignorant and self righteous as they want to be - truly - but these are the people who shouldn’t be allowed within 10 feet of making a law. \n\nAlso until people who say dumb shit like this actually focus their time to help and care about the living children who were god given terrible living situations - then she can shut the fuck up.", "I really hate how people call it \"conceiving naturally\". It's all natural,  either you need assistance or you don't.", "It’s so so upsetting. My own grandma had similar views about if I don’t use all of my embryonic equivalent to abortion etc. People should mind their own business! And all of these ppl saying this have never dealt with infertility!", "$10 that they’d do or support IVF if they of their sister had ovarian cancer & needed to preserve their fertility. If you’re infertile for “the right” reasons or it happens to you, the tune changes quick. Just like abortion.", "The world is full is stupid people. Doesn’t mean they are right or their opinion matters. I wouldn’t listen to any of them.", "Those people are lunatics and reason is not going to work on them. Why do you care? The best defense in the world is to not care about what others think.", "People are stupid. Anyone making these comments is just ignorant and misunderstands the procedure and basic human biology. This is all the same extreme logic that says sex is only for procreation even between married couples, birth control is wrong etc. meanwhile they have no issue seeking any other medical assistance. Infertility is a disorder and treated appropriately but unfortunately people are fucking stupid and feel it's their place to comment on something that doesn't even effect them. \n\nThe \"god given\" rights comments kill me....so God is withholding babies from couples who want and can afford to care for a child now but giving them hand over fist to drug addicts and other people that can't care for them properly...and YOU believe this type of \"god\" loves you? It's all just ignorance. Just don't even read them and definitely don't respond. You can't argue with stupidity.", "Do these people not know that a decent portion of IVF is needed because of male factor infertility? So bc my husband had surgery as an infant to prevent cancer and the dr snipped the wrong tube in the process essentially giving him a vasectomy at 6 months old.. neither of us deserve to have the opportunity for bio kids? Honestly if these people needed it they’d change their tune"], "link": "/r/IVF/comments/1b2ssfi/apparently_if_you_cant_conceive_naturally_you/"}, {"title": "Transferring as a single parent?", "content": "My husband passed away 11/3/23 unexpectedly (heart attack). We had finished our 5th egg retrieval the week before and after he passed I got the news we had 2 embryos go for PGS testing. \n\nJust got the results back today and we have one 4AA Euploid embryo. I never wanted to be a single parent. This was the life we were supposed to have together. All he ever wanted was to be a dad. His death is still so new and shocking and the clinic can’t set me up for transfer until February/March at the earliest so I have some time to process but I am a ball of erratic emotions around this. \n\nHas anyone else transferred as a single parent? I don’t know that I’m even looking for advice at this point, just anyone in a similar situation and how you processed/made final decisions. Still no guarantee it will work I’ve had 2 failed transfers already and then that will cause a whole other level of depression on top of what I’m already feeling I’m sure.", "num_comments": 26, "score": 57, "top_comments": ["I am so so sorry for your loss. \n\nI wouldn’t do anything quickly - you have time. Grieve. Go to therapy. \n\nAgain I’m so sorry.", "I’m so sorry.", "I am so sorry for your loss. Big hugs 🤍", "There are many of us doing it and continuously thinking about single parenting. For many of us is our choice. So go for it if you want to do it…", "I am so sorry about your loss. As a mother of two and a friend of a single mom, I would say that take your time to grieve and decide if you really want to go through pregnancy and raising a child on your own. I’m telling you right now, pregnancy itself isn’t easy, but trying to raise a newborn while recovering from the labor(you barely sleep for 3-6 months) and working full time is not easy AT ALL. You need to have a solid support/financial foundation to do so. It’s definitely up to you obviously, I would honestly just take your time to grieve and process the loss, and then make a decision."], "link": "/r/IVF/comments/17vbhl4/transferring_as_a_single_parent/"}, {"title": "Double transfer twin parent regrets?", "content": "Trying to decide whether to transfer one or two embryos (not pgt tested) and wondering if anyone who transferred two and had twins regrets making that choice or if more twin by choice parents do not regret this. We would be first time parents and ideally want one of each sex. So lots of potential downsides in addition to the known medical risks, like it being extra extra difficult and letting go of the dream of one boy and one girl, potential heartbreak of losing one, etc. thanks for sharing your thoughts/experiences!\n\n[View Poll](https://www.reddit.com/poll/zqz4rc)", "num_comments": 8, "score": 3, "top_comments": ["We transferred two (not PGT tested) after our first failed FET. The goal was to only ever have one, but we are 23 weeks pregnant with boy/girl twins. I'm both excited and scared. So far both are healthy and progressing as expected. As these will be our first kids, we aren't really sure what exactly we are getting into just yet."], "link": "/r/IVF/comments/zqz4rc/double_transfer_twin_parent_regrets/"}, {"title": "TW: Question for parents of multiple IVF babies", "content": "Anyone never experience a failed FET after multiple successful pregnancies? Just curious. Also, feel free to share anything you did to prepare!", "num_comments": 6, "score": 0, "top_comments": ["We had 4 kids with IVF, not every transfer was successful. Just the way it goes :)"], "link": "/r/IVF/comments/1bmt4ph/tw_question_for_parents_of_multiple_ivf_babies/"}, {"title": "Working with new parents/newborns", "content": "Is anyone in the same or similar boat? And how do you manage?\n\nI'm a postpartum doula ( 10+ years) and I work with new families bringing their new babies home anywhere from the first few days to mont\nhs. I've been really lucky to have a great client load. \n\nHowever I'm finding it increasingly hard to keep doing this work. I was okay for a number of years working through PCOS, MFI but since my ER and now transfer I don't know if I can keep doing this work. \n\nI already switched from nights to primarily day shifts for hormone balance but honestly nights were easier. It's hard to walk new parents through a journey I do badly want to be apart of. It's hard to be told how well I do my job knowing I'm just loving on y'all and your babies like my own. I'm offering what I'd want during my postpartum time. \n\nI've kept it compartmentalized until now but now I'm really considering taking some time off and pausing or pivoting careers\n\nIt's hard to get a break from \"baby\" stuff because it's my job. I can't even distract myself during waits or bad news with work. ", "num_comments": 4, "score": 3, "top_comments": ["I am a NICU nurse and also teach community prenatal classes. It has definitely taken a toll on my mental health, especially after I have negative treatment outcomes. Unfortunately I rely on my job for fertility benefits so I don’t really have a choice. I do try to remind myself that probably a lot of people I work with had their own battle with infertility, and for whatever reason that tends to make me feel better. Like they made it through and maybe I will too. But also, I’ve started looking into other career options. I don’t think there’s an easy answer, but I hope you can find peace with whatever you decide!"], "link": "/r/IVF/comments/18pbywv/working_with_new_parentsnewborns/"}, {"title": "Are my parents legally required to tell me if ima. Donor child ?", "content": "Basically I know I’m born through ivf a few years ago I underwent genetic testing for vascular Eds my doctor needed me to find out if I was donor conceived and my mum acted really weird about it but the gist from her was basically no but I don’t believe it. Are they legally required to tell me , is there a way to find out without them knowing I am an adult but I’d rather them not know as they clearly don’t want me to know if I actually am . Thanks ", "num_comments": 20, "score": 7, "top_comments": ["Donor conceived person here - you’re very welcome over at r/donorconceived. \n\nNot only are your parents not required to tell you, most in our generation do not. I found out when I found my father’s body. \n\nYour best bet is Ancestry or 23 and Me (preferably both), and we can help you out with a free search angel if it’s not immediately obvious who your biological father is. Telling your parents you’re testing can also prompt a confession. \n\nVery sorry to meet you under these circumstances, but hopefully you’ll feel supported by the community as you search for answers.", "I'm so sorry,  I'm the past they weren't required to tell you,  and even today it depends on which country you live in if its an open or closed donor. \n\nI'm pregnant via sperm donor and I'm planning to tell my baby as soon as they're born,  and keep talking about it,  as its part of their story. Also where I live it legally has to be an open donation so my child will have access to their donor's information (but as the parent I can't access it). It's awful that people keep these things hidden."], "link": "/r/IVF/comments/1b4bjv2/are_my_parents_legally_required_to_tell_me_if_ima/"}, {"title": "Question about semen analysis requirement for non-biological parent", "content": "Hey all. Not sure if this is the right place to post this but my husband and I (same sex couple) are in the process of having kids. His sister is donating her eggs and we are using my sperm. In addition to all the bloodwork and genetic testing she and I are required to go through, the clinic requires that my husband also do bloodwork and a semen analysis even though he is not in any way physically involved in the process. Has anyone gone through this? I haven't really gotten a clear explanation from the clinic as to why they care about my husband's semen when it's not going anywhere near his sister's eggs...", "num_comments": 16, "score": 11, "top_comments": ["Sounds like they’re trying to make you pay for things you don’t need.", "This seems suspect and like they're trying to get you to pay for a SA you don't need. You might want to try asking over at r/queerception.", "Yeah that sounds like some wires are crossed. They might need info on both intended parents, like medical+social history and stuff. But labs and SA seems unnecessary for a parent that's not biologically involved - I bet the staff were told somewhere that it was protocol but a chat with the doctor could probably clear that up."], "link": "/r/IVF/comments/ucs8mh/question_about_semen_analysis_requirement_for/"}, {"title": "Are we bad parents already?", "content": "Just went through our first ER and came out with 15 eggs. We were over the moon until we got the call with our fertilization report.\n\nRetrieved: 15\nMature: 7\nFertilized: 6\n\n\n\nAnd now we wait. For some reason we thought of would go better. The stims were so incredibly hard on my body, and recover from my ER has been rough. I feel like we cannot afford to do another ER, but IVF is our only choice. Has anyone had all 5 or 6 of their fertilized eggs make it to blast and be normal? We feel horrible because we feel like we are already counting out our kids. 🥺", "num_comments": 17, "score": 0, "top_comments": ["What?!? No.  how does this make you a bad parent. Get that out of your head.\n\nThis is just stats and science.\n\nOnly 40% are expected to make it to blast.  And then after only 50% (age dependent) will be normal.\n\nFor me. And this is very personal obviously, I don’t think if these as children. They’re a bunch of cells.  Even my m/c where there was no fetal pole or sac I don’t think of as a baby that was lost. It’s a bunch of cells that didn’t divide properly", "Attrition rates really suck and are a shock at times. I’m sorry. \nWith our 2nd round we retrieved 16. 11 were mature and 7 made it to blast (5 day 5 and 2 day 6.) of those 7, 5 came back euploid. \nI was shocked. My clinic was shocked that we had 7 blasts sent for testing. \nIt’s all kinda a crapshoot.\nWishing you all the best and all the luck! 🍀🤞🏻🤍", "I’m barely have about 5 follicles of right size 🥲 I’m over here praying atleast 1 gets to blast stage"], "link": "/r/IVF/comments/13s5jib/are_we_bad_parents_already/"}, {"title": "Do both parents need fertility coverage / insurance?", "content": "Planning ahead because IVF is likely in our future next year…\n\nMy husband and I are currently subscribed to his employer’s health insurance, which has no fertility coverage. My employer’s plan does (BCBS IL). I am planning on switching to my employer’s plan during open enrollment.\n\nMy question is… does my husband also need to be on my plan with fertility coverage in order for IVF to be covered? Has anyone been in this situation before?\n\nThank you!", "num_comments": 9, "score": 2, "top_comments": ["Nope, only you need to be on a plan with fertility coverage\n\nEdit: unless he’s getting some sort of procedure or testing done\n\nI wish you the best of luck as you’re starting IVF 🙂", "Just as with any insurance, if it’s your insurance, it will cover you and your eligible procedures/testing/whatever. If your husband is not on your insurance, then he’s paying for his own procedures/testing/etc."], "link": "/r/IVF/comments/179ytnt/do_both_parents_need_fertility_coverage_insurance/"}, {"title": "Lesbian parents IVF", "content": "Hi everyone, \nFirst time poster here and I’m not really sure how to navigate reddit yet so please bare with me. Trigger warning as post is about pregnancy.\n\nI’m looking for any online forums or group chats for lesbians who are or have undergone ivf, specially for the non-carrying partner. We are in the very early stages of IVF and have just returned a positive test however a few weeks to wait until we know if our baby is continuing to grow. \n\nI think I am experience some pseudo symptoms of my wife’s pregnancy and can’t find a lot of information online. This lead me to reaching out for groups to discuss all the emotions and other things that come with being the other parent throughout pregnancy. Including judgement by others for example; it’s not your child because you’re not biologically related etc etc \n\nIf you know of any groups or forums like this please let me know. If there isn’t any but you’re reading this and this resonates with you and you believe something like this would be useful, please drop a comment and I’ll do some research to try and start something up. \n\nThankyou \n- A", "num_comments": 6, "score": 8, "top_comments": ["r/queerception"], "link": "/r/IVF/comments/13bjbkh/lesbian_parents_ivf/"}, {"title": "Disappointed by the lack of support from parents / in-laws", "content": "It’s not that they are being UNsupportive per se…but most  of my immediate fam (my dad, MIL and FIL) seem completely oblivious to how painful this is, and they are well aware of our fertility struggles / that we’re starting IvF. It’s like If I talk about it or share something,  there are no follow up questions, no concerns , no “wow that must be really hard how are you doing” - and then they never ask about it again or follow up for months. What the hell? Am I expecting too much? Is it a generational thing ?? I realize that most people just don’t understand this unless they have gone through it , but COME ON?! Like I thought most people knew it was hard even though they don’t understand the complexities of it. I’m just really disappointed because I expected so much more from them.", "num_comments": 22, "score": 12, "top_comments": ["I think people just assume it’s a thing you do if you’re having trouble having kids, it always works, and you will be pregnant soon. They don’t realize the emotional toll the entire process takes on you and that it may or may not work, which is torture.\n\nBut sorry you have to deal with that on top of everything else :(", "The people immediately around me keep saying “in my culture/when I was growing up, no one mentioned babies until you were 3 months along.” \n\nFFS way to dismiss the whole struggle and invalidate me completely. IF I COULD GET TO 3 MONTHS WE WOULDN’T BE TALKING ABOUT IT!"], "link": "/r/IVF/comments/16emt4a/disappointed_by_the_lack_of_support_from_parents/"}, {"title": "Intended parents meet surrogate", "content": "For those in the surrogacy journey, when you got a match and met with her did you feel an immediate connection? I had a match meeting and I feel confused. She was nervous and didn’t talk much and we didn’t have an immediate connection. She’s a first time surrogate. Would love to hear your experience with the process. If you did have an immediate connection, how important was it during the process? Thank you!!", "num_comments": 7, "score": 3, "top_comments": ["Hey I can't speak from my experience but my SIL had to go the route of surrogacy after many miscarriages. She wasn't seeking a connection so much as assessing that this woman was responsible, reliable, and authentic. For her after that was confirmed, it was more so... I hate to say it this way, a \"transaction\" of sorts. I need to specify also that this occurred in Singapore and not in the states or Europe, and also that my SIL is a type-A personality, boss woman who runs companies and is always straight to the point. So she may have not been there for that connection. I, like you, would've sought the connection because that's who I am too.", "I haven’t yet approached this route so I might feel differently if I do but, I don’t understand why it matters if you have a connection or not?"], "link": "/r/IVF/comments/139pre4/intended_parents_meet_surrogate/"}, {"title": "How much does parent genetic screening cost (USA)?", "content": "Does anyone remember how much the blood test for the parent genetic screening costs, roughly? My first clinic's protocol was to test the mother (me), and if any of the major genetic conditions came up in  my screening, only then would they test my husband. However, we are now likely moving on to DE, so my husband needs to be screened. My screening was so many years ago, I can't remember how much it cost.", "num_comments": 11, "score": 2, "top_comments": ["I think that depends on the company your clinic uses. Our insurance covered the screening but the copay turned out higher than the cash price. I called Natera (which our clinic uses) and they said I can just pay cash price, which is $349 if I recall correctly (haven’t received the bill yet).", "Mine was $8k and thankfully my insurance covered everything except a $50 copay."], "link": "/r/IVF/comments/pkxkpv/how_much_does_parent_genetic_screening_cost_usa/"}, {"title": "Parental pressure sucks", "content": "Life is already hard when on TTC preparing for IVF. On top of that if parents keep poking their noses,eyes,ears and everything on your business and keep saying “maybe you don’t want it badly enough” - I don’t know where to go. I’m having very negative thoughts too. Please help!  I need to talk to someone who gets it.", "num_comments": 31, "score": 11, "top_comments": ["We told our family to stop asking. Maybe you can set boundaries? And we didn’t share our IVF journey with them. I find it better to have fewer people know so I’m not always being bombarded with comments and questions. I share on my own terms.", "I would tell them that their comments are unhelpful & damaging. You already have enough going on without them adding to the stresses on TTC/IVF without their ridiculously insensitive comments. Tell them it’s not their place to bring this up and you won’t be discussing it with them any further. Best of luck with Your treatment ❤️"], "link": "/r/IVF/comments/rb037u/parental_pressure_sucks/"}, {"title": "Husbands or partners freaking out about becoming a parent?", "content": "I’m on day 14 of stim. I’m 34, husbands 40, been together 7 years, no kids yet, been trying for two years, first round of IVF. Tonight my husband had a total freak out about having kids, being scared he won’t like them, not knowing if this is what he wants anymore (even though we’re $20,000 into this thing), etc.. as things get more and more real for him in this process. Hearing all of this was like taking a freaking bullet. Anyone else’s significant other ever freak out as the IVF train steams forward? Im really really hoping this is all normal, and he’ll snap out if it.", "num_comments": 15, "score": 6, "top_comments": ["We have been trying for two years, three miscarriages that completely devastated us, $30k in the hole. Am now 22 weeks and my wife spent most of first trimester in this weird funk panicking about the same things your husband is. I was really upset. \n\nShe is now completely in love with her daughter and can't wait for her to arrive. I think sometimes we just need the space to feel the way we feel and work through it- IVF is a hell of an emotional rollercoaster.", "Honestly this is me, I try not to tell my husband to much but some days I think we are crazy doing this. Deep down I know I want it but the fear needs to get out first. Ether way he (as do I) have a responsibility to be gentle when talking about it."], "link": "/r/IVF/comments/o0vrl5/husbands_or_partners_freaking_out_about_becoming/"}, {"title": "Natera Asking Samples from my Parents for our PGD IVF procedure", "content": "Hello,\nIs this a mandatory procedure? I don’t want to get my parents involved.", "num_comments": 13, "score": 2, "top_comments": ["My partner and I did PGT-M testing on our embryo's through Natera. Initially, only the two of us provided samples. When results came back that we were both carriers for the same disorder, they did require us to have our parents send in saliva samples in order to create our very specific \"probe\" that could be used to check the embryos. If you need this test created, they should have had someone reach out to you from Natera that could walk you through the process and answer questions like the one you are asking her."], "link": "/r/IVF/comments/172hvan/natera_asking_samples_from_my_parents_for_our_pgd/"}, {"title": "Disclose egg donation to my parents?", "content": "I'm not sure if this is the right place to post this.\n\nFor context, my parents (divorced) are quite overbearing and use every opportunity to infantilize me, althought I am now in my thirties, well-established in life, good career, with my partner since more than a decade in a healthy and strong relationship, etc.\n\nIn the recent years I've started info-dieting them and it improved my mental well-being tremendously. I can now make my own choices without any of their pressure to do as they see fit. My younger sister has *always* info-dieted them, even as a child or teenager she would keep to herself and confide in me instead of them, so she hasn't experienced what I have.\n\nMy partner and I have eggs and embryos frozen. I am not infertile, they were collected for other severe health reasons.\n\nNow onto the problem. My partner and I are considering using an egg donor for our IVF pregnancy(ies) because with all the health issues I've been through since our preservation process years ago, we aren't sure passing on my genes would be a good choice for us. (No judgment to those who would... it's just what currently feels best *to me*) We wouldn't discard our own frozen eggs and embryos for the time being. We'd plan on disclosing their origins to our children and wouldn't treat this subject as \"taboo\" or anything. However, I wouldn't want to tell my parents. I wouldn't mind if he chooses to tell his. My sister believes I should tell our parents because since I don't treat that as a secret, she says our children might tell their grandparents and then they might be hurt to learn it from them and not from me, and that they might wonder why I haven't told them. Actually I would LOVE for them to wonder this and reflect on their negative attitude towards me... Honestly I wouldn't care however they learn it, if they do learn it or not, etc. However I wouldn't want to burden my children with the issue like a hot potato. I don't think my parents are \"owed\" to know anything about my reproductive/sex life. However this decision implies their genes and their own feelings of \"legacy\" as well, so althought it's mine and my partner's decision, it still impacts them (emotionally), so I feel that they should know. However they wouldn't react well to the news and be very critical of our choice and I wouldn't want to deal with their judgmental comments, while pregnant or even anytime later.\n\nI know I don't \"HAVE\" to tell my parents about this, but what would be the right thing to do in this context - emotionally, psychologically, morally?\n\nTIA!", "num_comments": 12, "score": 4, "top_comments": ["I would probably tell them but perhaps later after a child is born. What I have learned as a person who used donor eggs is that the only way to approach any disclosure is what is best for the child. So your parents’ feelings or punishing them or anything should not factor into the equation at all. What is best for the child is essential. Generally that means being open with people in the child’s life from the outset so the child always knows their conception and genetic story"], "link": "/r/IVF/comments/11pw9h9/disclose_egg_donation_to_my_parents/"}, {"title": "Market Survey for Connecting Recipient Parents with Half-Siblings", "content": "I am an assistant for a genetic counselor who works specifically with donors from the only sperm bank in the country that is non-profit. We are looking to create a database where you can anonymously share medical data about your donor-conceived child with his/her half-siblings (since donors are unreliable about adding additional health information). There is a LOT of information you can garner from their half-sibs, especially if there are several.\r  \n\r  \nWe have a market survey we'd love for you to fill out so we can get a sense of what DCPs and RPs are looking for / any concerns they might have with such a database. Thank you so much: [Qualtrics Survey](https://qfreeaccountssjc1.az1.qualtrics.com/jfe/form/SV_0Gr2PDLI8O8aTHg)", "num_comments": 0, "score": 1, "top_comments": [], "link": "/r/IVF/comments/1608w0x/market_survey_for_connecting_recipient_parents/"}, {"title": "38/F and single parent may be my only option.", "content": "Please share your stories about choosing to do IVF on your own. I am ready to start cycle 2 and am on the verge of choosing donor sperm embryos. I plan to wait 1 year before attempting FET. Feel free to read my lengthy story below.\n\n  I turned 38 with an on again, off again boyfriend and a realization that my time to find \"the right one\" was up.   I am not ready to be pregnant right now as I am single, couldnt afford the childcare, living away from family, and have a new excellent job.  I made an appointment and found out I have a complex cyst in each ovary and low reserve.  My resting follicle count was only 4. \nMy doctor recommended making embryos so that we know what we are working with, and they have a higher survival rate.  Being in my situation I decided on just eggs to give mr right a chance to show up in the next year or so.  \nCycle 1: 4 follicles, turned into 5! Several smaller ones they didn't really mention.  They told me best case scenario was 4 eggs, and prepare myself for less.  At trigger day only 2 were above 16mm and three were in the 12-15 range.  Retrieval: 7 eggs! 4 mature/3 not.  2 of the immature eggs matured overnight giving me a total of 6 eggs! \nI was so happy, but my dreams of a child are so far away.  Reading about it, the chances of a live birth from 6 frozen eggs are very low.", "num_comments": 13, "score": 1, "top_comments": ["Hi I’m 41 and I’m actually doing this on my own. I wish I would’ve done It sooner!  When I originally started the process earlier this year I was going back and forth about freezing my eggs or embryos.  I ended up doing embryos because I am older. Im so happy I did. I had 22 eggs retrieved but only 4 made It to blasts and two were abnormal and two were mosaics. I did a second cycle had 19 eggs retrieved only 3 made It to blasts but 2 tested normal. So now I have to embryos on ice. I’m so happy I decided to go with the donor sperm or I would’ve just froze that first batch and waited a year and It might have been too late to do another retrieval. You’re still under 40 so you should have higher quality eggs but if you know for sure you want a child I say go for It. You only have a small window to have a baby but a lifetime to meet that significant other!"], "link": "/r/IVF/comments/jsgdsl/38f_and_single_parent_may_be_my_only_option/"}, {"title": "Is anyone else doing this journey as well as being a step parent?", "content": "Sometimes I have some... complicated... feelings about parenting my step son and it does my head in. Can anyone else relate/ offer advice? We have him full time and currently his dad is away so I'm doing this on my own while starting meds for a fet in a week or so. I love him to bits but I am hyper aware of being tougher on him than I usually am. But he's also going through a testing boundaries phase.\n\nI don't know if I'm being tough on him to reaffirm the boundaries or I'm being tough on him because I resent him. I feel horrid for saying that and I'm being so careful to be fair but I can't help, late at night, resenting the fact that I'm parenting someone else's child when I can't have my own.\n\nGod it feels good to confess that. There's no way I could say this to anyone in real life.", "num_comments": 13, "score": 17, "top_comments": ["I really don't think it would be shocking or surprising for any step parent in this situation to have these feelings. It is only natural.\n\nWhat really shines here is that you are aware of your feelings and you're concerned enough to share them. That speaks volumes about how much of a caring woman you are. \n\nIf it helps, we are reading two books by Amy McCready called \"if I have to tell you one more time\" and \"the me me me epidemic\". We are putting together a plan to help the tween feel happier and for us to get some sanity back.\n\nGood luck with your FET 🥰", "Your feelings are valid and I’m glad you can share safely here with us :) good luck with your FET!"], "link": "/r/IVF/comments/mjsrdl/is_anyone_else_doing_this_journey_as_well_as/"}, {"title": "What to say to parents-in-laws who keep asking for 'Good news'??", "content": "Rant.\nMy father in law is a weird man with no filters. He asked today over phone call 'So when you're giving us the good news? I laughed it off and said no news as of now. He laughed and said your mom in law will tell you how to get good news and passed the phone to her. Now she's nice and understood I must be pissed and just changed the subject. \nIm sooo annoyed right now!!! Firstly they dont know we're doing ivf but have been trying 2 years now. He doesnt know I know Faaar more about 'how to get good news'. Why would be even assume I dont know how to make a baby?? \nSecondly why didnt he say it to his son??!!! Whys the burden on me?? \nI know it doesnt mean anything but im just soooo pissed that I think im gonna take my anger out on my husband!! \nRant over. Thanks for listening.", "num_comments": 32, "score": 33, "top_comments": ["Eww. Besides all the things you already said, it’s just creepy. Maybe your husband needs to tell him to shut up about it and that when you have news you’ll let them know", "If he says it again respond “Well of course, the good news is I haven’t cussed you up and down for prying into our sex life. Ask again and I can’t promise your good luck will keep up.”"], "link": "/r/IVF/comments/x4yic6/what_to_say_to_parentsinlaws_who_keep_asking_for/"}, {"title": "Advice needed: How did you explain the fertility process and IVF to your parents and/or in-laws?", "content": "Looking for some advice on explaining the fertility process to my in-laws. We have been battling infertility since May 2021 and were recently informed we now qualify to go on the government funded IVF cycle list (we are located in Ontario). We have been told the list is 15-24 months. This is obviously not how we ever imagined starting a family. \n\nMy in-laws do not seem to grasp the magnitude of battling infertility. We have tried to explain it but it doesn’t seem to be clicking. We get responses like “this is so exciting a grandchild.” Or “well it’s just some  extra appointments” or “lucky OHIP/Insurance pays for it”.  \n\nI do want to say I do not think they are intentionally being unsupportive or anything I just truly do not think they understand. This also would not be their first grand child. \n\nDoes anyone have any suggestions on explaining this process to them? It is tiring enough without feeling frustrated about their comments etc. \n\nWe have MFI. My in-laws don’t know this, they are under the impression we have unexplained infertility.", "num_comments": 40, "score": 18, "top_comments": ["We shared quite a bit with our families at the beginning. Then it became more challenging with losses and them not being as supportive as we needed. I found a happy ground with ILs by saying they could always expect that we’re either planning for a next step, in the process, or waiting to see if that step worked at any point in our lives until we tell them something different. Hope that helps!", "I always feel sad when people share on here that they can’t share their IVF struggle with their family.  My dad is a doctor, and even though my parents are in their late 70s (sometimes older people are more set in their ways) they are so supportive and into every detail of my process. They are supportive of every follicle count at every monitoring appt. And at age 44, when I have only gotten 1 blast from each of my 2 retrievals (the first blast failed testing, 2nd blast still out) they have held out hope for me when I have lost hope. Granted, I know not everyone’s families are as open-minded and scientifically inquisitive and religious zealotry can be an issue too. \n\nI will say, I have learned in being super open about my process that the majority of people respond by saying “congratulations!!” This used to really piss me off! Like, they’re congratulating me that my clinic ruined all my frozen eggs from my early 30s and now I’m probably going to be childless because IVF most likely won’t work at 44 but in the meantime I’m gonna go through expensive torture?? But I’ve come to realize that the average person just thinks IVF means you’re trying for a baby and they want to say something positive, so I’ve accepted it as a kind gesture. My therapist said he always says to couples undergoing IVF “that’s such a hardship. My heart goes out to you.” But he’s a doctor and a specialist in emotional support. We can’t expect that from average people. \nAnyway, I’m rambling. I believe it’s important to have support from family and friends. And people may need a lot of education to get there. But that’s my style of relating. My boyfriend is more private and was hesitant to share with people. But I explained to him that if in a year or two I was devastated that this didn’t work for us, I wanted my support system to have been ON the journey with me and be there beside me as opposed to having to catch them up on why I was devastated.", "I would adise two things.\n\n1. Be selective on who you share your journey with....... Many people will truly not understand, even after it's explained to them in detail.  We have a small circle compiled mostly of friends that know the details and receive updates, but family is kept to a bare minimum.  I learned that their comments, insensitivity, and lack of understanding can cut the deepest.\n2. If you share that you are going through IVF, that doesn't mean you need to provide updates or details....  When people ask for updates, we respond with \"I don't want to talk about that right now\", or \"we will share with you when we are ready.\"  You don't owe anyone anything.\n\nI did refer family members to podcasts for learning materials.  Dr. Natalie Crawford has a great podcast with tons of episodes.  She explains IVF in great detail!", "I honestly didn't tell 3 of 4 of them. My MIL is the only one I told because I am very close with her. And I told her after an emotional retrieval cycle. I was very honest and very raw, and we cried together. Despite having 4 children, she had 3 miscarriages herself and had a medical issue that caused all her kids to be premie. So, while she had never been through ivf, she could empathize with loss, the extreme desire to expand her family, and the fear of loss during each of them etc. But anyone I thought would be judgemental or put pressure, I simply didn't tell. That's your choice, but my take while i was going through it was to only let people who would be supportive be in the know.", "Resolve.org has resources for family members that you could share"], "link": "/r/IVF/comments/117sjgg/advice_needed_how_did_you_explain_the_fertility/"}, {"title": "Do both parents need to be a genetic carrier to pass on a recessive disease?", "content": "I apologize I’ve been a regular on here but you’ve all helped so much as we prepare for our first ER (stims start Friday) and I’m unable to meet with a genetic counselor for 2 weeks. We just got back our genetic screening and husband isn’t a carrier of anything. I found out I’m a carrier of “sandhoff disease”. No one in my family has any diseases so this was surprising. Since my husband is negative, is there any benefit in PGT-M testing our embryos for this? It’s 8k at my clinic for PGT-M testing so I want to be confident it’s necessary.", "num_comments": 15, "score": 6, "top_comments": ["No need for PGT-M unless you both are carriers. Recessive genes need two recessives for the gene to “show itself” on someone. I’m a carrier for something that is completely random but it doesn’t matter as long as the sperm isn’t also a carrier."], "link": "/r/IVF/comments/143nyzc/do_both_parents_need_to_be_a_genetic_carrier_to/"}, {"title": "Managing your parents through IVF", "content": "I've told my mom that we're going through IVF and, in her effort to be supportive, she said all the wrong things. How have you managed support from your parents? Have you needed to educate them?\n\nI love my mom and want to confide in her but after a few triggering things she's said, I don't want to talk about IVF with her at all (even though I do). How have other managed this aspect of infertility/IVF?", "num_comments": 28, "score": 7, "top_comments": ["This is the exact reason we didn’t tell anyone. They mean well and they want to be supportive but unless you’ve gone through it you really don’t know what to say. Maybe try searching for some blogs regarding supporting someone through IVF and politely provide them to her as a resource, maybe that would help?", "I’m going through the same thing with my mom. Thank God I have my stepmom.", "We told my parents and siblings about it only. All of them stood back and didn’t engage. I think mostly due to not understanding, which we were totally ok with. They were there if we needed help around retrieval time. Recovery sucked for me. \n\nIf you would like active involvement from your mom, educating her is the best course of action. It’s a tough journey for all of us. Please don’t let her involvement stress you out more. If you feel like she needs to step back, tell her. Communication is so so important, especially between you and your partner."], "link": "/r/IVF/comments/kbtdft/managing_your_parents_through_ivf/"}, {"title": "When genetic testing reveals more about the parents", "content": "My husband and I recently finished our first cycle of IVF and were grateful to end up with a few blastocysts at the end for genetic testing. We just got the results back and they were surprising--one completely normal, and a few with a chromosomal abnormality that appeared in the same place for each, which indicates that either my husband or I have the same thing going on in our genome. We are going to pursue genetic counseling to learn more about what this might mean for one of us or our potential kids. Our doctor thinks it is likely just a benign difference given that we don't appear to have disabilities or serious medical ailments, but I can't help but wonder, what if it's not? In IVF, we try to prepare ourselves for so many disappointments and unwelcome results, but this is not one I was prepared to hear. Has anyone else gone through this before? Also sharing because the conversations surrounding genetic testing often focus on the embryos--but you might learn something about yourself in the process, too. That's something I wish I had thought about more before starting this journey. #ivf #genetictesting", "num_comments": 12, "score": 7, "top_comments": ["We did genetic counseling before starting. It reveal a micro deletion in my fiancé Y chromosome and for me it actually showed I have alpha thalassemia trait. I’ve always struggled with anemia, not so bad but at one point needed blood transfusions. I had all kinds of testing done with no diagnosis until I did the genetic test! What I have is very mild but it explains so much!", "This was how I discovered an inherited balanced translocation for myself - it was a super stressful time and I totally agree I wish the doctors were more transparent about what they could find during PGT, but since it is so infrequent I think they just don’t want to scare people. Genetics is also such a new field and it’s very complex, even my genetic counselor couldn’t give me a ton of info about my specific balanced translocation. For reference, 3/4 of my embryos had trisomy and monosomy on the same chromosomes (7, 17). For example, one embryo was listed 46 xx (-7, +17). This is what led to their suspicion of a BT and later was diagnosed via karyotype test."], "link": "/r/IVF/comments/vdl5dz/when_genetic_testing_reveals_more_about_the/"}, {"title": "Looking for My Parents' Egg Donor", "content": "I'm not sure if this is the right subreddit, but my parents used an egg donor to conceive me and my brother, and they've always been open about that. I'm interested in finding her or meeting any half siblings I might have because we know that she had donated before. Does anyone know where I should start?", "num_comments": 5, "score": 2, "top_comments": ["I think the best place to start is with one of those DNA kits that also connects you to relatives. I believe 23 and Me is a popular one."], "link": "/r/IVF/comments/vgbm78/looking_for_my_parents_egg_donor/"}, {"title": "Why are YOU personally having ivf/fertility treatment?", "content": "Medical problems? Same sex relationship? Single parent? Im just curious 😄\n\nEDIT: wasn’t expecting so many responses, thanks for the answers everyone ", "num_comments": 153, "score": 5, "top_comments": ["Personally, I just love needles and lighting money on fire....jk! I guess medical problems, but the doctor has never been able to figure out what that problem is.", "Genetics. I have a genetic condition that I don’t want to pass on, so we are doing IVF so we can test for it", "Time is ticking and I haven’t found a partner. But I’m sure once I’m done he’ll show up 🙄 I feel like this may have been a waste of money and time.", "Severe MFI!\n\nThis one may be the most straightforward in terms of prognosis (in fact, we found success within a few months) but it probably has the most delicate and complex nuances to the relationship because the party that has no part in the diagnosis is the only party paying the price with her body. Some people here have berated me that “it’s not his fault” and “you are infertile too” perhaps in their own defense more so than in my husband’s, but they don’t know us and our full story :)", "Husband and I tried for 3 years and did multiple IUIs without a pregnancy, then started IVF. We’re on the “unexplained infertility” boat.", "Anovulatory PCOS! Tried medicated cycles and still had issues ovulating so pretty quickly transitioned to IVF", "Partner had chemo!", "35+. Adenomyosis. Secondary amenorrhoea due to PCOS.", "I told myself I would never do IVF as I didn’t want to spend the money if it didn’t happen naturally - then last year I got pregnant naturally and quickly but ended up having to have a TFMR half way through the pregnancy due to a chromosome abnormality. Now being 41 and with very few eggs- my mind has changed. It feels like the best way to give it all I can & to get rid of any “what ifs” I’d be left with if I didnt.", "Male factor infertility for us. Husband has low count, low motility and morphology.", "I have hydrosalpinx from untreated chlamidia when I was a teenager.", "I'm doing IVF for MFI. My husband has plastic mesh in his testicles due to hernia surgery as a kid. Back in the 80s, they thought it was cool to put forever chemicals everywhere.", "We had 4 boys naturally/ 1 with the help of clomid. I wanted a girl and I was 100% tired of the gender disappointment so we did gender selection IVF. We have 1 mosaic boy (we plan to donate him to science for research) 1 we didn’t get a good enough sample and are un sure of. And we had 2 genetically normal females. We transferred one 2-13 she stuck and now we are waiting to see if we would want to go through it again to give her a friend/ sister. If not we plan to give them to embryo adoption. We had started with 13 eggs 9mature 5 fertilized and 4 made it to day 6/7 embryos!", "Unicornuate uterus!", "Husband had leukemia twice as a child and is sterile as a result. We used donor sperm and because of the cost per vial and being older (36 starting) and the fact that we wanted more than 1 kid we went straight to IVF. Just delivered our baby girl in January and going back at the end of the year for transfer #2.", "Severe endometriosis caused me to have a surgery to remove large cysts from both ovaries (they were the sizes of oranges)! The damage to my ovaries was major, but I couldn’t keep those endometriomas and have a chance of getting pregnant. Lose-lose situation unfortunately. Only my left ovary was able to provide eggs, and my right is basically dead. I had 0.60 amh when I started ers and it plummeted to 0.08 by the last round. Now I’m on my first transfer! Beta tomorrow 🤞", "RPL & Endometrial Hyperplasia (very early cancer) found in my endometrial lining from excess estrogen. Turns out I had been living my life with undiagnosed PCOS and my husband's sperm are crappy 🤣", "PCOS. About 5 years of trying and nothing. Also my partner and I are both carriers of a genetic disorder we found out through IVF process, so it just so happens to work out that genetic testing really helps so we didn’t transfer an untested embryo. I am pregnant now so it really is worth it all the needles the appts the emotions I would do it again and again", "My husband and I just waited too long to start trying and now I’m old and he has MFI.", "MFI", "I had a ruptured appendix as a child, which went untreated for a week and resulted in severe scarring in my abdomen. I had an ectopic pregnancy 4 months after getting married, which also ruptured, and my remaining tube was damaged from all the scar tissue leaving me unable to conceive naturally.", "I’m old (43) chances of getting pregnant on my own is smaller than through IVF, add MFI to boot.", "I'm a surrogate!", "I have unexplained infertility and in light of my pgt results maybe I'm just old leading to chromosomal abnormalities. "], "link": "/r/IVF/comments/1b44vel/why_are_you_personally_having_ivffertility/"}, {"title": "Cautiously Optimistic - Older parents donor eggs", "content": "Long time lurker, first post.\n\nBeen through IVF hell. Wife 46, husband 49. Husband posting this. Began this journey two years ago with a natural miscarriage that never had a heartbeat. Newlyweds but through lots of personal drama (divorce, parents) made us realize we wanted children. No previous children on either side. Decided out of the gate to use donor eggs due to our age,\n\nGreat results with PGS tested embryos: three normal, and three mosaics. Currently on our third transfer.\n\n1st transfer: did not take with our “best” embryo.\n2nd transfer: second “best” embryo, never saw a heartbeat, miscarriage around 4.5 weeks.\n\nLupron treatment \n\n3rd transfer: Amazingly high HCG levels, heartbeat at 6 weeks 3 days ultrasound is 130, but there is a hematoma and we are monitoring. Next ultrasound in 6 days.\n\nIt’s a brutal process and thanks for listening. Hoping for success.", "num_comments": 9, "score": 35, "top_comments": ["Amazingly high HCG levels usually implies a really good chance it will work out! I’ve read many studies and while sometimes high HCG implies multiples, the most important thing is that it implies a very healthy attachment and really good chances of it working into a successful pregnancy. Best of luck… keep us updated!", "My sister had a hematoma in her non-ivf pregnancy. She had to spend a lot of time in bed due to the size of it but my nephew is 4 years old and healthy. Wishing you guys a healthy pregnancy!"], "link": "/r/IVF/comments/pknuag/cautiously_optimistic_older_parents_donor_eggs/"}, {"title": "How does your family (parents, siblings, in-laws) react to your IVF journey?", "content": "", "num_comments": 20, "score": 7, "top_comments": ["So I’ve given my mother in law an update on my egg retrieval and it’s just clicking with me that I low key think my in laws are against it. They’re strong in their faith and my MIL responded to my update “let’s let god do the rest” and I’m probably reading into it but it made me research her religions view on ivf and that religion is very very against it. So it made me wonder if her comment insinuated that we weren’t letting god do his job or if it was just something someone who doesn’t know what to say would say. But basically I’m gonna stop updating them at this point. I HAD to tell them we were going through this because all I heard for 2 years was when are you gonna have a baby. And I got sick of bouncing around the subject, but I wish I was more private about it honestly. I never realized how certain religions are really against this stuff and it makes me sad", "I'm doing reciprocal IVF with my husband (who's trans) so we're using his eggs and donor sperm. When I first told my mom she was incredibly insensitive about the fact that we weren't using my eggs (and for the record, I likely have DOR so I'm actually incredibly *lucky* my husband can provide eggs as donor sperm is much easier to get). She effectively insinuated that any babies wouldn't really be her grandchildren, which is wild because I have a niece who was adopted and she would *never* say something like that about my niece. It hurt a lot and I cried a ton. I wound up telling my dad about the conversation, who apologized on my mom's behalf and must have intervened because my mom's tone totally changed after that. Since then they've been really supportive, and I've been keeping them updated basically every step of the way.\n\nMy husband hasn't told his parents anything, because this is likely their only shot at have biological grandchildren and he doesn't want to have that added pressure. We'll for sure tell them it was IVF if it works, because I'd love for them to know we were able to use my husband's DNA, which is pretty special all things considered.\n\nI haven't told any siblings yet, mostly just because my siblings and I don't often talk about that kind of stuff. They'd probably just be like, \"oh that's cool good luck\" lol."], "link": "/r/IVF/comments/uhxfrt/how_does_your_family_parents_siblings_inlaws/"}, {"title": "Are there any parents in here that are carriers of Congenital Adrenal Hyperplasia? Any parents of affected children with CAH?", "content": "If both parents are known carriers, how did you go about pregnancy?\n\nIf your child is affected, what does the child’s life look like and how has life for your family changed?\n\nMy wife found out she is a carrier of SW CAH and I just found out yesterday that I’m a carrier of NC CAH. We’re exploring our options for pregnancy now. \n\nThank you for any responses.", "num_comments": 11, "score": 2, "top_comments": ["Hi- came here to elaborate more on my response in the endo sub. \n\nYou may be able to be PGT-D (that is, genetically test your embryos to look for that specific mutation,) and opt not to use those embryos. \n\nI didn’t have to go this route, because my husband isn’t a carrier, but many people do this to achieve a healthy pregnancy (ie folks who carry CF, Tay Sachs, etc.) Your best bet would be to speak to your local IVF clinic, ask what lab they use for PGT and ask that lab if they can PGT for CAH."], "link": "/r/IVF/comments/k9d7gv/are_there_any_parents_in_here_that_are_carriers/"}, {"title": "Parents trying to empathise when I know my chances are low", "content": "I'm in 2ww of my third and final cycle. It became obvious during cycle 1 that my chances were low. Out of 3 cycles I got 43 eggs of which only 2 became embryos. I've been slowly accepting and grieving throughout.  \n\nI am only talking to friends I trust and a therapist to deal. A colleague and a sister, both of whom have a daughter bug me for updates. I tell them I don't wish to discuss it, but they have both said the following to me \"I know how you feel. I tried for years to get pregnant after *child's name*. I had to grieve for the other children I wouldn't have as well.\"\n\nErm what? Telling someone who can't get pregnant that you empathise because you couldn't have more children is pretty insensitive. It's like someone with one eye complaining to a blind person about how much they miss their other eye.  Oh I'm sorry you don't have depth perception anymore.  I get they're trying to make me feel better, but it does the opposite. \n\nAnd I think I need to change therapists. It's all over Zoom and she leaves her baby monitor on and I can hear her baby cry in the background whilst I am processing my unsuccessful IVF. I can't tell if she is being unprofessional or I am being too sensitive. \n\nApologies if anyone thinks I am being flippant about people losing their sight. I was just trying to find an analogy.", "num_comments": 6, "score": 14, "top_comments": ["Those are definitely not helpful comments, people don’t get it so I try not to let it bother me, but it hurts. There’s a big difference between not having more kids and never being a mother, I think people forget the pain of being childless \n\nI found an amazing therapist who is also going through IVF, I suggest you find one that understands infertility and will say that fucking sucks, doesn’t just feed you feel good therapy lines.", "I don’t know if you’re still looking, but there’s a great therapist who specializes in IVF, Dr. Loree Johnson. She’s gone through IVF and TFMR so she knows it all."], "link": "/r/IVF/comments/w8ps7s/parents_trying_to_empathise_when_i_know_my/"}, {"title": "IVF is hard and my parents are the worst people ever. What are my options?", "content": "I’m about at my wits’ end with my parents. They decided to weaponize my failure to conceive against me and the last modicum of respect I had for them flew out the window. (We were never close). My only hesitation to cut them off entirely is my mother’s known tendency to make private information public and trying to isolate me and make me out to be the villain to the rest of my family. My siblings wouldn’t buy it for a second (they’re close with me) but that didn’t stop her from reaching out to them after our conversation telling them to tell me to get over myself when I didn’t react great to her calling out my infertility (she KNOWS we’re TTC). I’m concerned about her actions and words against me to the rest of the family if I cut them off. \n\nAnyone else go through this family drama (or similar) whilst going through IVF? I don’t want this stress factor lining up with my FET. \nI don’t live in the same state as my parents. Do we do virtual counseling? What if the other party are incorrigible asshats unwilling to change? \n\nSorry for the vent or if this is a little unrelated. This is just really hard. My baseline ultrasound for my FET is in two days.", "num_comments": 15, "score": 8, "top_comments": ["I’m sorry you’re going through this. I would honestly stop communication even if it’s temporary. You deserve a loving mother, not a nightmare. I would ask yourself if you can allow her near your child after all of this? Will she treat your child the same way?", "I'm very estranged with my in-laws. My son was in the ICU for 6 months when he was born and the majority never even reached out during that time. For me it's best to live my life without them.", "✂️✂️✂️ Snip snip. Cut them out. They won't change. If the family sides with the woman who birthed you (sounds like she doesn't even deserve the title of \"mother\"), do you even want them in your life? \n\nThe family that loves and respects you will stick around. And, you can reach out to them if you want to ensure they are hearing YOUR side. And your mental health will be all the better for it."], "link": "/r/IVF/comments/wuzx2n/ivf_is_hard_and_my_parents_are_the_worst_people/"}, {"title": "Lonely journey — I’m not telling anyone about IVF other than my parents.", "content": "It feels so lonely and stuck and sometimes I wonder if telling more people would bring more positive energy and luck into my life but right now I’m\nparalyzed and I don’t think I could share. I’m both embarrassed and afraid that sharing with people would just dilute my energy that needs to stay focused and inward looking.", "num_comments": 12, "score": 10, "top_comments": ["I brought up the fact that I was going through IVF at this book club I was part of, then again brought it up during an antenatal class. Both times literally half the room said they too were going through or had been through IVF. I learned that random colleagues at work also went through IVF.\n\nIt's an incredibly common path these days and is only becoming more and more so.", "The only person I told is my sister in law who is a therapist. I did not even tell my mom or any of my family, friends. To me, I'd rather deal with the stress from IVF and infertility alone than dealing with the stress and nonsense from other people. I know it may not be healthy, but that's my choice. I don't have a good relationship with my mom, I am jealous at y'all who can share your journey with moms."], "link": "/r/IVF/comments/q5jb1n/lonely_journey_im_not_telling_anyone_about_ivf/"}, {"title": "Inviting advice and perspective to help us become parents a second time after 8 years!", "content": "Hello! Look at me rallying after a recent no score FET. \nIn 2014 at age 30 we froze 7 embryos at Day 2. (Not certain 2 days of growth = embryos.) All original male/female contributions from us. \nWe transferred one via FET... and it worked... and he's 6.5y.o. \nSince then I have requested to schedule a hysterectomy due to endometriosis. I don't currently have impact from this on my reproductive ability. (That's settled so I need no advice on that, thank you though, I know folks will want to help.)  I was asked by Drs to check in and see if the hysterectomy was going to cause any regrets and found whilst soul searching that it may do. Not helped by son wanting a sibling. \nSo like I mentioned, 100 years after starting IVF we thawed these patient things and managed to keep 2 going. Transferred one at Day 2 (just for old times sake). No bueno. The other was refrozen at Day 5 /blastocyst. \nSo, when my cycle starts after FET meds wear off we plan to transfer the last little soldier. \nBut...should we instead do a stim/egg retrieval given the rates/statistics etc and bundle all the focus & energy into one activity at a time? (So like, egg retrieval then transfer transfer transfer (hopefully not etc) VERSUS transfer, cry, egg retrieval, transfer, transfer, celebrate being an actual fossil, etc. \nIf you haven't picked up I am also terrified by being So Much Older Than I Was. \nGot any ideas or experiences you'd be happy to share? Thank you!", "num_comments": 9, "score": 0, "top_comments": ["I would also try with what you have, see how it goes and then jump back to stimming etc unless your AMH , AFC, and FSH tell you to hurry up.\nIf they are comforting, you are just as much a fossil now as you will be in 4 months from now. So no worries 😉\n\nThis is coming from a 40 year old pregnant lady who really loves bragging about how being older and expecting your first child is a great. I know your perspective and life situation may be very different and I don't know what exactly makes you anxious but there's lot of good things for you and you family in it. \n\nFor example being more mature, calmer, and it sounds like your child wants be part of this journey of welcoming a baby which he can now that he is older."], "link": "/r/IVF/comments/soyxtk/inviting_advice_and_perspective_to_help_us_become/"}, {"title": "TikTok just showed me a video about how IVF is morally wrong", "content": "I'm kind of in shock because I didn't realise this level of ignorance even existed. \n\nThere I am doom scrolling and I get a video about how IVF is unnatural and the poor babies etc. How being a parent is not a right, if you can't have kids naturally you shouldn't etc. That the \"poor souls\" of embryos not used are thrown away etc.\n\nFirstly, I would've thought the algorithm knows enough about me by now that I am NOT the target group for this. Shame on you TikTok!\n\nSecondly- I'm just so angry! Does a man discard 1 million \"souls\" when he ejaculates into a tissue ? Its just so ridiculous and made me so sad that there are people who could ever think that this is like shopping for handbags or puppies.\n\nI just needed to vent to a group who understands why I am so upset. Thank you 😂", "num_comments": 128, "score": 159, "top_comments": ["Fuck them. My wife best friend when she knew we will go to the IVF option said IVF is against god’s decision to have or not to have a baby. That day my wife stopped to speak with her. We have enough BS with the IVF to hear the BS from another a**holes (apologies for my language) 😓", "Yeah no fuck that concept and fuck that video and fuck those people. We aren’t doing anything wrong. Don’t let stupid minuscule things like that get to your head. ❤️", "Yes, I wish I could be publicly open about my IVF journey. Only close friends and family know our struggle. However, there are so many ignorant, judgmental assholes out there. How my son was conceived is none of their business. I’m not going to subject my child to them or their ignorant beliefs!\n\nhttps://preview.redd.it/lltfzw9p01cc1.jpeg?width=2000&format=pjpg&auto=webp&s=8157916a4ab3b3adabb966458c43e56c82c0c3d6", "My response to anyone who would want to call it immoral or unethical is I hope they feel the same way about other medical interventions. Diabetics need synthetically produced insulin. Chemotherapy and radiation for cancer. Organ transplants. The list goes on. These are the same people who think birth control medication is only used for preventing pregnancy, when a huge number of women use it to regulate hormones (how many women in same-sex relationships use birth control, right????). There is a huge underground movement from right wing conservatives to control women’s bodies, and this is part of that. There are a lot of people who don’t understand IVF, and anything they can’t understand is scary to them so they just oppose it. Bottom line, fuck ‘em because they don’t have a say in your healthcare. However, it’s important to speak against it and be wary of these groups because they’re becoming louder and gaining traction, and that is incredibly dangerous for everyone.", "Reasons to get off tiktok….", "Stay far away from that side of TikTok, I came across a video of a woman bragging about how easy it was for her to get pregnant and that infertility doesn’t exist. Basically she claims women struggling with infertility aren’t trying hard enough WTF. I stay away from TikTok for that purpose. People are stupid and ignorant to problems they don’t understand 🙄", "People are weird. Some people think people born on Halloween have no souls/are the devil. And I’m sure these people don’t do anything “unnatural” themselves. 🙄", "Yeah you’re right… my husband shouldn’t have gotten testicular cancer rendering him unable to produce his own sperm, making our only option IVF. Guess he shouldn’t have gotten chemo and surgery either… sooo unnatural 🙄. I hate the internet sometimes - makes me so mad. Ha!", "Well if that’s there thinking I assume they have only ever had sex in order to get pregnant. Otherwise think of all those poor sperm just being thrown away 🙄 I understand not everyone wants to use medical intervention but that doesn’t make it work if the devil.", "The sick thing is that many of these people who ignore science for religious reasons actually adopt embryos because it's the cheapest form of adoption.", "Honestly I can't wait until these people all get covid or the next pandemic because they won't vax...die.", "I think this convo has unfortunately had a resurgence this week due to the pope’s misguided comments regarding surrogacy.", "[deleted]"], "link": "/r/IVF/comments/194r3ge/tiktok_just_showed_me_a_video_about_how_ivf_is/"}, {"title": "Drained", "content": "I don’t want to fucking do this anymore. I hate IVF. \n\nI hate being part of this shit club. I’m so sick of getting my hopes up only to have disappointment after disappointment.  \n\nI’m so sick of everyone around me not getting it and saying the wrong thing and having babies and telling me how hard it is to be a parent as if I’m lucky to be an infertile, barren, childless “auntie.”  I don’t want to be the aunt. I want to be the mom. \n\nI want good news. I want hope. And I know from being on here that even IF we ever make it to a positive pregnancy test, I’ll be waiting for the other shoe to drop, I’ll be unable to experience the joy and excitement that people have when they conceive naturally with no loss history. \n\nEven my husband doesn’t get it. The man who is constantly negative and pessimistic in every other aspect of his life hears anything that’s not a 0 and says “I’m excited” or “I’m hopeful.”  But all I hear is only 25% of our fertilized eggs made it to blastocyst, 33% euploid when my age should mean 67%. He even said “quality over quantity” to me which is wild because I look at these attrition rates and immediately think THIS IS A QUALITY ISSUE. AND he wants 3 kids which means we also need quantity! Then he says to me maybe we give up on 3 and just focus on one and loving that one will all our hearts. Yup. Let’s just keep giving up/giving in. Give up on conceiving naturally. Give up on having more than one. Next we’ll give up on using my eggs. Give up on being a parent. “Have you thought about adoption?” As if that’s the same thing. As if that’s an easy (or affordable) path. Give up on being a mom. “Maybe it’s not meant to be.” I am so sick of conceding and so sick of the total lack of control over any of it. \n\nAnd I know I’ll get responses on here from some who have it worse telling me that they would kill to be in my position. To have any make it to blast or to have any euploid. And they’re right I’m “lucky” to have any of this working at all. But I ask…\n\n\n\nAre any of us here actually lucky??", "num_comments": 133, "score": 203, "top_comments": ["While I cannot wait for the day when I no longer check this sub every day, hourly, for some new piece of information that can help us, it’s also undeniably the kindest and the most compassionate community I’ve ever been a part of. \n\nThe journey sucks for all of us in different ways, but nevertheless, I’m glad that this community is making it a little less difficult along the way.\n\nI won’t tell you it’s going to be okay - I’m sick of hearing that myself. I can only tell you this - you are definitely not alone in it, and I can relate with everything in your post.", "I had to comment, because your sentence „I don’t want to be the aunt, I want to be the mom“ is exactly what I am feeling and saying all the time. Especially now that my best friend is pregnant and trying to console me. It’s at least a bit comforting to hear others voice the exact same feelings. Hugs to you!", "This is one community I can’t wait to not be a part of. But, I also realize I’ll always be apart of it even when/if we get success. It totally sucks. We want a big family, too. And now I am just praying for one, and forget trying to time them out. If I am lucky enough to get pregnant naturally after IVF I don’t give a fuck when it happens anymore. Give me Irish twins, IDC IDC IDC. 🙃", "The effin “have you thought about foster/adopting?” And “I mean maybe just take on the mindset of if it’s meant to be it’s meant to be !” 🤬🤬🤬 “you can have mine , he’s a handful!” F*** f*** f****!!!!!", "As I lay in bed crying from no one understanding what this stupid journey is like, I just want to say my heart goes out to you. And I’m sorry we are part of the shit club.", "I feel like I could've written this word for word. I'm so sorry you are going through this, just know you are far from alone. It's no real consolation, but this journey can feel lonely, even with people around that \"support\" you. I started out very cautiously optimistic because I knew this was going to be a long road full of challenges, but I had no idea how crushing the bad news would be at every turn. Every single step along the way we've gotten terrible news, it's hard to be hopeful about anything. I love being an aunt, but I was born to be a mother and it's devastating to see my hopes and dreams so seemingly unattainable. The emotional, physical, and financial burden of IVF has left me a shell of who I was once before. I'm here for you in solidarity, internet friend. This is a club I never wanted to be in but I'm very grateful for. ♥️", "Yes.", "This post makes me cry. Why are we so unlucky. Why are we the ones that can’t enjoy motherhood :(", "Trigger warning (success).\n\nI've fought and struggled through ivf for almost 5 long years. Countless nights crying myself to sleep, feeling worthless, gaining so much weight, not knowing myself anymore, getting bad news after bad news, cutting contact with a lot of old friends just because I couldn't handle my emotions when someone got pregnant and I was so mad when people just took it for granted. I hated it. After almost 5 years I succeeded and I have a 6 month old baby now. And when I see him I know I would go through that journey all over again if I had to. \nWhen he was born he wasn't breathing and ended up in the NICU for 2 months. He's doing fine now. \nBut I'm still angry over the fact that life can be so unfair to some of us. I think that all of the emotions that we go through in this journey is something we will always carry with us. It becomes a part of you. \n\nIm so thankful for this sub, it has helped me so much just reading your posts, rants and advice. I've felt less alone thanks to you. This group truly is full of so many compassionate and friendly people because we all can relate to what we are going through. \nI wanted to share this to hopefully give someone at least a little hope and to let you know that I keep you in my prayers. I wish all of you success in your journey. \n(Sorry for formatting I'm on mobile)", "You definitely aren’t alone. I feel like I get more scared than excited every time I hear any positive news, because I am so sick of getting my hopes up and getting let down. We are all here for you. I love this community for how real it is.", "It’s sucks. It’s wildly unfair. \nI had to give up the process too. \nAnd I’m just as mad. \n*Breaking things for us.*"], "link": "/r/IVF/comments/16sotqi/drained/"}, {"title": "Struggling with trying to understand why I’m feeling this way. After 3 years of TTC, about to start IVF and suddenly nervous about becoming a parent. Lots of emotions. Is this a defense mechanism in case things don’t work out?!?", "content": "We’ve been trying to conceive for nearly three years. Have done Letrozole, IUI’s, tried naturally… you name it. Along the way have been diagnosed with PCOS, Hashimoto’s and Unexplained Infertility. After many years of heartbreak I have half accepted that it realistically might not happen … so much so that now I’m feeling nervous about being a mom and if I actually even want this anymore after all these years. I almost feel I’ve gotten used to this lifestyle, and am getting older and more set in my life. But, is this a defense mechanism to protect me from the fact it might not happen?!\n\nI am set to start IVF soon, but again, know it’s not a sure thing due to my poor quality eggs and being nearly 36. \n\nAnyway, my dog is my “baby” especially since I’m not a mom… but I just found out he is very sick. We are waiting to see what is going on once the test results come back. But, now my focus is all on him and it made me start to panic. Will I love my child more than my dog?? Should I just be a “dog” mom? I know this all sounds insane… I hate what I’m feeling… a mix of grief, sadness, and pain from years of infertility. I almost feel like I built up a wall to prevent myself from feeling too much anymore that it won’t happen… so I cherish my time with my dog (even before all of this) and spending time with my husband, family, friends and my career. I have built up my life in a way that I can have a full-ness. But now, my dog is sick and I’m such a mess and I don’t know what to think. I know this sounds crazy as I have been desperate to have a baby and have cried and hurt for years… now I don’t understand what I am feeling?!??", "num_comments": 11, "score": 24, "top_comments": ["No advice just wanted to say you’re not alone. I find myself questioning, how bad do I want this? Will my life truly be better than my super happy life I currently have? I completely think it’s a defense mechanism or I would not have put myself through years of trying, tests, medications, procedures etc. Best of luck Xx", "I’m glad that you posted this because I have the exact same feeling. TTC for a little over 3 years now and I feel like I still haven’t processed the fact that a) my husband is infertile and b) I literally just went through a round of ER and stims. I’m gearing up for my first FET in a few weeks and it feels like everything is happening so fast and also so slow at the same time. \n\nPart of me can’t wait to get pregnant and have a baby - I know if I don’t give it my all and try then later in life I will regret it. \n\nBut the other part of me doesn’t really want it, like I’m nervous about potentially being a mother  and having my life change so much. That same part of me wants to sell my house, buy a campervan and road trip for a couple of years with my husband and dog. So I think this part of me is almost self-sabotaging in a way to protect myself from a bad outcome.\n\nThis process is so freaking hard. If you had gotten pregnant successfully when you were TTC naturally you’d wake up one day and be like omg I’m pregnant yay! But we’ve had 3 years to overthink everything and build a life without kids and find our own happiness. One day you go in for an FET and you’re just pregnant. It could literally all change in a matter of minutes and that is absolutely terrifying.\n\nYou’ll get through this though. If it’s meant to be then it’s meant to be. I’m beyond grateful for IVF and at least having a real chance at having a family but it’s very daunting at the same time. Just know that if you need some time between cycles you can absolutely take it. Be kind to yourself! xx"], "link": "/r/IVF/comments/wwxj09/struggling_with_trying_to_understand_why_im/"}, {"title": "Why are YOU personally having ivf/fertility treatment?", "content": "Medical problems? Same sex relationship? Single parent? Im just curious 😄", "num_comments": 21, "score": 0, "top_comments": ["Solo mom by choice!  I'm 40 so I unfroze my eggs and am doing IVF to allow genetic screening for chromosomal abnormalities incompatible with life.", "My husband has azoospermia we are using donor sperm and went straight to IVF by my REI recommendation", "2 miscarriages after trying for 2 + years unassisted. Unexplained.", "Husband has CBAVD with a successful TESE procedure, IVF is the only option for us"], "link": "/r/IVF/comments/1b44vbt/why_are_you_personally_having_ivffertility/"}, {"title": "IVF when you feel unsure you want kids", "content": "Wondering if anyone else is going through my fairly specific struggle, of going through IVF while having very conflicting beliefs about becoming a mother.\nI never desperately wanted to be a mother but always accepted I’d want a family one day. To make a long story short my partner and I started trying to conceive after a few years of marriage mostly because I felt like waiting longer would be risky given my age. I wouldn’t say I felt ready yet. We had issues getting pregnant and now we are going though IVF and considering doing a second ER. Throughout these couple of years I’ve waited to have that “a-ha” moment where I felt i finally was ready and wanting to be a mom, but it never came. \n\nMy partner desperately wants kids and will be an incredible parent and I want to make my partner happy. I know I would grow to love being a parent I worry I’ll regret not trying my best to make all of this work and get pregnant…but I still feel like something is wrong with me that I don’t feel a desperate urge to be a mother. Understandably this makes going through IVF so much more complicated because it doesn’t always feel like I have an end goal that will give me all the happiness I need. \nWondering if anyone else has struggled with this bizarre state, fluctuating between feeling ready to be pregnant and excited to start a family, and also feeling like maybe you don’t really want kids and this isn’t worth all of the hassle?\nI also feel like going through an ER where i didn’t get my desired result could be pushing me toward the more negative feelings.", "num_comments": 87, "score": 88, "top_comments": ["For me I also never felt like being a mother was my calling.  We jumped onto Ivf bc I figured it would be the fast track to a baby given that I was 38.\n\nFor me the bad results actually solidified that I do in fact want to be a parent and that having a biological child means a lot of me.  None of that o knew before going through it\n\nI also find that therapy is really helped me crystallize how much and what I’m willing to do as well as it got me to find my end point of when enough is enough", "I felt similarly, didn’t really picture having kids until I met my husband, tried getting pregnant after a few years of marriage then moved right to ivf because we thought we wanted 3 kids (we both grew up in families with 3 kids). Didn’t have great success but have some frozen untested day 3 embryos. A mock cycle revealed that I needed to do a couple of months of Lupron so we did that. During that time period, we got a break from ivf and started really enjoying life not thinking about kids, and after a week of family visiting we starting doubting what we wanted. I freaked out that I was contemplating changing my mind after 4 ERs and did a few therapy sessions. In the end, we decided to stop ivf before attempting a transfer because of the doubt. We are very thankful we have frozen embryos and will keep them frozen. We plan to rethink everything in a couple years and I feel very grateful that I have my frozen embryos and time is no longer as much of a consideration, currently 32 and ERs when I was 31. So although ivf sucks, and we don’t fully know what direction we will take, we don’t regret it at all and appreciate the time it gave us to think more about what we want.", "Me.\n\nI really never got to the point where it was a definitive “yes” that I wanted a baby. I was so completely on the fence about it and going back and forth like mad.\n\nMy husband was exactly the same.\n\nI think I just got to a point where the clock was running out… I no longer had that “I can just decide later” option. I had to make a choice.\n\nAfter a lot of deliberation & intense conversations, I realised the magical feeling that I was ready was never going to come, but how did I feel about being 60 years old and never at least trying? \n\nIn that I felt that we had to at least give it a go, if it didn’t work - it would be somehow easier to reconcile and be ok with, as we were so 50/50 on the whole thing. We both agreed to commit 12 months to the process and after that, we’d move on and commit to being childfree as our path. We didn’t want to be in a TTC phase for too long. \n\nI knew I had had endometriosis in the past, it was cut out and removed via laparoscopy when I was 27, and I only ovulated sporadically. So it was going to be a case of straight to Fertility Treatment to maximise our chances in 12-14 months. I saw the RE for the first appointment In November, had all the pre tests completed by Christmas. We started the “clock” at the first cycle start, which was mid January. \n\nI had 2 ERs between Feb - June. Not going to lie after the second one, I felt rubbish emotionally and physically. And I was ready to just throw the whole thing in. Once I got my period and my hormones calmed down, I felt better and re-committed to the process.\nBut I did panic and wonder if I was doing the right thing.\n\nAs it turns out, that cycle resulted in the conception of my now 13 month old son. He was supposed to be a fresh transfer, but because I was in such a bad state, I requested to switch to a frozen cycle and transfer at a later time. \nWhich was the next cycle a month or so later. \n\nI do think this was some kind of divine intervention, as I don’t know if my body would have been in the right state with a fresh transfer… he was the best quality embryo and I hate to think that he might have not had a good chance to implant. So my choice to wait till my body “calmed down” and do a FET, I feel was for a reason.\n\nI had a lot of childhood trauma. My mother has severe BPD and was an absolute nightmare. I was parentified from a young age, she had the emotional maturity of a toddler and it was hard work on so many levels. I no longer have contact with her for various reasons, but the emotional and mental scars she left, really did impact my feelings on becoming a parent myself. \n\nI had felt numb to the idea for as long as I could remember. Like there was some kind of emotional block there when it came to being maternal. I was afraid of not bonding with my child. Once I started to unpack those feelings with a therapist, we got to the root of those feelings & it was my lack of feeling for my mother and projecting that onto my own hypothetical relationship with a child. \n\nAs it turns out, when I found out I was pregnant and when I first saw his heartbeat, first scan, I just adored him. It’s not like that for everyone - but I was truly amazed that it was for me. \n\nThe moment I saw him & held him - it was like it was meant to be all along.\n\nThis last 13 months has shown me so much and taught me a lot about myself. I am capable of so much more than I ever thought I could be as a parent & I am loving being that person. \n\nThis is only my perspective, and this isn’t representative of everyone’s experience. But it is possible to be against the idea of children as well as completely on the fence and still have a positive outcome. \n\nIVF is hard no matter what. It’s a different kind of hard for people in varying ways. \nBut ultimately for me it was the best way for us to maximise our time on the TTC journey, given the past fertility issues for me, I was then 36 and my husband was 42. \nWe got lucky and the second transfer worked, so 8 months into our 12 month commitment, I was pregnant. \n\nI wish you all the best on this. I hope whatever happens, you’re happy and fulfilled.", "I don’t know your age but I could have wrote this a couple years ago in my late 20s (pre ivf). My feelings still waver, mostly around the idea if I can keep doing this and going through heartbreak and if I should just move past this, and on with life childless. But there are many moments of knowing I want to be a mother and I let those shine and use those for motivation. \n\nI do not think your feelings are rare, and you are not alone! Having these feelings do not mean you have to stop and change your path right now, but it might be something good to flush out with your partner and/or therapist about what a stopping point looks like for you. Sending love, and hope you have more moments of clarity than haziness around this subject. 💜", "I was in this boat 100%! One nice thing is I wasn’t upset by 10 years of infertility bc I knew I’d be happy child free or with a kid. With my first IVF pregnancy I was pretty bummed it worked esp on the first trimester (horomones made me more irritable than usual). I think my kid is pretty cool and I love him but I do also love work and a million other things and could imagine still being happy kid free if IVF hadnt work, though losing him would be devastating. I’m currently pregnant again, we were in the fence for 1 or 2. I’m always feeling on the fence and we thought we’d try one transfer and then be done either way. And of course it worked :/ that sounds glib but also part of me hoped it wouldn’t. I’m not looking forward to the next two years but toddlerhood is wonderful and I do like the idea of older kids and adult children. The hassle of IVF is nothing next to the hassle of being a parent but also IVF is an expensive pain in the butt and having a kid is expensive but it has lots of upsides to compensate for its downsides . Personally I felt like IVF helped decide all of this for me, if it works great, if not then I knew I was done and the decision making was out of our hands. Ahead of time we decided we would only do one ER and up to 4 transfers. That was the only part we could control.", "Tw: loss, living child\n\nWhen we started trying, I wasn’t 100% sure this was the path for me, but outside forces made it a good idea. I only realized I really wanted to be a mother once I lost my son in 2017. After that, you could not stop me. I was on fire I wanted to be a mother so badly. I nearly destroyed my marriage. I now have a living child, and I know this was the right decision for me and my family. I did a lot of therapy to get to this place. I would highly recommend if you’re able to find a good therapist", "I’m so relieved to read this post and these comments. You all are me.", "This is the reason I’m 39 almost 40 and I’m doing ivf now because I was never “ready” but I’m not sure you can ever be ready.  I regret not trying sooner now I feel like ivf is a mountain I may never get to the top of.  Best of luck to you girl x"], "link": "/r/IVF/comments/13isqpy/ivf_when_you_feel_unsure_you_want_kids/"}, {"title": "Thoughts/experiences on IVF for healthy parents who simply have a strong sex preference?", "content": "Or rather-- my husband doesn't care, but I do. \n\n28 years old. I'm, I assume, physically healthy-- if anything, mentally unhealthy for asking this question. I have a strong sex preference for a prospective baby to the point that I've avoided getting pregnant all these years primarily due to the fear of having a girl. It's messed up because I'd really be happy to have a boy, on the other hand.\n\nI guess I'll draw a lot of criticism on this post. But I was just wondering-- Is it possible to request IVF *simply* due to a strong sex preference in the US? Also, is it possible for it to be covered by insurance under this circumstance? \n\nLastly, what risks should I be aware of that may make me second-guess this? And would this process guarantee a healthy baby boy? \n\nI'm still new to the topic but so far what I've read sounds manageable for the 'reward' of having a healthy baby boy...", "num_comments": 13, "score": 0, "top_comments": ["I strongly, strongly suggest you speak to a therapist about this issue before you ttc. Not only is that really, really toxic gender norms thinking, it is far too much pressure to put on a child what your idea of a boy is.", "I can speak to success rate. That will run roughly 75-90%. PGS testing is pretty good at finding out gender, but they always have a disclaimer that it might not be correct, which is where that comes from.\n\nHowever, I wouldn't tell folks you are doing it just to have a boy bc insurance won't cover elective stuff generally, it's more protecting yourself and if you happen to have boys available after IVF and PGS testing, you can be all happy and peppy to yourself and your spouse if you have one."], "link": "/r/IVF/comments/efw1wz/thoughtsexperiences_on_ivf_for_healthy_parents/"}, {"title": "Transfers ", "content": "How many tries did it take you to get pregnant from a transfer? After talking to my doctor, it sounds like it may take 3 tries. Sigh who has the time and money for this? Also at what age did you start the process, get pregnant and have a baby? \n\nThis whole thing is stressing me out and I’m not ready to be a parent. ", "num_comments": 22, "score": 4, "top_comments": ["My first attempt failed tried immediately again next cycle n I am now 7 weeks pregnant. I am 47", "My third FET was successful (pregnant with twins) I’m 44.", "I got lucky.  I did 2 rounds of IVF - first resulted in one embryo but my progesterone was too high to do a fresh transfer, second resulted in 3 embryos (one day 5, two day 6).  I’m currently 23 weeks with the day 5 embryo from my second ER.\n\nEdit - I’m 38, but was 37 during my ER and when I got pregnant."], "link": "/r/IVF/comments/1bce6xn/transfers/"}, {"title": "2nd retrieval this morning!", "content": "Hey IVF fam! I’m going in for my 2nd ER this morning, please send all the good juju!\n\nEmotionally and physically this second round has been so much easier than the first, even though I started out with a significantly lower follicle count. In the thick of everything, it’s really difficult to remember how incredibly hard our bodies are working to make our dreams of becoming a parent come true. \n\nI have no idea what results I’ll get this time around but in this moment I am choosing gratitude and hope. Thanks for being apart of my IVF journey 🫶", "num_comments": 31, "score": 19, "top_comments": ["Goodluck.. My 3rd retrieval was last Friday", "Good luck!!", "Sending you all the good vibes! Hope results are what you’re looking for & recovery is quick and easy!"], "link": "/r/IVF/comments/1as9s10/2nd_retrieval_this_morning/"}, {"title": "Feelings of \"Is this even what I want?\"", "content": "Hey all! Not sure if this belongs as a standalone, but I tried searching a few different ways and couldn't find anything.\n\nWe just decided that we are actually going to try IVF as we have a pretty good chance of success. We have been trying on our own (and then two IUIs) for over two and a half years. It has gotten to the point where I don't even know if I want to be a parent anymore or if I just want to see a positive freaking test.\n\nDid anyone else have those fears? I am scared that maybe I won't like being a parent, maybe I'll have really bad PPD, maybe this is the universe telling us that we should just stay childless. There are lots of kids in our neighborhood but some of them are so annoying, maybe I just don't like kids? We are about to spend a giant chunk on money on this, what if it's the wrong choice? Any advice or stories would be really helpful right now.", "num_comments": 62, "score": 94, "top_comments": ["There were two moments that stick out in my memories that I hope can bring you some solace, or at least some company.\n\nThe first moment of panic was after I had my IUD removed in September of 2020. Prior to this, my husband and I had extensive conversations about wanting to try for kids. I saw babies in their mothers' arms at the grocery store and craved the all-encompassing love that parenthood brings. I was ready to start our family. But when I got my IUD removed I suddenly had a wave of panic (of course, I had no idea how much we would struggle). I drove home crying, not knowing how long my husband and I would be just a family of two for. I love the life we have built together and I feared that changing. It was terrifying.\n\nFast forward a year and a half. I'm sure many of us started out pinning nursery ideas and planning a life through pregnancy, but slowly it becomes just about trying to get a positive test. Throughout infertility, I lost sight of the baby I desired and became so invested in  *getting* and staying pregnant. But starting IVF restored some of my lost hope.\n\nAfter my ER, suddenly things started to feel very real. I think part of this feeling was the hormones and physical stress my body was under after suffering from pretty severe OHSS and having my estrogen through the roof. But I suddenly had the same feeling I did after stopping birth control. *Oh my god, my life could change forever next month. Will I be a good parent? Should we have done this?* It was scary. After spending *so* much money on this how could I suddenly have doubts?\n\nIVF is a huge investment. It is physically terrifying, financially draining and emotionally exhausting and doesn't come with a guarantee of a baby. You're not alone in your feelings and whatever you decide is right for you is valid and okay.", "\"pretty good chance of success\" is a very loose term.  What is that based on?  \n\nI say this b/c we were also given the impression that we have pretty good chances... and i think we still do.. however, it's taking at least 6 retrievals (maybe even a 7th) to get to that point... which is not how i interpreted the information when we were starting...\n\n&#x200B;\n\nfor your actual question- i have those thoughts often... this is all way too much work, and money... it's making me question to what degree i'm willing to sacrifice.. especially when having kids is a constant sacrifice...", "Yes, children are annoying. I have an almost 4-year-old daughter. She has a pretty intense personality. There are days when I envy childless people. Like, I can’t wake up at 10 am on Saturday, go to brunch and drink mimosas, and then take a 2-hr nap. There are days when the irksome toddler behavior puts my husband and me in a bad mood - whining, screaming, repeating the same thing over and over again, you name it. \n\nBut…when they’re babies, they are so delicious. The 1-1.5 year range is mind-bogglingly cute. Their chubby cheeks, innocent eyes, upturned noses. Chomp chomp, delicious. \n\nYou watch them learn to speak, make sense of their world, develop unique personalities. Raising a child is a magical experience, especially if you like children and are interested in childhood development. It is an honor and a privilege to give a child a safe, happy childhood. \n\nSo now I’m doing IVF to try to have a second one. There are times throughout this process when I’ve second guessed myself. My kid sleeps a solid 9-10 hours a night with rare interruption. I know I’ll have to give up my beauty sleep if/when a new baby comes. The newborn period is brutal. TIRED doesn’t begin to describe what you’ll feel. They say you don’t remember it, but I specifically remember being so tired at a restaurant, I think my brain blacked out for a minute. \n\nAll this to say, I find it all worth it. I’m very glad I have a child. Not sure if my take helps. There are no easy answers.", "I feel you. We’ve been doing this so long (4 years of IVF on and off) and had so little success that I don’t see the point in continuing. I just don’t really want to start over anymore.", "I have thought a lot about this recently, as my husband and I just failed our 2nd IUI (6th medicated cycle total), and move into our last IUI before IVF. My IVF consultation is the 22nd, so very close. \n\nI never had the feeling of my clock ticking and dying to have a baby. My cousin did, and there was a STARK difference between how we behaved while TTC. It doesn’t help the pain of this process, however, that still made me question the same things. Here is my answer: I’m not doing this for right now so that I can have an infant. I’m terrified of that stage and the lack of sleep and how hard it is. I’m not doing this because I love every single kid I meet, most of them suck and I have my own ideas of parenting lol. \n\nBut I’m doing this now, so that I can have a family for the rest of my life. Because I cannot imagine my husband and I not having soccer games to go to, or be available for when kids come home from school after a shit day. To help them struggle through the world the same way we do, and maybe mold some humans that can make it a better place. Simultaneously, I want to look back at them and know that I’ve left amazing people behind when I leave this earth. And feel that love at my bedside whenever my time comes. My fear is if I don’t do this now, while I’m enjoying my life, that my final years will be so much more difficult and emotionally costly than this IVF journey. \n\nI’m estranged from my family and had my relationship with my nieces and nephews ripped away from me. Let me say, I didn’t always love their temper tantrums or the diapers, or all the work they entailed. But I look back, and I miss them more than anything.", "In addition to major doubt during my FET prep, I had a full on breakdown while I was sitting on the bed in a hospital gown waiting to go in for my FET. I mean, breakdown. Sobbing, could hardly breathe, every single question and doubt showed up in my mind that very second- maybe I’m just not meant to be a parent, what if I don’t love them, what if I don’t want my life to change that much, I mean All. Of. It. I seriously considering pulling the plug and leaving. \n\nI went through with it and am now pregnant, and I’ll tell you this much- when I was in the 2 week wait and I tested early and it was negative, I suddenly realized how sad it made me. I did NOT have an instant realization immediately after the FET, I still wasn’t sold. But as soon as I tested and realized wow, maybe it didn’t work (wait, so I’m off scot-free?) is when I realized that it was indeed what I wanted. I realized much of my doubt and uncertainty was fear driven. Best of luck to you, regardless of what you decide upon. \nPS- I went to the store the night after my FET with my husband and there was a screaming child inside. I looked at him, he laughed at me, because my face told him I was immediately filled with regret. 😂 All good now, but just know you aren’t alone.", "I was married for almost 8 years, we have tried the moment we got married. We found out I have stage 3/4 endometriosis. I took some fertility meds to no avail, I had laparoscopy and was told to try naturally for 6 months-but nothing. I knew we couldn’t afford IVF here so I searched and searched and found IVF in Mexico. I never lost hope, until my ex-husband said we should just try naturally and if we get pregnant-great, if not then that’s God’s will. We started telling people we don’t even want kids anymore, but deep inside I wanted to have 8-and in those moments I was begging God to just give me one. We got divorced, found a partner who wanted to have kids, he had means to help me with IVF, we started with 4 healthy embryos, but had 2 FET implantation failures, so we are now down to 2. To top this, I think I’m going to end up doing all of this on my own. Im taking a break from IVF because mentally, physically, emotionally and psychologically I am exhausted. I am also afraid that none of our embryos will implant. I feel like I am drowning at times, sometimes I feel like a failure, that the one thing I want to be is not happening to me. I can hear my neighbor’s baby cry everyday, and everyday my heart wishes I was the one getting stressed soothing my own baby. Feeling defeated is normal, but my dream of being a mother trumps all my doubts and fears. It’s a choice to do IVF, it’s going to be challenging, heartbreaking at times, but never lose hope, because if this is what your heart desires, if It is for you (and me) it will be given to us. Hugs", "I don't know your age or anything in that nature but I guess the biggest thing for me that helped me decide on wanting to be a parent is IF you decided not to pursue children would you \"regret\" it?\n\nMaybe personally I'm just a deep thinker and some people don't care and are content but it seems that sometimes when people hit a certain age they have a lot of what ifs and wish they did things differently. \n\nJust make sure whatever decision you do end up taking you are 100% ok with! That may be easier said than done. Some people do choose to never be parents and that is 100% ok as well. \n\nALSO, there is an option to \"freeze\" your eggs for future use if you are on the fence.\n\nBest of luck :)"], "link": "/r/IVF/comments/t8xz2p/feelings_of_is_this_even_what_i_want/"}, {"title": "Do you tell everyone you’re going through IVF?", "content": "For my first round I told only very few people! Just my parents, and his parents and a couple of friends. When it didn’t work with our one embryo I then opened up to a lot of people and told them it didn’t work! But they were not on a ttc journey so it’s easier. I have two sets of friends who are ttc, one set is super poor and are trying to use NHS but it’s going to take two years and the other is a couple who is minted and is married to a DR who doesn’t believe they need IVF until they are older. I just don’t feel comfortable sharing my ivf journey. Is this bad? I just feel like there’s a lot of comparisons made which I don’t like and also I believe in jinxing which I shouldn’t but I think then it would worry me :( ", "num_comments": 119, "score": 44, "top_comments": ["I told everyone! Family, friends, work, complete strangers. Few friends of mine were also doing ivf so we got to go through hell together.", "I shared with very few people the first time.  We were successful on the first fresh transfer, but I was mum about the pregnancy for as long as possible in case I lost it.  Well everything was fine and my son is perfect.  I’m starting steps for number two and I’ve been very open about it.  I don’t think isolating helped my mental health at all and so I’m trying something different.", "Hi, hello from 🇬🇧! We’ve told family, close friends and our managers at work. Not telling strangers at the moment. We’re getting 3 free cycles so not having to worry about cost and we don’t know anyone else going through IVF.", "Why would you tell everyone? We only told people that needed to know as it came up. I didn’t want people asking us all the time about how it was going.", "A few people but I regret it. \n\nNo one understands and they always say the wrong thing at the worst times because they don’t have experience of the right things to say. That’s just my experience though. \n\nI have one friend who had multiple rounds in UK and Greece who understands. Having her know  has been very cathartic for me because she just listens and I love that.", "I made the biggest mistake to tell my own mom about my IVF journey. She hurts my feelings very badly. She called me a few times so far to check on me. She basically thinks that IVF is a magic to get a baby in a sec. Then I explained to her how it works. Neither she fully understands it nor wants to listen to the full stories of the procedures of IVF. Then the half way she listened to that, what? Lab? Fertilizing? And fail? That doesn’t sound like you can even make two kids. Haaa I thought it’s very easy with it. So much stuff and expensive. She was kept asking pricing instead of my condition.( she doesn’t help pay any bills of my IVF by the way). this is what exactly she told me with big sigh. I still can’t believe my own mother saying such things that you wouldn’t even say to strangers. I feel very sad and stuck with feeling that my mom is not real my mom. \nHow can you be so cruel to your daughter? Since this is the case, I’m not opened to tell people about my IVF journey anymore .. (except my in law parents. they are very very supportive and even prepare nutrition food and herbal meds)", "I live in a culture where you need to get pregnant and have a baby right away. When I got married in June 2022, everytime I would see family members I’d hear “when will you have a baby in your arms?” Or “hurry up!” \n\nWhen we tried and couldn’t get pregnant, the questions would come up even more. At this point I would say “when it’s the right time.” I know people shouldn’t ask to begin with, but it’s “acceptable” in my culture to ask. \n\nThere was also a LOT of stigma around any fertility treatment. You’d always hear “oh poor thing, she had to do IVF.” Or “did you hear that so-and-so couldn’t get pregnant, now she has to get treatment?” And it infuriated me. Because I couldn’t get pregnant. So would they talk about me like that?\n\nWhen I started IVF, I told everyone. I said it proudly. “So when are you and your husband going to have a baby?” “Well, we just started our stims for IVF, and my retrieval is at the end of the month.” And then, pure silence. At first people felt bad for me. They’d apologize. I’d tell them there’s nothing to be sorry about. I’m glad I have the opportunity to do IVF, and people do it even when they don’t have fertility issues to be able to choose a baby’s gender! I wanted to mention it in front of this family members that shamed it because they would know someone *personally related* to them going through it, and as far as anyone knew, there’s no reason that I wouldn’t have been able to conceive naturally. So when I talked about it, people listened. And I think (or I’d like to hope) I helped with breaking down that stigma.\n\nSo in short, I told everyone.", "It’s not bad to keep the process to yourself ! It’s not bad also if you decide to share it . A lot of it it’s knowing who your support system is and how they would react to you sharing the news , how noisy they are etc . For my first round of IVF I made the mistake of being pretty open and sharing with family and close friends …. I soon realized this was a mistake . Ppl had so many questions and didn’t understand the process wich left me resentful . I did 2 more rounds of IVF years later after the first attempt and decided to tell NO ONE ! It was yeh best decision I made for me and my mental health . I ended up getting pregnant form my last IVF round and when it happened I told ppl  when I was 5 months pregnant and did not share any IVF information- a lot of ppl did ask me because they knew about my struggles the first time I opened my mouth , but I told them that being pregnant a is all I felt comfortable with sharing and that was enough to get ppl of my back . Again we all are different , I found IVF to be a very difficult process and the constant questions were too much for me to handle . I made sure that when I decided not to tell for next rounds I had a therapist to help me cope with the loneliness of not sharing and of course my hubby has been the biggest support all along . Do what feels best to you and if conflicted about sharing or not , you can take time to decide - it’s your process  and your timeline", "My husband shared with one friend that went through it a few years ago, I relied heavily on my 2 best friends but also on my 2 SIL's, one that had her 3 kids through IVF,and the second one that started a month after us.\nWe have not shared with our parents because we don't want to have to update them about every appointment and test and whatnot, and honestly, they pressure us enough as it is.\n\nAt some point, I withdrew from the sharing with my SILs because I was feeling like we were competing although I'm 10 years older and she has a medical history that will probably make a pregnancy a challenge. \nThen my brother announced she had miscarried right before Xmas and since then I have not shared anything with them because I don't want to trigger her or be perceived as insensitive for pursuing my treatment and now being 5 weeks pregnant. \nWe will announce the pregnancy at 12 weeks, but I have never even thought about mentioning it as an IVF pregnancy.", "I’ve only shared with those who would be the first noticed of a pregnancy: our pastor, our supervisors, and close relatives/friends.", "I’ve told a few people close to me and a bunch of strangers lol", "My husband and my best friend. \n\nI don’t want to answer anyone’s questions or raise any expectations. \n\nIt’s a little hard, with things like a friend who started TTC around the same time as me who now has a baby, or my cousin who went from engaged to married to pregnant within one year with a woman one year older than me… you guys know… but I would rather wrestle with those feelings on my own or with the support of my husband than deal with anyone’s ideas or opinions, even if they’re well-meaning. \n\nIf we get pregnant, I will tell people it was through IVF and be open about the experience.\n\nThis sub and the book The Underwear in my Shoe have given me a decent amount of camaraderie! Thanks guys! ", "As someone who hates being judged and doesn’t want random opinions, I’ve tried to not tell people. Or like I’ve told some people but not told them when it’s starting.", "I’ll tell more people once we have our first child. I’ll be 100% open about it once we have our second child.", "I've told everyone because I'm so young and I have DOR. I wouldn't have sought treatment if an old manager  never shared her fertility struggles , so I share mine. If I could help another person catch a problem when they're young and feel more empowered - or make someone feel less alone - I need to."], "link": "/r/IVF/comments/1ayp6bb/do_you_tell_everyone_youre_going_through_ivf/"}, {"title": "I’m a mess", "content": "Just got results that our second transfer failed our last embryo is an untested day 7 so I don’t have much hope. We cannot afford to do this again as it was a gift from a parent who pulled from their literal retirement. I’m so lost….", "num_comments": 15, "score": 34, "top_comments": ["Sorry you’re going through this right now. Fingers crossed for that day 7. I know how hard this can all be"], "link": "/r/IVF/comments/18dvmpq/im_a_mess/"}, {"title": "What embryo to transfer first?", "content": "My (39F non-gestational parent) wife (35F gestational parent) just got our PGT results back yesterday. We have 5 euploid embryos, 1 female, 4 male. We have been through 3 failed IUI rounds and went out of pocket for IVF. No known fertility issues except for a lack of sperm producing partner.  We know we're extremely lucky to have 5 euploid embryos in the first place, so nothing but gratitude from us. That said, we really really really want a girl. None of our friends/siblings have girls, we're very close to their boys and love them dearly, but we are really excited at the prospect of having a girl. But we're on the fence about what embryo to transfer first. If we transfer the female, and the first transfer fails, we're left with only males. Ultimately all we care about is eventually, hopefully, having a live birth regardless of the sex, but...any advice/experiences/thoughts that anyone can share on this? Thank you!", "num_comments": 31, "score": 6, "top_comments": ["I would have the embryologist pick. I'm sure they're not all graded the same but if they are then ld try the boy first since you have more boys", "Also a lesbian couple here - we had 8 failed IUIs - no known issues. We elected to not know the sex because that was messing with fate too much for us. We don’t have a preference after gone through what we have. You lose that and remember that’s not what it’s about. We transferred our highest graded Euploid for our first FET and it ended as a chemical. Currently in 8dp5dt from our second FET. 🤞🏼✨ Best of luck!", "I would Always select the highest grade regardless of sex. \n\nI also really wanted a girl, but I let embryologist pick. For some reason, I knew I’d feel guilty if I picked an embryo and it didn’t work out. Tw currently pregnant with a boy. I’m still coming around to the idea that I’ll have a son.", "I would transfer the girl.", "I just picked the best graded one. I didn’t get mine tested first but if I had, i would have also gone with best graded"], "link": "/r/IVF/comments/120j0n6/what_embryo_to_transfer_first/"}, {"title": "I actually don’t think I can keep doing this", "content": "Life just seems so pointless and empty now. I just want to be a parent but I don’t think it will happen for us. I just wish it was all over. I’m so tired\n\n***\n\nUpdate \n\nThanks for the kind messages, I’m going to make an appointment to check in with my psych. I really ride the hormone crashes hard after a treatment cycle. I’m okay and safe :)", "num_comments": 20, "score": 41, "top_comments": ["I have felt this feeling to my core, and I’m so sorry you’re feeling it now. Ivf is so tough, and it’s all not fair.", "I’m so sorry. Just know it’s ok to take a break. This can be a brutal process.", "Ivf is the hardest thing I have ever been thru. I have been in a terrible state for the past 4 months after our failed transfer. I was so sure it would work everything was perfect for the transfer, when I got the call that my hcg was negative I grieved so much. For a month after I wasn’t able to work I barely ate and slept most of the day. I stopped going out or interacting with people except my mom and my husband. Ivf is a wonderful process IF it works but if it doesn’t it becomes the exact opposite. a nightmare. I started seeing a therapist every month at the beginning of our ivf journey and now twice a month. The thing about therapy is even if you go and think it’s not helping during the session I often find later that day or even a few days later I am able to process how I feel better. The only way to get thru greif is to literally keep going and that’s the hardest thing going thru the motions because what you went thru is so traumatic and if feels like time should stop and it doesn’t. I’ve felt like a robot for so long after just trying to get thru the day. the longing for a child is unbearable and it makes you bitter or it did for me. It has made me question my faith and took me down a road of uncertainty. Ivf changed me and I’ve really had to prepare myself going forward with it again. I just wanted to reply and say I hear you and I empathize with you. I think another hard thing with ivf is we think we have to try again because next time it will work and if we don’t try we won’t know and I feel that way a lot of the time. But if it is taking more from you or it becomes something that you feel you shouldn’t  do then be kind and gentle to yourself in whatever you decide. Sometimes stepping away from the process can give you clarity about what you want to do moving forward. Just know that it takes an incredibly STRONG person to go thru ivf even if you feel weak and defeated."], "link": "/r/IVF/comments/18njh6g/i_actually_dont_think_i_can_keep_doing_this/"}, {"title": "When did you start telling people?", "content": "My husband and I are just starting the process of IVF after over a year of trying and 3 rounds of failed IUI. I feel very overwhelmed, frustrated, angry, terrified, and deeply sad about all of this. I recently expressed to my husband that I want to tell my parents what has been going on and that we are starting IVF. He is against this and does not plan on telling his parents. He said things like “I don’t want to burden them” and “we can tell them when we have more answers or when we get pregnant.” He says he will support me in telling my parents but will not be telling his family. I understand his perspective in some regards. I don’t want to burden my family with this pain either but I feel like I am keeping a secret and could really use the extra support. Does anyone have any advice on sharing information outside of your relationship? Do you have regrets either way?", "num_comments": 104, "score": 20, "top_comments": ["I've been extremely open with the people in my life about what's going on, and I don't regret sharing with anyone I've told. I've told my parents, close friends, and my supervisor at work. I wouldn't have cared if my husband didn't want to share it with his parents, because I'm not getting any support from them anyway but wanted the support of my parents. Plus, they know I want kids, so I'd rather have them understand what's going on versus constantly be asking me when I'm having a baby.", "We started telling people when it became such a big part of our lives that it felt strange to not include it. \n\nAs everyone has said- it’s such a personal choice for each person and there’s no right or wrong.", "If I could go back I would only tell my family and not my husbands. They have been super insensitive about the whole thing and I honestly wish that we wouldve just kept it from them. I dont know what the dynamic is of your husbands family but he could be just trying to protect himself and you from any possible unwanted advice or comments? The only people I do not regret telling is my best friends, my boss at work, and a few close family members, as well as my immediate family. As they have all been nothing but supportive. \n\nIf you are feeling like you want some support these subreddit has been great and has helped me connect with a lot of ladies that are also going through IVF and infertility. Also something that has been helpful to me are local IVF facebook groups, theres usually a lot of suppor that comes from those and I have made a few really good friends through those groups as well. \n\nIm so sorry you're going through this and I hope that you have the best support system during your journey!", "Single mother by choice here. I told my parents who have been super supportive and my ex knew because that’s why the relationship ended. He didn’t want to do IVF.\n\nTW:\nMy first FET worked and I am 5 weeks and 3 days. I plan to tell the rest of the world about my pregnancy when I get to the second trimester. Not planning to share how I got pregnant because it is none of their business lol", "My husband and my mom were the only people I told and they told the entire world all of my business. It was mortifying for me. Everyone knew when I was having my period, when my transfer failed, everything. But the worst part was they all talked about me & never to me. And never offered any kind of support. I felt like the family/work gossip. Ugh. I hate IVF.", "I have a very close circle of people who know. Our parents don’t know, our siblings don’t know. My best friend knows, and one of my husband’s coworkers knows- only because she started IVF right when we did and goes to the same clinic as us so we told her to avoid any weird encounters. I have another friend who has an IVF baby, so I talk to her about it. That’s it. It’s such an individual thing. My husband is very private, so we have kept the people who know limited, and after several months of it, I’m glad only a few people are involved.", "I told my parents and my best friend. My husbands family doesn’t know about it. I’m leaving it to him on how and what he wants to communicate on his side. Sometimes it’s really hard when I’m on meds and we don’t feel like doing anything but now we’ve had a few failures so idk what’s better. This could so change in the future but I so desperately need my mother and best friends support during this", "Totally a personal choice, but I am very solidly in the “stay quiet” camp. I told my immediate family once it started causing scheduling issues with annual family trips, but have otherwise kept it pretty quiet - and I plan to keep it that way. \n\nI absolutely hate being checked on or monitored or asked if I’m ok, and I have felt like the handful of people who I have told have gone one of two ways: they hover over me constantly AND/ OR they absolutely cannot begin to understand what it’s like to go through and are completely clueless/unhelpful/tone-deaf.\n\nAlso, I just don’t want to be looked at differently. The last thing I want is for anyone to disregard my feelings or blame my reaction to something on my hormones.", "I’m currently on my 6th transfer after 5 egg retrievals and I’ve always been open to my parents and best friends. This time however I have chosen to be secretive and it feels really nice. For me the reason for the secrecy is because as nice as it was to talk about my experiences and voice them, it also meant voicing when it didn’t work and after a few tries that became the most painful process. I would say do what feels right for you. I hope your round is successful!", "I’ve been moderately open, but I’ve had some dangerous miscarriages so the fact that we were TTC was definitely not a secret. For me, it’s been an “as it comes up” kind of thing with most people. I don’t hide that I’ve got a stupid amount of appointments and sometimes have to be home at a specific time to give myself three different shots, but I’m also not broadcasting it. \n\nI will say, check your company’s policies, but you should probably share with your supervisor and/or HR since it is medical and you may have a lot of short notice appointments and days out of the office. It seems like most clinics try to schedule monitoring early in the morning, but I’ve definitely been late at least two dozen times this year alone because of appointments.", "For my husband and I, it depended on who said people were. We were careful about who we were sharing our experience with. My parents and I are very close and my husband adores my parents, so we told them right away. Also, since we were traveling for IVF, it helped for them to know what was going on so they could watch our puppy, etc. With my in laws, we waited as long as possible. They are very Catholic, my FIL is even a deacon in the church, and IVF is against church teachings, so we knew the criticism/challenges we were in for with telling them. Ended up only telling them when we had to travel for egg retrieval and transfer during the holidays (November and December). It was hard sharing something that we knew they disapproved of and felt unsupported. Other than that, our close friends and families know. We didn’t advertise our journey on Facebook or social media. It just doesn’t feel like everyone’s business", "From someone who’s just gone through this (in recovery post egg collection atm), I would be in a horrible state of depression if I didn’t have my family as a support system. My husband is incredibly supportive too. He’s taken 8 days off just to be with me through the whole thing, but even having that wasn’t enough. I didn’t know how I would handle the hormones and I’m prone to anxiety. I soon realized this wasn’t a walk in the park and personally I’m not good at handling things on my own. We told my sister in law and my immediate family (mum, dad siblings) and I’m really glad we did. They helped out immensely by doing little things like shopping for me, picking me up and taking me to appointments (which you’ll have a lot of). The hormones really affected me so I wasn’t always fit to drive. It really is an individual thing and you’ll be able to assess it by how you handle other intense things in life. If you generally feel like you require a larger support system, I would recommend telling your close ones.", "I would say it makes sense to look at your life and your habits/routine and try to see how easy it WOULD be to keep people completely in the dark, or if it would be majorly stressful to have to hide it. \n\nI’m a social drinker/marijuana user. But complete teetotaler when I’m on an IVF cycle. If I rejected the mulled wine at Christmas, my sisters would notice and instantly say “omg!!! You’re pregnant!”\n\n…And I didn’t want that. \n\nOur first round also started in October/November, which greatly effected our usual holiday travel plans. You often don’t know the EXACT date of every ultrasound/lab/etc months in advance, so I would have had to make up a lot of excuses for why I have to miss or reschedule things last minute. \n\nSome clinics are great about letting you travel and use outside providers if needed. Mine isn’t so great for that. And what do you do if you’re from Chicago and visiting Florida and your clinic doesn’t like your levels and needs a medication change and a lab ASAP?\n\n…You’ll be on the phone all day trying to find local providers who can get that done, checking with your clinic…It’s a headache. \n\nTelling our families was the right choice for us. Because it meant they offered any help we needed, but also gave us space and didn’t bug us. \n\n“I can’t make it to Jackie’s baby shower” was accepted without question vs. “ohh, but she’s your favorite cousin, how could you miss it?!”\n\nUp to you. And maybe how needy/intrusive your family is.", "We’ve only told my mother in law that we’re starting it. No one else needs to know and the only reason we’ve told her is because I’m going to need her to come to some of the scans with me as they’re a fair way from home and my husband works and we only have one car.  Plus she’s terminally ill and I’m hoping it works so we can give her a grand baby"], "link": "/r/IVF/comments/16zs2ui/when_did_you_start_telling_people/"}, {"title": "Ivf genetics question", "content": "Husband and I both have NF a genetic condition \n\nHi all, \n\nTo cut a long story short, my husband and I both have NF1.\n\nWe are now wanting to have a baby, and will obviously go down the IVF route. What is the change that we have unaffected embryos - I know for one parent it’s 50% what it is with both parents being affected? \n\nThanks all", "num_comments": 19, "score": 2, "top_comments": ["Wow. I also have NF 1. I have never met another person in real life (have met others online) who has it. I wonder what the chances of two people with spontaneous NF getting married is. I am also a spontaneous mutation and my case is mild. No one else in my family has any symptoms. \n\nI think a genetic counselor could help you out. Do either of you have a doctor who specializes in NF? They could probably refer you. \n\nGood luck!", "I'm no expert but if I had to guess based on it being an autosomal dominant condition:\n\nAssuming it is inherited in a normal mendelian dominant/ recessive fashion and both parents have 1 mutant allele and 1 normal allele:\n\nYou have a 75% chance of zygotes having at least 1 mutated allele and a 25% chance of unaffected zygotes.\n\nI've no idea if this condition is embryonic lethal if the embryo inherits 2 copies of the mutant allele, but I guess with testing and IVF that doesn't really matter as no affected embryos would be transferred anyway."], "link": "/r/IVF/comments/18v2atw/ivf_genetics_question/"}, {"title": "6dp5dt and going insane ", "content": "I had my first transfer on 2/12 with an untested 3ab. I am going mad with anxiety. I have been having intense cramps; the ones that make you stop what you are doing until it passes. All my at home tests today are showing negative. I’m trying hard not to read into that, but it is so hard. All weekend long I’ve been bursting into tears. I want to test early so that I can process my feelings before going for my beta (2/21). My beta is the same day as my parent teacher conferences, which sucks. I will have a 12 hour day and will most likely have to hide in the staff bathroom and cry. \n\nAny positive/happy stories to help pull me through these next couple of days? ", "num_comments": 33, "score": 10, "top_comments": ["I know it would delay it but could you have them call your partner instead and find out at a better time like when you make it home?", "[deleted]"], "link": "/r/IVF/comments/1au9zz8/6dp5dt_and_going_insane/"}, {"title": "In Need of Suggestions for Next Steps", "content": "My wife and I just had our second miscarriage. We are currently doing reciprocal IVF and are looking for people's collective knowledge on a good next step of procedure(s) or testing to ask for.\n\nBoth of the previous miscarriages were early and we were told the likely cause was due to genetic abnormalities with the embryos. No further testing or procedures have been recommended.\n\nWe have also been discouraged from testing any embryos due to our ages and it would require freezing/unfreezing/refreezing. Additionally, it is provided by a third party and not our clinic.\n\nWe currently have two low-quality embryos left but are debating whether to discard them and do an additional retrieval. We are also debating changing who is the biological parent and who is the gestational parent. And there are a dozen different other things we could change as well such as sperm donor, etc.\n\nAll IVF treatment has been medicated including retrieval and transfers. Transfer protocols have included progesterone, estrogen, and baby aspirin. Endometrial lining has been within the appropriate range before transfers. HCG tests have shown good numbers for both pregnancies and have the appropriate doubling. Scans have shown good progress and growth has been timed correctly based on transfers, etc. Neither time did we have additional testing options for products of conception.\n\nAll this to say, has anyone been through this before and have any recommendations for the next steps?", "num_comments": 2, "score": 2, "top_comments": ["I’m so sorry for your losses 💔I’ve only experienced recurrent loss. Has your wife done the full RPL panel testing?You might want to consider additional testing before starting over. I did RPL with autoimmune testing and hysteroscopy, could be good to repeat because endometritis can occur after a miscarriage. After all my testing my doctor basically said it could be 1) bad luck 2) silent endo or inflammation 3) some other unidentified variable. But there’s a lot they can uncover and treat for with success."], "link": "/r/IVF/comments/1am52f2/in_need_of_suggestions_for_next_steps/"}, {"title": "Any single women doing ivf?", "content": "Where do you reside?\nI’m in a troubled relationship and just to enquirer I asked about ivf for single women in a few clinics. \nSo apparently the procedure will start only if there are two people. Either a husband for the woman or a guardian (parent) should sign …!\nI don’t know which century I am living in. What about women who are in late 30s no surviving parents , divorced or single women ??\nBad relationships are as it is very depressing, being single even more, and only ray of hope of family is to have a child and that’s also not possible without a guardian ????? Its just setback after setback for me", "num_comments": 59, "score": 33, "top_comments": ["Yep! Come check us out at r/SingleMothersByChoice! And I had to have someone ‘witness’ ME sign some online documents for me to use the donor sperm and I believe also with FET/Assisted Hatching. But that witness could have been anyone (other than a spouse). \n\nAnd I completely disagree with your your statement above,  “Bad relationships are as it is very depressing, being single even more so.”\n\nI would 100000% rather be single, independent, safe, happy, and free than in a bad/abusive relationship when trying to raise a child. I hope you take care of yourself!", "I started fertility treatment as a single woman with a sperm donor and no issues in my very conservative state (Missouri). \n\nI did get married during this time, so by the time I actually got to IVF I was using my husband’s sperm. But I did IUI with donor sperm and planned with the clinic to start IVF with donor sperm before we eloped", "I'M a single IVF mum from Australia.", "Legal in Mexico 🇲🇽 \n\nA girlfriend has a beautiful little boy from donor sperm, ivf here in Mexico.  Best of luck 🍀"], "link": "/r/IVF/comments/141bdc8/any_single_women_doing_ivf/"}, {"title": "Not sure if these kind of posts are allowed here, but will I be able to find my bio parents one day?", "content": "I’m 16M, I was always told I was born through IVF because my parents wanted to be open about it. \n\nI never really cared until recently, but as I get older I’ve been wondering if I have any siblings out there, and what my bio parents are like. I also struggle with mental illness and it would be very helpful to know if mental illness is genetic/runs in the family. \n\nI love my dad (my mom passed away when I was 12) so I feel kind of bad wanting to find out since I know he’ll always be my “real” dad, and he’s said he would be 100% accepting if I wanted to connect with them, but I have no idea where to start.\n\nIf there’s any sub this would fit better on plz lmk. Thanks for reading", "num_comments": 4, "score": 1, "top_comments": ["Just so you know people can do IVF with their own eggs and sperm and this is the traditional route.  It sounds like you know your parents used donor material, but you didn’t actually say that.  I just wanted to clarify."], "link": "/r/IVF/comments/mec49e/not_sure_if_these_kind_of_posts_are_allowed_here/"}, {"title": "Need a hug please", "content": "I’m 39 and tried ivf as a single parent and got 2nd blood test results today with decreasing hcg down to 15 (two weeks after transfer of the 5days embryo). It’s over and it feels like there is no hope now. So much time, money, efforts, stress and going through this journey alone and all is just a waste of everything. \nGive me a hug please. I know that I will try again but it feels so bad right now.", "num_comments": 4, "score": 10, "top_comments": ["Hey, I’m a single mother too. Been doing transfers for two years now - string of bad luck, you can search my post history. I too just had a chemical last month and am trying to transfer again in a week or so.  I know firsthand what it’s like to feel the loss of time, money, effort, hope and joy in this process. The only thing keeping me going is this is a dream I just can’t give up on"], "link": "/r/IVF/comments/18ym6uy/need_a_hug_please/"}, {"title": "Our journey is coming to an end :( ", "content": "My husband and I have been on our infertility journey for almost four years. We’ve been through countless tests, pokes, blood draws. Medicated cycles, 6 IUI’s, and two IVF transfers. We’ve had three miscarriages, and now a failed frozen transfer. We are absolutely just gutted and can’t believe we’re here. I never thought I would go through infertility, but I was so hopeful we’d walk out of this with our miracle. I just can’t believe we’re ending this empty handed. \nMy body has reached its capacity with treatment, and we will not be going through another retrieval. We’re taking time to process and grieve. We both know that we will be parents somehow, but right now we just can’t believe this is how it ends 😔. ", "num_comments": 107, "score": 375, "top_comments": ["It takes so much strength and awareness to know you’ve hit your capacity. I’m so appreciative that you shared this message. We all have to make these hard decisions but we have community here to lean on, whatever the outcome. You sound like an amazing person and I hope you show your mind and body love as you move ahead.", "Oh honey I am so sorry. I’m sending hugs your way. Please try to lean on your husband and stay strong.", "You are a warrior and you have your war scars to prove it. Infertility changes people. Please take time to heal yourself and your family. We had our failed efforts last year. Just one transfer with a tested embryo changed me. It was a 6BA embryo and normal. Week 8 no heartbeat. Turns out my normal baby had split into conjoined twins that did not survive. What shocked me was they measured right on target which means they had just stopped growing moments ago. That shook me out of my existence. To doctors I am just a statistic but to myself I am a failure. That’s when I chose to focus on myself my health my being. I got to working out again lost the pounds I put on and most importantly made myself a priority again. Ivf is still nature at play so for every one successful mother there is a mother like me who supported another journey but did not get a happy ending of my own. That’s been my perspective on the past 7 months. I hope you get your own clarity and peace of mind soon as well. My best wishes for your recovery and future", "Sending you love and hugs. Be kind to yourself. You have endured a lot. Take time to heal", "Truly am very sorry. Hugs ❤️", "I'm so sorry that this phase of your journey is not ending the way you had hoped. I hope you find some peace with it and trust in that there may likely be other avenues for parenthood for you too. Sanding love to you.", "Big hugs. I've gone through more cycles and 10 years of infertility. Finding More strength to go is really hard. I feel you. Maybe take a break and recalibrate.", "Your post made me cry. I hope you'll get to find peace and that life will reward you with some great new experiences and joy, in whatever shape or form they come.", "Sending love and hugs ❤️", "I’m so sorry. Sending you a huge virtual hug.", "Love and lots of Hugs to you friends! Stay strong & Stay positive", "I know you are in a lot of pain and that this is so difficult. Whenever you’re ready, I hope you consider joining /r/IFchildfree.", "So sorry. But i also called it a quit after 3 ER and no blasts for me.", "You always have a community here ❤️ I'm so sorry for your loss. Just make sure you take the time to feel all the feelings and process what you can without too much pressure. Big hugs", "I was in a similar situation, but went with an egg donor and had my son with little difficulty. It might be something to consider."], "link": "/r/IVF/comments/1b0yr2x/our_journey_is_coming_to_an_end/"}, {"title": "Life is unfair", "content": "TW: loss of parent\n\nER was scheduled for Thursday (11/9). Stims had been normal minus being a higher risk for OHSS. Late Wednesday night I received a terrible call, my mom had been in a car accident and didn’t survive. Despite this I went forward with ER. \n\nResults: 17 retreived; 15 mature; 8 fertilized; 2 frozen and sent for PGT testing. We are waiting now, again.  \n\nI had to not only deal with the sudden loss of my mother but at least 5 people asking if I was pregnant, one old bat even patted my swollen belly, at the service!!! No you ride people I had “surgery” Thursday and it is now Sunday and I am standing next to my mother’s casket. \n\nI am so mad and angry and lost. It’s not fair we have to go thru this, but now I have to deal with her sudden death and not ever being present again. She was an amazing grandmother and I am grieving that as well. \n\nSorry for the long post but I needed to get this out before screaming into the void.", "num_comments": 32, "score": 93, "top_comments": ["Wow sorry for your loss. The NERVE of some people is unbelievable.  \n\nWishing you the best in your ER, I hope you find peace soon.", "I’m so so sorry", "I'm so sorry for your loss. Wishing you and your family strength and comfort.", "I’m so incredibly sorry for your loss", "I am so very sorry for your loss. ❤️", "I’m so sorry for your loss ❤️🙏🏾", "Im truly sorry for your loss."], "link": "/r/IVF/comments/17ym240/life_is_unfair/"}, {"title": "To tell or not to tell?", "content": "My husband and I are starting the journey and am curious, who did you share with that you were on the ivf journey? Did you tell parents, in-laws, friends, etc.? How about your employer or co workers? Part of me wants to keep it private, but also a part of me feels the need to share what we are going through.", "num_comments": 119, "score": 11, "top_comments": ["Only tell people that you are comfortable checking in with or answering questions cause they will ask", "All of our family and friends know we are experiencing infertilityand seeing a  specialist for help. We then only shared with closer friends and select family that it's IVF and we continued to disseminate information from there.\n\nwe did not share the specific diagnosis because to be frank the reason why we cannot have children isnt anyone but my partner and I and our specialists business. I wanted people to know we are struggling though so that I dis not have to pretend and it would encourage thoughtfulness.\n\nMore importantly I wanted to add that you can change what and how much someone knows at any point. You can rescind \"openess\" if someone is crossing a line, asking too many questions, being invasive, or not being a safe space. Our parents are on an information diet because they could not respect our boundaries.\n\nIt's okay to share with someone and then realize whoops that's a mistake. While you can't take back what you've shared, you can discontinue sharing if that feels right to you. Don't beat yourself up of you share and then realize actually no, I don't want you to know anymore.", "I'm pretty open about all of this, but I'm kinda a duck feather personality. Nothing anyone says bothers me. My grandmother told my dad that maybe I should just consider adopting and he was so angry and offered and I was like 😎 yeah everyone is entitled to their opinion. I'm doing what I'm doing. \n\n\nThe only thing that irritated me was that a friend of mine attempted to time a pregnancy with my IVF timeline without consulting me. They seemed super interested and supportive and would ask about what I was doing and when. After my first egg retrieval was a bust she was really concerned asking how soon I could get back on schedule for an FET. I wasn't in a rush she seemed more concerned than me. Then low and behold she calls and tells me that she's pregnant, and mentions how hopefully my FET would be soon so we could be bump buddies. I considered the timeline and all the questions and I was like whoa! She intended to be pregnant when I would be. Mind you she already had 7 children. Unfortunately for her (and fortunately for me) my IVF journey was way more complicated than that. I had 4 egg retrievals in all with large paused between and didn't have my first FET until over a year later. Sooo maybe you should be a little mindful of who you tell 😅. ", "I only shared with people who would understand- friends who had been through IVF and friends who knew how IVF worked. The process was stressful enough I didn’t also want people asking a million questions or saying shit like “you only need one!”", "So many people sharing, wanted to give my two cents as someone VERY early in the process who is struggling with the same question!\n\nI’ve told my parents and in laws since we needed to collect their DNA via cheek swab for genetic testing (no way to hide that!). I’m not really sure how much of the extended family they’ve told v what they have kept secret… they don’t know dates of exactly when everything is scheduled for just that it’s sort of starting to happen this year. \n\nI told my boss and one trusted coworker because I am in the office everyday and have missed so much work for the near daily appointments.\n\nI’ve told a few very very close friends that we are doing IVF this year but no specifics on dates of transfers retrievals and I plan to keep it that way so I don’t have to provide updates on how things went etc. \n\nIt’s such a tricky balance of not keeping it a secret that this is our journey but also not letting too many people know too much. I’ve found most people have not asked a ton of follow up questions, and many have said they know so many people who have done IVF! \n\nWhatever you do, don’t worry about what everyone else did- go with your instincts and what feels right to you on who to tell and how much to tell each person! That said, I hope hearing everyone in this subs experiences and reasoning can help you make informed decisions! ❤️", "- Most people at work know that we’re trying to get pregnant via IVF. I tend to be more candid with people not as close to me because I don’t care about their opinions, haha. \n- I told four of my closest/best friends; they are all open minded and supportive people, and while none of them have undergone IVF, they are all parents and can give me good advice. \n- My sister found out because she FaceTimed me while I was in the process of administering my belly shots before ER, and asked what I was doing, but I let her know we aren’t telling anyone else until we are into the second trimester at the earliest. I recently told my twin brother, but no one else is allowed to know. \n\nWork folks typically aren’t nosy (or care) enough to inquire too much, but I was selective with my friends and family. I specifically asked them not to share publicly, and especially not to tell my mother because she would have more interest/excitement/anxiousness about it and I didn’t want to deal with constant questions and inquiries for updates when I wasn’t ready (read: I am introverted = low energy, so too much constant attention from my mother would drain TF out of me. 😆).", "I had to tell family because I was diagnosed with a genetic disorder. I also told my husband’s family because we needed money. Then I have told a few friends. I’ve been vague with work. I am a talker - I talk about everything in my life - so I would be miserable if I hadn’t told people. But, I probably should have reined it in with a few of the friends. Oh well! ", "We told all our family and close friends and I really needed their support. It can be an obsessive time and it's great to have someone to chat with about it, especially another woman. \n\nThat said, you may want to think on whether you want to share the exact transfer dates. We have always shared this info with our close family but we are now in a situation where we have had our first bfp in 3 years and would like to keep it to ourselves until the risk of miscarriage starts to decrease. However we don't really have that luxury!", "We told a couple of close friends, definitely no coworkers or employers. My wife told her sisters once we were starting the FET stage, but I don't think she gave them any info about the specific dates, so that they wouldn't actually know when the pregnancy test was and we could share or not share the outcome in our own time. I definitely appreciated our friends' support though, it was a huge help to have people we could talk to about it in detail.", "In the beginning I told all my friends and family talking about the experience helped me and I was pretty casual about it. \n\nI regret sharing with as many people as the journey went on and I had to continue sharing bad news and updates.\n\nMy advice: share with your closest friends and family who you would be comfortable to go to and want to share your hurdles and sad moments with as well. They will pick you up and understand but don’t share with everyone as they will continue to ask you! Even though intentions are good the check ins start to feel cumbersome if you end up being over a year in the process", "I told everyone. Turns out a few friends were also doing IVF and we went through it together", "I have told everyone and been very open about it. My friend put together a GoFundMe (with my permission) for us to help with the financial barrier.  My friends and family shared it on social media, I don’t have instagram or facebook. \n\nEveryone at work knows due to me traveling for IVF I have had to take more than normal amounts of time off. \n\nI’ve been through 3 miscarriages and 3 years of struggling with infertility. I might be a little numb to it by now, I dunno. I have struggled with people’s stupid remarks and lack of understanding. I once had a good friend of ours try to high five my husband at his daughter’s birthday party saying “I got her on the first shot”. I want more people to be aware of how common infertility and miscarriages are, how to be more considerate when asking family building questions, making jokes, and sharing pregnancy news. \n\nSo far (I’m in between ER and FET) everyone has been respectful and very supportive. Sometimes I feel like I’m floating with all the support and positivity I have surrounding me and this journey. I will ask everyone to allow me time after my FET for any updates.", "We chose not to tell 99% of our friends and family.  It just makes the challenging journey more stressful, especially if they all conceived without IVF, they just won't understand.  Also more often than not it takes a few shots before things work out, so having to tell people who are following your journey?... no thanks.   But we are more private introverts, so may be different for others.  \n\nAfter the 4th cycle we were lucky to get pregnant and everything has worked out amazingly for us, but on 2 people knew about it, a few work colleagues we told at 28 weeks, and all the rest found out 3 days after baba was born... and yes shock horror, and yes some wanted to see proof that we did actually have a baby... lol.  And yes some were hurt and upset and wanted an explanation as to why we didn't tell them, but on reflection we 100% done the right thing, and it was part of our plan to de-stress and just focus on us.", "We told no one. Didn’t want people hovering and asking a ton of questions. They may mean well checking in but some days I just didn’t feel like “people-ing”. Now that we are done with IVF I will most likely share what was going on with immediate family but that’s it."], "link": "/r/IVF/comments/1afm5qa/to_tell_or_not_to_tell/"}, {"title": "Family haven’t bothered checking in", "content": "I (34F) have just completed my first round of icsi with my partner of 9 years in the hopes of embryo freezing (currently have 5 fertilised on day 1). It has all been very positive so far and my parents had been supportive and open to talking about it all. They understood the significance of it, how hard it could be physically & emotionally and what was involved.\nWhen I started stims, only my sister checked in with me over the 15 days.. my mum & dad never reached out but would continue to chat in various whatsapp groups about unrelated stuff. I sent a few updates about scans over whatsapp, but got either no response or some emojis back. \nAfter an emotional day 10 scan we thought we might have to cancel- I sent an update to my mum about how down I was, scared etc & that I wasn’t up for talking yet and she said “what will be, will be” and.. wait for it.. sent photos of her new haircut into a group whatsapp asking did we all like it. The lack of empathy astounds me.\nI had to stay on stims for 15 days in the end and knew I would end up missing my dad’s birthday dinner. I let everyone know and got no response until my dad text me day before ER to ask had I “changed my mind” and would I be at the dinner. I responded jesus christ dad.. and that was it. \nNo one checked in the day before/ day of/ or days following my ER. No one knows how the procedure went for me, how I’m recovering, or many eggs & embryos we got. Even if they didn’t know what to ask, hypothetically, you would at least check in or wish your daughter well…. surely. \nI’m grateful I had a straightforward journey with the stims but that feels irrelevant. While I’m very independent, I just can’t wrap my head around my parents completely ignoring the biggest decision I’ve ever made and not acknowledging what I was and AM physically and emotionally dealing with.\n\n*Edit: I don’t expect my parents to understand IVF or fertility issues. Not understanding doesn’t excuse ignoring it and not acknowledging a significant medical procedure under sedation ", "num_comments": 60, "score": 30, "top_comments": ["My mom and in-laws were weird during the process this far. None of them felt comfortable asking how things were going and I believe they had two main reasons: they didn’t want to overstep the boundaries and they didn’t understand the process well.\n\nThe boundaries thing was obvious to me because they know how hard is the infertility “journey“ (hate that word lol) and they really didn’t want to seem pushy. My MIL used to ask us for grandchildren constantly and I eventually broke down and told her how hard it was for us, because we really want to give her a grandchild but we weren’t able. She was very supportive and never asked again, unless she was kindly checking how things were going and not going further with any questions, so that we didn’t feel pressured.\n\nThe ignorance about the process is something that I have noticed since the beginning. Nobody in both families has ever gone through the process, the infertile couples simply have given up on having children. My in-laws seem to think that asking us about it is almost like asking how many times we are having sex. They are very discreet, don’t really understand how everything works (I’ve explained but they don’t seem to grasp it) and feel extremely uncomfortable asking us about eggs, fertilization, embryos. They think that’s to intimate.\n\nI don’t really blame them and, honestly, I kind of feel better that they aren’t super involved. I want to go to them with the news of a pregnancy, not of how many eggs, how many blasts, how many many euploids, etc.", "Do they really want grandchildren? It could be that it's too emotional for them to discuss because they are worried about getting their hopes up too early or such. And the haircut thing is your mum's way of saying that life is as usual, she's not too hung up on getting that granchild to make it easier for you in case it doesn't work. Just a thought, of course.", "I'm sorry. When I read 'what will be, will be', my heart sunk, as my mum says exactly the same thing. I'm on day 3 and they've not even contacted me. Good luck with your next embryo update, I hope you're recovering well.", "Gosh OP that really blows! I had a similar experience throughout my egg retrieval and now transfer. It has really enlightened me on the appreciation I have for my partner and their unwavering support. For me the hardest part is knowing if roles were reversed I would be there for any of them. I equal my parent’s lack of understanding to them just avoiding anything is “wrong” with us and that making them uncomfortable therefore they avoid the situation. They too have been pretty blasé about it all. It hurts and you’re seen! I hope you have a great outcome with your embryos and thank you for sharing your experience! ✨💕", "Oh gosh OP. I’m sorry you are having to deal with these feelings on top of everything else. \n\nI shared with SIL last night that we were meeting with a specialist to discuss options. She started asking questions about it feeling really soon on our journey. (TTC for over a year and both my husband and I are 36). What the different types were and then asking about cost and insurance. (I wasn’t super thrown off because I know she comes from a place of love).\nAs I was texting a response back to her she actually sent a message apologizing for the questions and how she just realized she was being pushing and how embarrassed and sorry she was. \nI was so moved by her quick apology and let her know that I appreciated that she recognized that on her own. \n\nWe are still very early on the journey but it’s been interesting to see who asks questions and who doesn’t bring it up at all. \n\nCould you bring it up to them and let them know how the whole situation made you feel? Is it possible they didn’t know what the kind of support you were looking for? I guess if they give a shitty answer then you know what to expect from them and can change your expectations to avoid them letting you down again. \n\nHugs!"], "link": "/r/IVF/comments/1as67o8/family_havent_bothered_checking_in/"}, {"title": "What would you do?", "content": "Hey ladies 😊 what would you do if you’re in my shoes? I’m single, 38 with no prospects although I plan on getting out there after I complete my egg retrieval next month. I’m hoping to freeze somewhere between 17-20 eggs for one child. \n\nMy fear: \nI want to be a parent with a partner but dating nowadays is challenging. I can only control my actions but I do not want to settle. My doctor told me a good time to try for a baby is between 40-44. What age would you try for a baby if this is the range you were given? I just want to have a timeline so time doesn’t get away from me. Being a single mom is not out of the picture but not something I planned on. I feel 42 is good but I don’t know. So tough.", "num_comments": 19, "score": 1, "top_comments": ["I would very much not wait till 42. I’m 34 doing single mom by choice and I started the preliminary tests at 32. One failed IUI and two failed FETs later and I have nothing to show for it. If you want to have a baby more than you want to have a partner (100% the case for me) just make embryos."], "link": "/r/IVF/comments/1aecm2z/what_would_you_do/"}, {"title": "First ER bit scared", "content": "Hi all,\n\nI have my first time egg retrieval Tuesday and I'm a bit scared. I can handle pain but this particular procedure just seems daunting to me. \n\nMaybe I miss it but I don't see a lot of conversations about the whole process itself in this sub. I think the whole 9 yards with having to inject two kinds of hormones every evening and then being scared with every ultrasound and every step that something might not be the way it's supposed to be is quite emotionally (and physically) tiering. Now I'm scared of the procedure and then I'm scared there won't be any good embryos and after that it's another 2 weeks of waiting and it leaves no room for thinking about all it means to become a first time parent (which I of course really really want but being pregnant and giving birth and becoming a mom is also of course a big thing, no matter how much you want it.)\n\nSorry for the rant, I think I'm feeling very overwhelmed and tired at the moment and I just needed to vent a little bit. \n\nI think in the end my question is, for everyone who has had egg retrieval done, how was the process for you?\n\nEDIT to say, thanks everyone for the replies! You are all so sweet and it helps, I'm reading through it all now. ", "num_comments": 49, "score": 15, "top_comments": ["Honestly, it gets built up more in our head due to anxiety… the waiting is the hardest part, but once they give you the sedation it’ll be over before you know it! Sending you good juju!!", "That’s exactly how I feel!! I have to compartmentalize everything. The first part was getting over the lab / ultrasound before stims. Now it’s the stims. Then it’s getting through the next appointment, but the stims kind of overshadow that. Then the egg retrieval, then hoping for everything after being ok, then the transfer it’s just never ending", "I had my first ER yesterday and the process was fine! I’m just going to describe all of it since that seems to be what you’re looking for.\n\nI went in an hour early and had time to get changed, take my zofran, and chill on my phone for a bit before the embryologist, anesthesiologist, and doctor performing the surgery all came individually to talk me through their parts of the process. The doctor performing it told me how many large follicles I’d had at my last monitoring appt and how many eggs she expected to retrieve.\n\nI haven’t been under anesthesia since I was 16, so I forgot how quickly it knocks you out. Then I woke up what felt like a few minutes later with a lot of pain in my abdomen and asked if they were going to put me back under because I didn’t realize it was over! They gave me pain medication immediately and let me go back to sleep. When I woke up next I asked for more pain medication and they told me what they’d already given me (50mg I think of fentanyl) and said I could have a different med if I needed it, but I opted to just wait until I got home. They also told me how many eggs had been retrieved at this point. They brought me juice and snacks and about 45 minutes later let me get changed and helped me down to the waiting room, where they’d called my husband to let him know I was ready.\n\nI was honestly in a lot of pain afterward and moving that day was really hard, but they gave me plenty of medication to manage it and it’s a little better today! I suspect tomorrow I’ll be back on my feet properly.", "I’m not sure how your clinic does ERs but I was sedated for the procedure and it was a breeze the 4 times I did it. Just remember to advocate for yourself and don’t be afraid to ask for pain medications when you need it!", "I was very scared about it but it was a lot easier than I thought. The sedation is wonderful, I have never been under anestesia and got what I felt was the best rest of my life. I had to take it easy for 3 days, just chill at home, wasn't too bad really, just took basic analgesics. By the 3rd day, I was back to my normal life. Had some mild cramping in my ovaries for some weeks when I sneezed or smt but nothing major."], "link": "/r/IVF/comments/19c761f/first_er_bit_scared/"}, {"title": "Autosomal Recessive Gene Question", "content": "Hi All, \n\nJust got results from a carrier screen. If one parent is autosomal recessive and the other does not have any disease versions of the gene at all, the child has 25% chance of being Autosomal Recessive, correct?\n\n&#x200B;\n\nThank you.", "num_comments": 2, "score": 1, "top_comments": ["50% chance of being an unaffected carrier like the parent, near 0 chance of being affected by the disease (the \"near\" part being the extremely rare possibility of a de novo mutation or inheriting an undetected disease variant from the other parent)."], "link": "/r/IVF/comments/16nxoo7/autosomal_recessive_gene_question/"}, {"title": "Day 4 & Cheating Husband discovered", "content": "I am completely besides myself. I just found nude photos, on day 3 of the embryo wait, of the cleaning lady 6000 miles away (back in Mexico). \n\nI’m embarrassed to admit this isn’t the first time with her, she and I have had conversations (she swore she would leave him alone, but now sends nudes). \nI’m torn up because they talk regularly and the emotional connection kills me more. \nI attempted to draw the boundary that a friendship with such a woman (that he’s known since childhood) that I don’t know, is inappropriate and unacceptable. \n\nNevertheless, now what? Discard our embryos? Just throw away life that I’ve been struggling to make the greater part of my 41 years. It would be hard of course to be a single parent, yet I’d be willing for the baby. \nHowever what could I possibly say to a child later on, I knew your father was a cheat but I brought you into the world anyways, knowing you’d have an inherited trauma of an absent parent… and with him? Who hasn’t quit it with her when there is in fact, something between them …. \n\nI’ve already had three serious, long term relationships that left me because I was unable to give them children. And now this, after three years of marriage I wake up going on 42 with only a 5% chance of conceiving. \n\nThe other woman of course is playing the victim card (because I made a post about her indiscretions for the ‘in Mexico’ audience). To which his family is being threatened for now. \nSo clearly he’s beyond angry with me, thus we’re beyond broken. \n\nIs it terribly wrong of me to proceed without him, with his DNA (he already signed consents), thus treating him as a sperm donor so-to-speak? Or do I just give up the embryos and lose all hope for the future (as I’ll never be able to afford all of this anytime in the near future). \nWhat’s an infertile woman to do??", "num_comments": 66, "score": 33, "top_comments": ["I wouldn’t use it.  Leave them banked.  Do another cycle and ER with a donor asap.  Too much legal mess to sort out.  He would have a day in your life for at least the next 18 years, where you can move to, etc.  if you’re still married when you give birth the child is his until he signs away his paternity, that involves lawyers and judges.  Cut all ties and start over (IMO as a single person going forward with a donor.)", "Oh man I’m so sorry! I’m using a sperm donor but your situation is much different than mine. I think you need to have a conversation with him where you both discuss what happens to the embryos and see if you can get his consent to sign over all rights to you solely. This is an impossible situation and I feel for you", "[removed]", "WOW! I am so sorry you are going through this. I don’t think you should use his sperm, unless he agrees to it again after this new information has come to light.", "Use them and kick him out. Byeeeeeeee!!!!!!!", "So the issue is that he'd legally be required to pay child support so I believe he can prevent transfer of the embryo. On top of that since he's not actually a sperm donor he could fight for custody and visitation. Would you want to deal with that? If not, I'd try to make new embryos with donor sperm so you don't run into all of that drama of court hearings and 18 years of visitation with your husband(ex husband I'm assuming now?). I'm so sorry you're going through that"], "link": "/r/IVF/comments/u9lmnv/day_4_cheating_husband_discovered/"}, {"title": "Virtual hugs please", "content": "My mom and I got into huge fight last weekend and she basically told me I'm a lazy parent (I have a 4 y.o) and I'm a shitty mother and that I deserve to suffer with infertility because I'm not a good mother to my 4 y.o. she told me she won't support me through IVF because she doesn't think I  deserve to be a mom a second time.\n\nI have no idea where this is coming from but all I know is my feelings are completely shattered. My husband and I have been in this whole ivf process dor 3 years and she threw rhis at me when we are getting ready for another cycle. I ha e no to other support excerpt my husband, my best friends and cousin. I am in need of just a hug at this point. I guess I needed a place to vent idk im sorry friends.", "num_comments": 4, "score": 7, "top_comments": ["(Try to) don't get influenced by outside judgement. Your value as a mother and decision to try for another child comes within you and your family (your husband). Biologically we tend to keep looking for the support of our parents also growing up and it is sad to realize that they are adults as others and they can sometimes be wrong and have toxic behaviors toward us. I'd work on it with a therapist."], "link": "/r/IVF/comments/1bic4o9/virtual_hugs_please/"}, {"title": "Mourning the life you don’t have", "content": "Does anyone else have days where you’re just sad/mad that you still don’t have the life you dreamed of? Ugh some days are so hard. \n\nWe just booked a little getaway to Paris. You know who can’t book a trip to Paris on a whim? Parents! 😂 trying to make the best of things.", "num_comments": 45, "score": 174, "top_comments": ["Mourning the life I don’t have and the life I used to have before infertility treatments", "I always wanted to go back to the pre ivf life . Still here after 5 years since I first started not knowing it’s gonna be such a long journey. Had I set my mind in something like doing a phd or even medicine could have very well accomplished that . Fertility treatmtreatments are soul consuming", "Yes so hard!! And doing all this and ending up with nothing is a big worry too, no family no money and years down the pan. Not knowing if it’s gonna work is so stressful isn’t it. Good for u going to Paris that sounds gorge have fun 🤩 and yep agree at least we are super tough cookies even more so now ! Xx", "Just got back from Mexico myself. Drank ALL of the tropical cocktails. It was amazing."], "link": "/r/IVF/comments/198wheb/mourning_the_life_you_dont_have/"}, {"title": "Really funny IVF podcast 40+", "content": "\nThe comedian Joe List and his wife are expecting a baby using an egg donor. He discusses IVF, using an egg do it, and being an older first time parent on the Honey Dew podcast with Ryan Sickker. \n His take on the entire process is super funny and relatable. \n\nhttps://podcasts.apple.com/us/podcast/the-honeydew-with-ryan-sickler/id527446250?i=1000625904468", "num_comments": 1, "score": 13, "top_comments": ["Thank you for sharing- love any good new podcast episodes on ivf experiences"], "link": "/r/IVF/comments/169i72u/really_funny_ivf_podcast_40/"}, {"title": "What is it that causing infertility in our generation?", "content": "Do people think it’s our modern lifestyle, chemicals, break down in genome, Radio frequency etc that is cause infertility? \n\nHow come our parents generation grandparents great grandparents and thousands of generations before us have been able to produce children and our generation x, y and millennials are having issues.  \n\nI feel like I have been robbed of fertility and natural god given ability to bear child.", "num_comments": 124, "score": 29, "top_comments": ["I think people just talk about it more and have the platforms to share so it seems like it’s happening more often compared to older generations.", "It took my grandmother 2-3 years of active trying to get pregnant with each of her children, her mother had 3 children and 8 miscarriages. A lot of the older people I know know many people who didn’t have children and quietly adopted. It also wasn’t talked about openly back in the day.\n\nInfertility isn’t new.\n\nAs for why it’s more prominent now, pretty sure it’s because a lot of people are waiting way longer to start having children.", "Biologically, our bodies are made to carry babies pretty early…earlier than the average woman today wants to have children. Our previous generations had their first child, on average, between 23 and 24. For the past decade or so, we’ve been hovering at around 30. That means we have more people trying later and our teen pregnancy rates are also dropping significantly. \n\nIt’s certainly not the ONLY factor. But it is a big one in the reasoning for the increase in advanced reproductive care being needed.", "I saw a scientific program on tv about what is causing higher rate of infertility, higher rate of breastcancer and also that young people enter puberty earlier than before. The researches theory was the plastics in our environment, plastics have something in it that resembles estrogen. Then of course there is this thing about waiting longer to start our families, that impact is probably quite big.", "I personally worry that we are just carrying the burden of generations of toxic load in terms of chemicals and other compounds we come in contact with. They used to say smoking during pregnancy was safe, now we know it causes health issues (and I would be willing to bet other chemicals and compounds we encounter daily will eventually be shown to have negative effects) but we are carrying the toxic load of what our parents did while forming the eggs/sperm that made us (and our parents were carrying the burden of what their parents did, so on and so on). We encounter so much unavoidable junk in our environments and at some point human bodies will start to struggle processing and purging it all. 🤷🏻‍♀️ so now we have rising numbers of infertility and other health problems.", "My grandfather was infertile, both his brothers were as well. My mom was adopted, so were her cousins. Back then there was orphanages full of babies that needed homes. I think infertility wasn’t as common, it wasn’t really accepted to be a single mom and there were less abortions leaving lots of unwanted kids. Infertility was always a thing, just not as noticed or talked about \n\nA lot of us are waiting until our mid to late 30s to start having kids. They don’t warn us how difficult it may be or offer fertility testing when we are young. That along with garbage food, pollution and other toxins.", "My parents and my SO’s parents both went through infertility for five to six years", "I feel like older generations do not / did not like talking about it if they did go through it. Sometimes I feel like as if IVF was something to be embarrassed about back in the day or looked down on. So many people just dont share their experiences whereas the younger generations just genuinely do not care to share their experiences and let people know about it.", "Agree with everything that’s been said so far. I’ve been thinking tons about it lately and ever since mass industrialization of our food and especially preservatives created to keep WW2 food for longer, we discovered it was cheaper to produce and never got off war diet rations. Also plastic wasn’t even around until the past couple generations. Then mass chemicals sprayed on our food, our bodies, in literally everything we touch and wear and smell..! Preservatives, plastics, pesticides, and not to mention delayed time to start families… this will be talked about the way we discuss lead poisoning, smoking, and asbestos snow. The chemicals they came up with from the 30s-60s… I think were just starting to see the effects of this as it compounds in later generations. We even have scientific evidence proving how harmful these things are, but until it personally affects you, nobody cares.", "There is a huge upswing in gen x and millennials. Urologist said there is a huge increase in people in their early and mid 20s but they don’t know why.", "I got it bcz of my rare autoimmune disease!", "My aunty couldn't have children but if IVF had've been available to her she may have. It was an emerging technology and she was a little too early for it. We are so lucky to have it, and the technology is improving all the time.", "Also isnt ivf and iui still a newish science or am I wrong", "I think it's talked about more today and people are more open about infertility, which makes it seem like a new issue. I also think people dealing with infertility in the past didn't have the science we have today to be able to conceive despite infertility issues - medicated cycles, IUis, IVF, etc. wasn't available like it is today. Fertility clinics didn't exist not because of the lack of need for them but because of lack of resources and science. Just my thoughts!"], "link": "/r/IVF/comments/16s89zh/what_is_it_that_causing_infertility_in_our/"}, {"title": "Podcasts and videos on things like ivf, about or from child perspective?", "content": "Maybe perspectives beside very detailed medical log of parent journey\n\nOr where ask for resources?", "num_comments": 1, "score": 1, "top_comments": ["You mean how to explain to your child they were Ivf conceived?"], "link": "/r/IVF/comments/12ntw98/podcasts_and_videos_on_things_like_ivf_about_or/"}, {"title": "What are these blood tests for anyone know?", "content": "Hi everyone\nI'm starting my first round of IVF soon and as part of this my clinic wants me to do a thyroid test, full blood count to look at anaemia, and vitamin D.\n\nI didn't think to ask in the consultation and now I'm wondering what are these tests for, like what do they indicate? I did egg freezing in the past a few years ago and don't remember doing them. But I suppose I could be forgetting. I'm in the UK doing it privately if that makes any difference, with no known fertility issues (doing this as a single parent).\n\nThanks for helping 🙂\n\nEdit: thanks everyone for explaining for me!", "num_comments": 6, "score": 1, "top_comments": ["Thyroid and vitamin d affect transfer and amh etc.. I think they are standard test before ivf."], "link": "/r/IVF/comments/17qyb5k/what_are_these_blood_tests_for_anyone_know/"}, {"title": "Low Beta/rude doctor", "content": "I’m 9dpt and my hcg is 46. My doctor basically laughed at me when I said I was concerned as my son was 310 at 10dpt. Asking me, with a laugh if “I was a parent that compares children ?” \n\nWhy was he like this? Is he gaslighting me and acting as if I don’t know that 46 is a low number? I’m absolutely changing doctors as my clinic has a few other drs. \n\nBut another than that ? What do I have to look forward to? Hell on earth for the next few weeks? \n\nSorry I should be thankful and hopeful and I am, I’m just sad. I do have my son. I will be okay. I just need more time. \n\nHoping for a miracle.\nI don’t know why it has to be this hard ? God bless us. We don’t deserve this heartache.\n\n\nUpdate:\nsecond beta was 224\nthird was 523\nWent for sonogram a week after my 46 hcg- and, there is the black dot! I will continue to update \n\nWent for second sonogram at exactly 6 weeks and heartbeat was found !!!!!!!!!!!!!!!!! \nGod is good !!! ", "num_comments": 21, "score": 16, "top_comments": ["Oh fuuuccckkk this dude! At my clinic, with a beta of 46 they’d be trying to manage expectations not gaslighting you. Yeah betas are different person to person and pregnancy to pregnancy but something under 50 is potential chemical while over 300 is not.", "That was incredibly rude and also my doctor likes to see a minimum of 50 at that point, so you are not wrong.\n\nNot sure if it helps, but my beta was 33 at 8dp6dt, and my doctor told that he was worried, but my next beta went up a ton, and I’m currently 16 weeks pregnant with no issues so far. The nurse who called to tell me the second beta number was so nonchalant about it and I was like the doctor was just freaking out a couple days earlier?? And she didn’t really get it, but I’d spent the last couple of days thinking I was losing the pregnancy.", "I’m sorry you are going through this. Shame on your dr. for treating you that way. \nMy numbers were super low and I had some bleeding but all panned out well for awhile. With the bleeding, the dr. told me to prepare for loss. All went great with the rest of my betas. I did have a 12 week loss but was unrelated to beta. \n\n18 day 6,\n27 day 9,\n111,\n308"], "link": "/r/IVF/comments/188igdl/low_betarude_doctor/"}, {"title": "I’m an IVF twin- both of us have health issues and need a family medical history, how do we proceed?", "content": "I think the title does an alright job at summarizing, but I’ll elaborate :) I will preface this with I’m sorry if this isn’t the right sub, this is the only thing I could think of, and there’s barely any information online about double doner kids. I’m 19, and my twin brother and I were double doner conceived. It’s extremely frustrating, and I wish there was more resources for both IVF parents and children of IVF, but I digress. \n\nBecause of this, I have no family medical history, only my brother. Both he and I have had medical problems growing up, but they’ve progressively worsened over the last few years for me, and more recently for him. Doctors are struggling to diagnose us, partially because we have no family medical history. My issues have always been more pronounced, and I’m exhausted living like this. \n\nI don’t know how to go about gaining that information, and my parents don’t either- they were against the idea for most of my life, but my brother’s recent health has concerned them and they’re open to the idea if the two of us can figure out how to access said information.\n\nDouble doner, or single donor, parents, or honestly anyone else who has half a clue: Do your kids also struggle with health? How did you provide family medical histories? Please help?\n\n\nTL;DR: Chronically ill, double doner child, I need a family health history and I don’t know what to do. My parents don’t know either/don’t care enough to help us (my twin brother, who also has health issues, and I) find out. Please, any advice or direction is highly appreciated.", "num_comments": 17, "score": 4, "top_comments": ["Are you willing to take a DNA test? We’re happy to have you over at r/donorconceived, we can pitch in as you search. \n\nAlternatively, do you have adult photos of either donor? There’s a post on r/recipientparents that can help you find either donor’s real name via a search engine called PimEyes.", "I'm also donor conceived (through iui). Good luck in your search."], "link": "/r/IVF/comments/18nzywa/im_an_ivf_twin_both_of_us_have_health_issues_and/"}, {"title": "There is nothing more unfair than infertility.", "content": "After over two years of being poked and prodded and everything else, my husband and I finally have a mostly clear path forward. He had his microTESE last Wednesday the 20th and it was good news. Five straws of normal looking sperm, not a lot of movement but we are hopeful they can get some moving after thaw. We just started feeling like okay, this is actually possible for us..if only we had the 17,000$ we need to actually do IVF right now. \n\nWe are on a mini vacation at my parent’s lake cottage up north to heal and relax from all the stress. During our vacation my aunt calls to tell my mom that my cousin who’s about a year older than myself (27) is pregnant. Normally would be nice news, only she had kind of run off long ago and has been using opiates and living kind of all over with her loser boyfriend. My aunt only just found out and will be taking in the baby when its born in about 6 weeks. \n\nAll I can think is how unfair this all is. We want a child so badly. We don’t drink or smoke and have paid thousands of dollars just to get to this point. Yet my own relatives are out there with no disregard for themselves or their unborn child who will be born with opiates in her system. \n\nNot sure where this post was going, sorry for my rant but I just had to let this out somewhere. 😅", "num_comments": 106, "score": 140, "top_comments": ["If you all can't be civil and non-judgemental, then don't respond at all.", "I’m sorry people are picking apart your post. This makes me sad. You are entitled to your feelings and they are valid. There is no wrong way to feel in my opinion. This is an extremely hard thing to go through. I wish you all the best.", "i feel you. my husband and I have 23 nieces and nephews and none of our siblings ever had fertility issues. its so beyond frustrating. we've spent 40k on one cycle of ivf. nothing about it is fair, at all :( my heart goes out to you.", "Sorry to hear that you’re going through this. I feel the same sometimes. Feels like I’ve tried so hard to do the right thing my whole life and now I can’t have a family. It hurts my heart. I’m sending you good vibes ❤️", "The \"why me\" bug bit me last week as I sobbed on the phone with my fertility receptionist trying to get my husbands referral sent to another doctor. It had been a back and forth for 3 weeks and it's been a 2 year journey. I just cried at the injustice of it all.   \nIt's totally okay and normal to have these emotions, we just can't let them take over."], "link": "/r/IVF/comments/w9l642/there_is_nothing_more_unfair_than_infertility/"}, {"title": "How much of traits can I select in an IVF?", "content": "As I have observed siblings often have different heights and body types from each other despite having the same parents. I chalk that upto the luck in receiving the genes. \nHowever as IVF is a medically planned pregnancy, how much can we select the genes the child would inherit. For example can we:\n1. Select the gender of the children? My understanding is yes\n\n2. Select whether to have twins or triplets ? My understanding is yes and infact this happened frequently in China\n\n3. Can we select the child to be taller (while still using the same genes of the parents)? I have no idea if this is possible\n\nPlease let me know. I'm curious ", "num_comments": 14, "score": 0, "top_comments": ["I’m going to assume you are curious about IVF but FYI it’s a little offensive. The vast majority of us are doing IVF because of infertility not to pick a designer baby and frankly it’s offensive. This isn’t done because I want a special pregnancy. Infertility is tough and this is thousands of dollars with no guarantee for any child much less one of a height preference. \n\n\nBut I will answer you questions to the best of my ability. \n\n\n\n1.  My clinic picks the embryos based on what they feel is the mostly likely to lead to a viable pregnancy. I know I’ve read on here some countries won’t let you pick gender. Some do. \n\n\n2. The standard is one embryo (euploid) for transfer. My clinic told me they would only do two embryo transfers if they were untested and I had multiple failed FET. There’s a chance of embryos splitting in the womb anyway and causing identical twins. \n\n3.  No. \nI did not do PGT-M testing so I don’t know as much but most people do PGT-M to check for genetic mutations and diseases they don’t want to pass on. Not something as trivial as height.", "Wtf is this question? I hope this is a 14yo kid writing a biology ethics paper and doesn't understand how inappropriate and offensive this is."], "link": "/r/IVF/comments/1b4tyf1/how_much_of_traits_can_i_select_in_an_ivf/"}, {"title": "Does it bother anyone else when others refer to IVF babies as test tube babies? ", "content": "My husband and I went over to visit his parents the other day. My husband was updating them about how things are going and more or less complaining about the surprise bill we received from the clinic. His mom spoke up and said “oh your talking about the test tube babies right?”. Her question irritated me because she said it in a really condescending manner. She hasn’t been the kindest towards me since my husband told them about our fertility struggles. I hate the idea that if IVF even works out for me this lady will possibly treat her grandchildren differently because of how they were conceived 🤨🙄 \n\nBoth of our families are LDS/Mormon, IVF is well accepted and encouraged in my religion. Yet people are still judgmental towards IVF ", "num_comments": 97, "score": 79, "top_comments": ["When I've had people say that to me (usually friends as what they think is a \"Joke\") I like to respond with \"yeah, I just didn't want one of those cheap free ones\".\n\nThey usually get the point I'm trying to make.", "I was an IVF baby born in 91. I got called a test tube baby allll the time. I would say \"isn't science great? I hope I grow a tail one day!\" and that usually shut them up.", "I feel like this was the era of John & Kate plus 8.  I suspect trends in delayed family building will normalize this for future generations.", "No, but what if people started referring to babies in this way (including where they were conceived): hi, is this your bar restroom baby?  Or your mile high club baby? 😂\n\n\nAlso, ignore her question, it’s rude and none of her business.", "My internal comeback would be - ‘you won’t have to worry about your test tube grandchildren visiting you in the nursing home!’\n\nBut I’m petty lol. \n\nHonestly - it seems like people are torn on the phrase, and I get to a certain extent the older generation, but even then - they can’t be that dense….my opinion doesn’t matter, but I think there is still a lot of hidden shame around IVF, even  for women going through it, so using terms like that is a defense mechanism because the reality is really dark. I see the onesies that say - I’m so chill I was frozen, and not to hurt anyone’s feelings - but it personally gives me the ick factor. Like we have to joke about our situation and somehow our experience is less than or our babies are less than because we couldn’t post the perfect stories on instagram so we make light of it. I’m not saying i haven’t relied on dark humor during all of this, but not at the expense of my future pregnancy or how I conceive my children. Because we’re not the ‘chosen ones’ with the uteruses paved with gold, we’re suffering silently and then people still say stuff like this and it pisses me off. \n\nWe just sit there and are sad - we self isolate - we go into dark places and we’re being punished for something completely out of our control. And I’m kind of fucking done with it. Stop being nice! Because if people don’t care about treating you with empathy or respect when you need it most - confront them! Make them feel bad for once - make them feel uncomfortable. \n\nHonestly - the more women going through IVF finally throw down the towel and tell everyone who is rude to go fuck themselves is the day I’m here for. \n\nLife is life and they’re all babies.", "Sorry this happened to you. This is one of the reasons we don’t tell people 😔", "I hear you, my neighbor recently called my embryos totsicles.", "I am a test tube baby from the 90's. Also donor baby, which very few of my family knows. I knew about the IVF from a young age, and test tube was normal terminology especially when cousins etc were having trouble conceiving. As an adult I needed fertility treatments. But I think \"IVF\" differentiates from couples who only need hormone cycles or IUI. It's not the same. Also my grandma tried talking my mom out of ivf for religious reasons, but obviously loved me and my twin.", "Cool get the F off my embaby, “mom” 😠\n\nMy husband loving refers to our hypothetical child as DB for designer baby and if that’s their way  into this world then that IS Gods plan. \n\nThat’s so annoying", "I don’t find it insulting and I personally wouldn’t read into it if were said in a neutral tone.", "as a test tube baby, i call myself this.", "\"Your tone with the way you said that implies that you think babies conceived through IVF are somehow lesser than.  Are you seriously going to view a human CHILD as lesser than for something they had no control over?  Is that how you think of adopted children, too?  Or disabled children?  I am so hurt and shocked by what you just said and the tone it was said in.  Let me be very clear - ALL babies, ALL humans, are precious and deserve love and care and equality.\""], "link": "/r/IVF/comments/1arj8a9/does_it_bother_anyone_else_when_others_refer_to/"}, {"title": "Husband made burgers with conventional beef 😱", "content": "Hoping this will at least get some lols or hugs. \n\nIf you found your way to this subreddit, chances are you’ve read, live, and breathe ISWTE. And no judgment if you don’t. I rarely eat red meat these days - especially after being diagnosed with fibroids and having undergone myomectomy to remove a 9 cm fibroid. So when I do, I make sure it’s organic grass-fed grass-finished. It is not lost on me how privileged that sounds… but the infertility journey and IVF treatments are an expensive investment and a privilege in and of itself. \n\nI came home after a 10 hour day of school and work on a Sunday and my husband had very thoughtfully prepared dinner and had it ready for me when I got home. For that I feel loved and am very very grateful. I asked him if the meat was organic. He said they don’t have organic at Ralph’s. I said they have Open Nature. He said “Fine then don’t eat it.” I felt like a child being told by their parent that I can go to bed hungry if I’m not going to eat what was prepared. \n\nIn the grand scheme of things I know that eating a GMO burger is not going be the ONE THING to tip the scale against my chances. But it’s about all the energy and strategy and mental gymnastics, restrictions, money, and what I’ve put my body through to give my body the best chance. Is anyone with me on this? No plastic, organic everything, no teflon, no sugar, no caffeine, 20,000 supplements 3x/day, hormone injections, countless blood draws, acupuncture, surgeries… and you can’t go a little out if your way to find organic ground beef??? Or at least respond with more consideration??? \n\n", "num_comments": 32, "score": 0, "top_comments": ["The science does not support this and it really shouldn’t be shared with people who are struggling with infertility. To everyone else I say - follow the guidance of your doctor. Don’t listen to non-scientific based “guidance” and click bait.", "Honestly, I think you are going overboard and I don't fault your husband for his reaction.", "Some of those things I do, a lot of them I don’t.  But I get the not wanting to feel scolded by a partner. It is hard sometimes how much this falls on the egg producing partner. ", "Aaahhh I know those times where you take care of every bloody Tiny thing and then someone swoops in and says yea that’s not possible now or that’s not available now. And you just have to give in. \nYea it does happen and I feel you , I empathize with you. I’ve been there done that . There’s nothing you can do other than go into the bedroom lock the doors and scream into a pillow and come back normal. \nWe have so many calculations going on in our head and no one understands them as much as we do. \nI don’t know what that book is but this is just about cooking organic stuff ."], "link": "/r/IVF/comments/1b6hykc/husband_made_burgers_with_conventional_beef/"}, {"title": "Seeking info regarding IVF versus Adoption/Fostering", "content": "Can anyone offer insight regarding the relative costs (emotional, timewise and financial) of seeking a family through multiple methods?\n\nWe have gone through 1 failed round of IVF (0 embryos from 37 mature eggs via traditional IVF, no MFI) and are debating a 2nd with ICSI.\n\nHow do you decide to prioritize procreation that preserves your genetics over other methods of becoming parents? Do many of you start applying for adoption or train to become foster parents while going through IVF treatment?", "num_comments": 5, "score": 0, "top_comments": ["Before IVF we thought about fostering, but not necessarily with the plan to foster to adopt. That’s because for fostering, reunifying the family always comes first. We didn’t end up looking further because I felt like we probably couldn’t meet the need of foster kids because we both worked full time. All the catchup medical appts, therapy, occupational therapy if needed, meetings with schools, social workers, etc., take a ton of time. So it was something we thought about doing to give back. "], "link": "/r/IVF/comments/1b6s5su/seeking_info_regarding_ivf_versus/"}, {"title": "It's starting to feel real", "content": "Growing up, I always wanted to be a parent. I had a feeling deep down it would take extra measures to become pregnant. After trying for so many years, we begin our IVF journey tomorrow. \n\nAny suggestions, tips, advice for me and my spouse? Anything you wish someone had told you when you started the process?", "num_comments": 19, "score": 1, "top_comments": ["I wish someone would have told me to brace myself. That you can both do everything right and still not have the results you want. It's a process. And every step is a hurdle", "Good luck to you! I started meds last night for my first cycle. I’m telling myself to take it day by day maybe even hour to hour. It’s been such an emotional roller coaster and will continue to be but lean on those you can provide some support be kind to yourself. (For me that’s easier said than done sometimes) We can do this!", "I’d say talk with your spouse about couples counseling in advance. You don’t have to start until you feel you want/need it, but make sure you both are willing to do it for each other. IVF can tear a relationship apart or bond you together. My husband and I had ground rules that our relationship was our first priority and IVF came second. If either one of use felt we needed couples counseling we’d do it."], "link": "/r/IVF/comments/xlejqa/its_starting_to_feel_real/"}, {"title": "My one chance starts July 17th", "content": "My first (and very likely only) round of IVF begins July 17th. We are flying out of country for it. Lots of mixed emotions. Was anyone who had gone through this excited, yet a little scared? I have no children so I’m sure like anyone else there is some fear of becoming a parent. Any IVF or other advice?", "num_comments": 2, "score": 2, "top_comments": ["I start next week and yea… scared. Not scare of the injections. Just scared it’s not going to work. Scared of how I’ll deal with that despite my head knowing it’s a plausible outcome… my heart would be absolutely shattered. Best of luck to you. You’ll make a great parent. You’re doing so much already."], "link": "/r/IVF/comments/14jthss/my_one_chance_starts_july_17th/"}, {"title": "Fuck infertility", "content": "First let me acknowledge that I’m going to say some fucked up things here, but these are my honest feelings right now. \n\nFuck infertility. We’ve been trying for 2+ years, unexplained infertility, 4 IUIs, a pretty successful ER, and a failed FET, and now finally I have a clinical diagnosis for endometriosis. I’m on orilissa for that right now before the next FET. I’m just fucking sad right now. \n\nOn top of all this, I’m jealous. My younger brother got married and started a family without much forethought, without regard to finances, and frankly the mental state of his wife. She was already a little on the depressive side before kids, and now with 2 under 2 and barely enough money to survive, she’s making some threats that have made the family question her ability to care for their children.\n\nDon’t get me wrong, I’m praying that she utilizes the help and support being offered (medical and familial… this is all new and developing, so the jury is out on how drastic of measures will be taken). I want the best for her because it will be the best for my brother and their babies. \n\nBut damn it, I’m fucking jealous. My husband and I have our shit together, we’re begging for a baby and can’t have one and it is so painful to hear about another person being able to so easily have children yet takes them for granted, and is incapable of providing proper care. \n\nI just want to know when is my turn. I don’t expect things to be easy, but I will love that baby so fiercely, I will provide for it, nurture it, and protect it. I just want to hold my baby and I feel like that is such a distant dream for us. I’m fucking sad, I’m jealous, and I know this isn’t nice. \n\nWe’ve made it known to my parents that we’d be willing to essentially foster the kids for any time length if things got to that point. I pray for their sake that it doesn’t because babies should be with their mothers to the greatest extent possible. We just want them safe and well cared for. I think that’s more of a break in case of emergency type of plan, but if my parents deem it worth a mention to my brother then it’s probably the right thing (we’re obviously treading lightly). \n\nUghhhhhhhgggggggg FUCK INFERTILITY! Thank you for coming to my ted talk. I hope this message finds you better than me.", "num_comments": 89, "score": 160, "top_comments": ["I hate infertility. My 2 SIL, which are older than me, one with twins and other expecting. And I am here… waiting my turn. The one expecting told me “oh, we tried 2 cycles and it was so easy, we are very good at making babies, hahaha” (and she looked her husband and winked).\n\nThis is my life.", "Sorry you’re going through this. It’s so tough seeing others get there SO easily, especially when you feel like you’re more ready and capable, but then it’s damn near impossible for you. Such bullshit. I feel like we are told this lie that you can just wait to have kids. Focus on your career. Everything will be fine. So and so got pregnant at X age. But in reality it just doesn’t work like that for everyone. I have endo too, which had a major impact on my egg quality, and I never even knew that was one of the issues with endo. How is none of this talked about more?\n\nAnyway just want to commiserate and say fuck infertility. I’m sorry you feel like this right now. I hope your next transfer is the one ❤️ ", "Ur def not alone  in having these thoughts. Every single one of my fds has had one kid already and here I am  wondering what's wrong with me. I do have fds who are still single  ir they just don't want kids however my husband and I are the only married couple left who do want kids and can't seem to get there. Just this week I had to go to the family doctor to check out my throat as I be been coughing over a week now which wasn't getting better. During the checkup I was asked if I still doing fertility treatments since I only really see my fam doc once a year for physicals.  That really made me sad  and it was another reminder of how long it's been since I initially asked for referral  to the specialist", "It seems like the more disfunctional people are, the more fertile they are.\nYou see women eating loads of junk food, heavy drinkers, they have a different partner every week, some even use heavy drugs and still manage to easily get pregnant.", "My sister has two children, the first an accident. She loves her kids, but she doesn't like being a mother. I remember her saying how she disliked breastfeeding, like it made her feel like an on-demand milk bar. She misses her freedom, resents having to put her career on hold and sees only lost opportunities. Meanwhile I have a nice house, plenty of disposible income and can't have kids. It's ironic how we're jealous of each other's problems.", "Oh yes I hear you.  My brother is CFBC but my younger cousin (10y younger than me) got pregnant easily and uses my aunt as a nanny (basically 24/7).  My aunt is basically the child’s parent, and now she is pregnant with #2.  \n\nIt’s so unfair."], "link": "/r/IVF/comments/1aj1m1t/fuck_infertility/"}, {"title": "Friend issues", "content": "First: I get my fourth egg retrieval today, wish me luck! I was already told the cycle didn’t go as well as had been hoped, so I am really hoping for that elusive good luck this time. \n\nActual question and background to the question:\nIn August we terminated our PGTA supposedly euploid baby. We found out that she had full Turner’s syndrome—100% of her cells were abnormal. We were in the unlucky 2% of mistakes on the PGT. I was five months pregnant. \n\nThat same week, my best friend’s wife had their baby, and a month earlier another close friend had their first child. In September, my oldest friend had her daughter.\n\nI haven’t really been able to talk to any of these friends. These are all long, wonderful friendships—I am 40 and we met in high school and college and have always been extremely close. But I have no interest in being around them or hearing about the struggles of being a new parent. \n\nAt what point am I indulging myself by avoidance? I keep hoping we will have a good IVF experience, with a good couple of euploids, and I will feel stronger about all of this, but it’s not happening. I don’t want to throw these friendships away, but I also kind of don’t care about them at all right now. They also aren’t reaching out to me—I think two of them have called me twice since my daughter’s loss. I know they are super overwhelmed right now, so I am not mad, but I do notice it.\n\nI do spend a lot of time with other friends with kids, and my niece and nephew.\n\nHow have you all dealt with feeling distance from your loved ones?", "num_comments": 43, "score": 24, "top_comments": ["Yes, I’ve distanced myself from a long term friend after she’s had two successful pregnancies in the same time  I’ve had four losses and 5 rounds of IVF. I’m not in the mental headspace to hear about her babies. I don’t know if it’s right but or wrong, but I need to do it for my mental health.", "I think they might also be giving you distance, especially since I’m assuming they knew about your loss? Though if you do talk with them and they only talk about this new babies then I think maybe they are just asses. \n\nGive yourself all the time you need, at least that’s how I feel. I have kinda isolated my self a bit because of IVF. Not because of shame or anything, more because it is so much to handle and deal with and I don’t trust people to say the right things. Each event I evaluate how I feel and go or not go based on that. I honestly don’t care anymore and most of the time am not attending anything baby related. The people who are expecting have a lot on their mind and probably don’t even notice my absence. \n\nYou are going through an exceptionally tough time right now. Your friends unfortunately probably don’t get it. Most people don’t. I try and surround my self with people who do. I actually ran into two people I vaguely know at my IVF clinic, and have two new friends because of it! Not to mention the people on here who are also in the thick of things. The IVF people are the only ones that I don’t feel resentful towards when they have success. \n\nBe kind to yourself, give yourself time to heal, give your friends the benefit of the doubt for now, and hopefully someday in the future, when you are not in the thick of things you can reconnect with them and continue healing. It is really hard to heal though when you are still getting beat to shit. Survive first, then comes healing.", "You have to give yourself grace. And your friends have to give you grace during this difficult season of your life. \n\nHonestly, it sucks to be on different journeys and no one wants to be the source of hurt for their friends so I say to reach when you can, forgive them for being new parents and being busy or preoccupied with that, and just be there for them in whatever capacity you can be and vice versa. \n\nBut only you know how to protect yourself and your own mental health during this time too. So do what makes you feel good and spend time with people that support you, that you feel restored and energetic after. That's all the advice I have.", "I’m so sorry for your losses.\n\nDid your NIPT test and NT scan come back low risk/normal? It sounds like you found out at your 20 week scan?"], "link": "/r/IVF/comments/188by91/friend_issues/"}, {"title": "Mental Changes During or After IVF?", "content": "First time IVF-er here! I am starting my first round of egg retrievals in January and was hoping to hear about some first-hand experience from this community.\n\nI’ve recently read a number of studies and articles about how pregnancy physically changes the birth parent’s brain. The theory is that this brain change increases (sometimes dramatically) levels of anxiety which the birth parent then uses kind of like a super power to be extra attuned to their baby’s needs.\n\nWhat I’m trying to figure out right now is if anyone has experienced this from the IVF process? I can’t figure out if the trigger is related to the same hormones what we use for IVF or if it has more to do with carrying a baby to term and giving birth.\n\nFor a little extra context, I’m asking because I’m currently recovering from a brain injury and the last thing I need are premanent brain changes while I’m already struggling with finding strategies to get through day to day life (especially because my injury already dramatically increased my anxiety).", "num_comments": 3, "score": 4, "top_comments": ["Not exactly the same, but I have extensive brain injury/trauma from excision. I’ve done 2 rounds and haven’t had ill effects. My neuro-oncologist and neurologist both blessed the procedure.\n\nHappy to talk more via DM"], "link": "/r/IVF/comments/zmc0yd/mental_changes_during_or_after_ivf/"}, {"title": "After 4 egg retrievals this year, my mom politely suggested that I may be too old to have a baby. Any advice from mothers over 40? I’m 41.5", "content": "I’ve done 4 egg retrievals this year and banked 3 euploids. I don’t talk a lot about IVF with my parents, but while talking to my mom this afternoon, I mentioned that we are probably going to transfer this month. She politely said “you really need to think this through….” I asked her a few more questions, and then she said in a kind way “I’m worried that you are too old to have a baby”. She didn’t mean physically that she doesn’t think I can carry one, but she just honestly is worried that I’ve waited too long and that I’m too old… I’m 41.5. I know she wants me to be happy and she’s even given us a little money during this IVF journey, and I know she said this in a caring way, but I got to thinking “am I too old?” Am I? I do feel like there are lots of pros to being an older mother… But have I actually waited too long? Any advice or insight from first time mothers or any new mother is greatly appreciated!", "num_comments": 225, "score": 48, "top_comments": ["I love being an older mother. It took us over 10 years to finally have IVF success and I had my first at 39 and my second at 41. I have no regrets. I do way more with my kids than my younger friends did and I have no issues keeping up with my wild toddler. My youngest is currently almost 6 months.", "Hello there! I am a embryologist that creates these beautiful embryos behind the scene. American Society of Reproductive Medicine advises against having children if the cumulative age of intended parents exceeds 100 years old. However, I’ve experienced patients getting pregnant well into their late 40s and early 50s. Do what is best for YOU.", "I was 41 when I had my first. It’s not too old !!!! The baby was the best thing that happened to me . So many rewards ! My focus did shift though - my life became all about the baby where before it was all about me . Wouldn’t change a thing - feel I traveled , grew as a person and was ready to give my whole self .", "Over half my friends and family have all given birth in their 40s. My grandmother had her last child at 47. (I’m in NYC.. it’s more prevalent here since women tend to be more career focused..)\nA friend who goes to the same acupuncturist as me is 49! Is 35 weeks pregnant using her own eggs retrieved at 48!", "Nah. Age is just a number. A lot of people feel like they hit their stride in their thirties, then feel stable enough to have kids when they are 40. Sure, you'll be on the older side of the other parents in your kids class, but... so what? If anything, age can mean greater stability, maturity, and patience- critical assets for a parent.\n\n3 euploids is great! Wishing you the best of luck with your upcoming transfer.\n\n\nOh, and anecdotally, a friend of mine had her baby girl at 43 after 3 ERs to get a single euploid. They are both doing great!", "Not too old. Also 41.5 and 6 months pregnant from our first transfer after two ER early last year. When we told our parents we were pregnant both of my parents cried with joy but my FIL said “odd time to finally decide to have kids. You’re going to be 60 when they graduate”. It was the weirdest comment and still bothers me but he does seem happy for us now. I think it just surprises their generation because they all conceived so young and we mostly done with kids by 40. Moms were also mostly stay at home moms back then. Times change. Try not to let it get to you. It’s just a different mindset.", "If so then I am too! TW: LC\n\nI'm 42F and have a 9yo from my marriage which ended in 2021. I met my partner when I was 41 and he was 31. I'm about to set up a plan of care for our very first ER. I already know that if we're successful I'll be a much better mom with the right partner and more stability. :) And so will you.", "Tell your mom that if you are to be an old mom,  she will be an older grandma, then...\n\nAnd no, you are not too old.\n\n\nTW: \nIt took our 3rd ER before we had some embryos (3!!). We transferred one in September. I will be 43 when my first kiddo is born... and God willing, we will do two more transfers after this one. So if all goes well, I'll probably be 46/47 when my last kid is born... 😁", "I know people that had their babies at 43,45,46 and friends adopt their infant grandchildren at 50 and 55.  You are going to have 40 quality years with your child.  They will graduate college before you are 60 (which is the new 50). Enjoy the joy they will bring into your life.  P.S. 1/4 of the world is raised by their grandparents while their parents are busy working.  Don’t worry.", "Nooo, you’re not too old! It’s just from her perspective! There are plenty of women nowadays who have their first child beyond 40 🤗 good luck and baby dust! I wish I had 3 euploids banked 😍🫶✨", "TW: living child and pregnancy talk\n\nYour story sounds a lot like mine! I also had 4 ERs between ages 41 and 42 and banked 3 euploids (though one is not usable due to it inheriting my genetic condition). My first transfer was successful and I had my daughter at age 43. I’m 45 now with an 18 month old and I love being a mom. I think that being old makes me more patient and generally a better parent than I would’ve been 20 years ago. I sort of expected to feel like I didn’t have as much energy as I’d like, but I honestly feel fine energy-wise (and I’m not in super great shape either, I’m in the obese category at the moment). Baby girl keeps me on my toes for sure but I’m so up for it! \n\nAfter I “graduated” from my clinic at 8 weeks pregnant, I asked them “how old am I allowed to be when i come back to transfer the other embryo?” My doctor said, “technically we won’t work with you if you’re over 50, but the sooner you come back the better because risks to your health do increase with age.” So we’re now getting ready for our next transfer which, if successful, means I’d give birth at 45/46. Ideally I’d wait longer because the thought of having a toddler and a newborn terrifies me, but I do want to minimize my health risks where I can. Also, I was really lucky to have a great pregnancy and really loved being pregnant so I’m hoping it goes the same again. \n\nBest of luck to you!", "Not too old if you don’t feel too old! There will always be people with opinions on when you should have kids and none of them matters but your own. Our parents’ generation started much younger so their reference is different from ours. I’ll be nearly 45 when our first is born. Do I wish that were different? Of course. Would I trade it for being a mom at 21, like mine? Nope.\n\nAlso, super congrats for banking 3 embryos!"], "link": "/r/IVF/comments/18rozj1/after_4_egg_retrievals_this_year_my_mom_politely/"}, {"title": "Unreasonable in-laws", "content": "Long rant ahead.\n\nI had an ER last week (today was day 5 - no embryos to freeze yet, next update is tomorrow). \nThis is my second cycle. My first was a few months ago and failed (only one blast, PGT-A abnormal). \n\nAnyway, my in-laws came over to our place towards the end of my stim cycle to help. Similarly, my parents were here during my first cycle to help. \nI really do appreciate both my parents and in-laws being available to support us when needed. But, I also need some time and space to process my feelings and physically recover. \nLast night, my in-laws went to watch a movie. They were apparently upset that I didn’t greet them and ask them how the movie was and chat with them. And, in general, they feel like I’ve been “unwelcoming”. \nI felt like this was an extremely unfair statement to make. I’ve spent time with them whenever I can (and MUCH more than my husband has ever spent with my parents). \nI’m already struggling to manage work (so hard to focus!) and IVF and the physical and emotional trauma that comes with it. I was anxious all of yesterday about how our day 5 update would be, and hearing a complaint about how I didn’t exchange pleasantries and discuss a movie when I was in this mental state really made me upset. To top it off, they supposedly complained about how I don’t discuss things with them like I do with my parents, so they feel left out. \n\n I am extremely close to my parents, and have only known my in-laws for a couple years. They’re generally nice, but we come from *extremely* different social/financial/educational backgrounds, so it’s never going to be the same with them as it is with my parents. \nAlso I now feel like they still don’t understand the trauma I’m going through, and think it’s just about getting through a couple injections for some time. They don’t understand me or support me like my parents do so it’ll never be the same with them. \n\nAnyway, I’m just very sad that people who supposedly care expect me to behave as if everything is normal, when it most definitely isn’t. \nEnd rant :(", "num_comments": 10, "score": 1, "top_comments": ["This isn’t the kind of ‘help’ anyone needs. They are causing unnecessary drama at the worst possible time for you. It’s probably time for them to leave.", "I just wanted to comment because I’m in the same situation. My in laws are always asking for updates and want to be involved in every step even after I have expressed wanting to keep things private and only give updates as we feel comfortable and ready to do so. My family and friends have completely respected this. We also are very different people. It’s hard not having that close relationship with your in-laws. I always dreamed it would be different when I got married but unfortunately that’s not the case."], "link": "/r/IVF/comments/1653zhf/unreasonable_inlaws/"}, {"title": "Legal Document for Embryos", "content": "Has anyone drafted a legal document for who, if anyone, can receive their frozen embryos in the case of both yourself and your partner passing away before implantation?\n\nI am open to allowing an immediate family member having custody of the embryos in this situation, but only if it can go to certain people. My BIL/SIL have questionable parenting methods, and I would not feel comfortable with them having custody over my mom/brother/MIL. Unfortunately, the documents I need to sign with my doctor do not give an option to specify who can receive legal custody, just if they can or cannot. \n\n&#x200B;\n\nTo clarify, by questionable parenting methods I mean that they have a strong stance against Western medicine as a whole (including being anti-vax), insist that gentle parenting is effective, and overstep boundaries with their children's education. I am not one to tell someone how to parent a child, but these are things that go against my core beliefs when it comes to parenting, and I know that the other immediate family members in my life feel the same way.", "num_comments": 8, "score": 0, "top_comments": ["I had to sign forms explicitly detailing what would happen to my embryos if I passed before transfer - this was all part of the process from my clinic before I had even done an egg retrieval."], "link": "/r/IVF/comments/15h5cl1/legal_document_for_embryos/"}, {"title": "Natera PGT-M", "content": "If you have gone though Natera for your PGT-M testing recently, did Natera require you to send in your parents DNA (blood or saliva) as well in order to make the probe? At what point did they let you know if yes or no? My parents will be out of the country for the next two months and so need to figure out this out logistically. Natera does not do a great job explaining on their website whether they now always require it, or if only sometimes. \n\nFYI we are doing PGTM testing to screen for Congenital Adrenal Hyperplasia (CAH). ", "num_comments": 1, "score": 1, "top_comments": ["It takes a while for all the paperwork and things to get processed. We had to send it two separate samples for each of our parents. First, the regular “gene screen” then they sent that in for ananlysis to determine if they could even make our probe. Then they send out an entirely separate testing kit to gather their DNA to help make the probe. \nI tried to hurry things along because of summer family travel, and it did not help. They move very slow over at Natera…"], "link": "/r/IVF/comments/1bi6gxe/natera_pgtm/"}, {"title": "How do you feel about babies and children right now? ", "content": "2-3 years ago I would have told you I 100% can do motherhood, I am game. Every moment is going to be an effortful moment for me and my beautiful child. \n\nFast forward to current times… i feel… more tired. More aware that giving my best might not always be good enough. More aware of the countless ways I can worry and worry a lot in the future. I’m scared for myself and for my child even though still say I want this adventure. I know it’s work and I know it’s tiresome to have kids and I believe in the joy they bring and that they’re worth it. Even if it’s work. It’s also why I decorate for holidays and I go all out for other people’s birthdays. Because I don’t mind *effort*.\n\nBut lately… I’ve been finding myself having a lot of thoughts that I can’t tell anyone else, and that don’t align with having children. \n\nI was on the phone last night with my friend who quite literally was narrating what her 9 month old was doing and I politely fake laughed along, bc that’s the right thing to do? Listen to a friend talk about her kids? Although I didn’t call to narrate how her child is right now eating paper and listen to her talk to her child like a bystander. \n\nMy husband also caught up with a friend over the phone (speaker) and the 5 year old kept interrupting and yelling the HE wanted to talk to Uncle -. They pretty much couldn’t have a conversation. \n\nI don’t expect much help from our parents - we aren’t entitled to that, and I sometimes sit on the toilet and think… it’s nice not to have children not interrupt this time. You can’t turn kids off. \n\nI get tired clapping my hands and repeating for my 1 year old niece to put her puzzle piece in its spot. It’s exhausting staring at her like I should be in awe of her smashing food into her mouth and laughing about it. First time was cute but eh. \n\nI feel.. less confident in my desire for children. Is this a protective and reactionary mechanism my mind has thrown me into to protect me for a future without kids? I’m finding that I’m SO much more disinterested in everyone else’s child and being grateful for my PAST life, the one before we started ivf which has been its own episode of dread and hope. It’s all… been interesting. I really hope I don’t turn into a regretful parent. \n", "num_comments": 69, "score": 97, "top_comments": ["When you are a parent, it is still normal to be disinterested in and annoyed/bored by other people’s children.", "Kids are exhausting and take huge amounts of effort and time. It’s definitely not all fulfilling moments. I had twins and there are long stretches I don’t even remember because of the sleep deprivation. \n\nBut it’s an investment. Now they are 10 and are the most awesome people ever. I have someone to celebrate Christmas with, someone to say good morning to and ask how they slept. My parents are getting older and all my family is dwindling, but I know I will always have these awesome people who share my memories and experiences. I can’t say how it will be for you, but they have been the best thing we did over the last 10 years, even with all the struggle. We like them so much we are making more! ", "I think these thoughts are VERY normal. I did f&ck all last Sunday but read books and thought to myself (and spoke with husband & therapist), how am I going to manage doing nothing for even a day when we have children!? I’m going to pawn them off to anyone who would take them (ofc close fam & friends… not strangers) whenever I can for my own SANITY and I think that is A-OKAY. It does take a village to raise a child. I don’t expect help from parents but I’m definitely taking advantage.\n\nThat said, I do love children so so much. Can’t wait to have my own. What a contradiction.", "Honestly, you are a lot more prepared to be a parent if you can see that it’s not always magical and a lot of relentless work. \n\nBut, it’s also ok if this realization makes you decide children aren’t for you. That’s totally ok! Just be kind to yourself either way.", "I never ever have liked anyone else's children and still frequently feel the way you describe when I have to interact with coworkers' and friends' kids. Even my own nephew and niece -- I love them, but it's like 'ok that's enough.'\n\nHowever. I am lucky enough to have 1 child so far (doing treatments for a possible 2nd) and I am truly fascinated and in awe with my toddler. He's EXHAUSTING at times. He's at a phase right now where I tell him to do something or NOT do something and he gets this mischievious glint in his eye and does the exact opposite. It's very tiresome and very annoying. But I am truly fascinated and so proud of the little steps in his growth. He learns a new word or an incremental skill, he builds a tall tower, or makes a big jump., he tries a new food, or tells his first joke ever... I'm clapping and praising and I'm totally in love with it all.\n\nNot everyone is this way with their kids. There are plenty of parents I know that still don't really enjoy playing even with their own kids. Everyone is different. But I do think there is truth to the saying that it's different when it's your own kids. \n\nYeah, and the toddler in the bathroom thing is super annoying. There's just no helping that. I still have some alone time in the toilet but not all the times, and it's just one of those things...", "I was in the same spot when I was thinking I don’t think I want kids any longer..after many years trying, failing.. I just got tired and all those kids around started to annoy me. I thought this is it, no more desire to be a mom. But one day I got pregnant and I gave birth and that day I was crying from happiness.. because all that love just comes out from the moment you see YOUR baby.. and after a year of having him I can tell I didn’t know that I can love sooo much! He can be annoying cranky and loud but you love him no matter what. ❤️", "I'm really glad you posted this! I recognise so much of what you're writing. At the moment my head is quite a mess so I don't know the right words.\n\nIt's like.. At one hand I'd love to start a family. Making memories, raising a child. I think it's a lot of fun. Exploring the world, enjoying the small things. Laugh about your kid. See him/her growing up, all the steps. Being three together. It's also a new phase in life I really want to experience, I'm ready for that. \n\nAt the other hand I have a lot of fears and negative thoughts. What if I don't \"like\" my child. What if I'm to tired to do things. What if he/she gets ill, what if I hate the endless stream of changing diapers, giving food, doing infinite piles of laundry etc... What if I don't like it, will get unhappy or just can't. I'm also not really into kids from others. Today a friend of mine (who knows we can't conceive naturally and know about my surgeries) aksed me while we were sitting next to her newborn: so what do you think of a little baby? How do you all see it? And I was like \"at this moment I'm not up to it\". It's also because I'm still recovering from my last tube removal. Excuse my blunt words. (English is not my first language but at the same time it's also how I sometimes feel it and I want to be honest about my feelings and thoughts)\n\nAnd before, we could just let nature decide. Have faith in nature and see what happens. Now I need IVF it's like the decision, which was already super hard for us, is even extra hard. Now a entire trajectory of treatments will be necessary to only get an embryo growing in my uterus. \n\nExcuse my honest comment. It was the post I needed.. I find it so hard to find people to talk about this topic. No one understands. If you want to chat or so, I'm here!", "TW: 2 successes\n\nMuch like others have said, I didn’t much care for other people’s children (unless they were my closest friends’ kids). I’ve now had two kids, and can confidently say that you dig in and find the energy. It’s very different when they’re your own. The investment you make in your children changes with age too. My toddler is much more independent than say my newborn, which gives me time back for myself. Once you get a little morsel of yourself back, you run with it, and it gets better."], "link": "/r/IVF/comments/1benbk8/how_do_you_feel_about_babies_and_children_right/"}, {"title": "PGT-M question", "content": "My best friend has DOR and unexplained infertility. Her husband’s parent just died of a disease that’s potentially heritable but could not be. He wants to do testing to see if he has the gene for it. They had their pre-Ivf meeting with their IVF clinic today, and the clinic said that a) the results from his testing will take 2-6 months to get back and b) they wont start Ivf until they have those results and know if they need to do PGT-M.\n\nMy question: can’t the clinic just biopsy any embryos they get and freeze the biopsies until they know if they need PGT-M/until the probe is ready? Why do they have to wait? If that’s valid from the clinic, I don’t want to encourage her to push, but if there’s a viable way to start now while they wait, I want her to know she can advocate for that option. Would appreciate any advice to share with her! Thanks!", "num_comments": 10, "score": 3, "top_comments": ["They won’t because of the chance they can’t complete your probe. The prove takes about 6 weeks and they won’t begin the IVF cycle process until then."], "link": "/r/IVF/comments/17fu5n9/pgtm_question/"}, {"title": "Have you used Orchid whole genome screening for embryos?", "content": "I just found out about https://www.orchidhealth.com/ which does whole genome screening for embryos. Has anyone tried it? What data do you get in the report? Would you recommend it?\n\nFrom their announcement post (https://guides.orchidhealth.com/post/meet-orchid-the-first-whole-genome-embryo-reports): \n\n> Choosing to have a baby is life changing. Despite advancements in genetics and reproductive technology, there is still a huge amount left to chance. People worry a disease they suffer from, or a family member suffers from, will harm their future child’s wellbeing. Even when parents are healthy and no family history exists, there is a risk of a new harmful genetic typo impacting a child’s health and development. These fears even lead some couples to decide not to have children at all. With whole genome embryo reports, parents can screen more comprehensively for genetic risks that previously would go undetected. Orchid’s mission is to extend the healthspan of the next generation. Our hope is that these reports ease some of the worries that future parents have, and give them a bit more confidence and control as they grow their families.", "num_comments": 8, "score": 5, "top_comments": ["Wow, this is mind blowing. \n\nWe lost our first daughter (the result of our second ivf cycle) due to a genetic disorder that was so rare it took whole genome sequencing after birth to find it (PGT-A,  NIPT, and standard amino tests did not pick it up and were all normal)\n\nSomething like this would have picked it up. \n\nI have so many questions, and it would definitely be tough to tell a pathogenic variant from a benign one, but it sounds like it holds so much potential."], "link": "/r/IVF/comments/18bnuns/have_you_used_orchid_whole_genome_screening_for/"}, {"title": "Reflection", "content": "I don’t know if this question has been asked yet (probably). Curious to know if and how going through infertility/IVF has changed your outlook on pregnancy/parenting and life in general. How have you changed and what things do you do differently now after going through infertility?", "num_comments": 84, "score": 26, "top_comments": ["It's making me second guess everything. Especially if I really want kids now. Most of my friends and family have children, and all I hear are complaints and stress in their lives. Very rarely is it positive. When I'm not doing any treatments (like right now waiting on my PGT results), I really sink into enjoying my time with my husband. We have disposable income, we go have steak and wine when we want to, we do fun things on the weekend or even week nights, we take spontaneous trips around the world. It's a dream. And then I get realed into reality because, ultimately, a family is what we want. So I get really depressed about the situation and wonder (sometimes) if this is truly what I want. I've wanted it all my life. I didn't know it'll be this hard.", "Infertility has made me realise that life is not about how good you are at something, how deserving, how much you want it. You can do all the right things and still lose. It’s made me realise that if I’m going through that, the process is the same in other areas of life and that others are also struggling. Whether it be with money, love, jobs. It’s made me more empathetic and compassionate to the struggles that others are facing. If I, through no fault of my own have been dealt the absolute shit show of a card I’ve been dealt in terms of infertility, others are holding some pretty hard cards as well.", "Bitter, resentful, sardonic", "I'm really budget minded for my income level, that's half of the reason my husband and I are able to afford IVF in the first place. I used to imagine how I'd find the best deals and not buy too many baby clothes that they'd \"just outgrow anyways.\" Now I'm like, fuck it, if we have a baby, I'm going all out.\n\nSame with stress... I read Emily Oster and Bringing Up Bebe. I used to imagine myself as a laid back mom who wouldn't let it control my life. But after buying air purifiers to cut down on toxins, reducing BPA, all sorts of stuff to MAYBE improve my egg quality... idk I think I'm going to be kind of crunchy. Seems really silly to attempt all these lifestyle changes for myself and say \"here suck on this Fisher Price.\" Like I might ease up when I get overtired but at least I'm an ideal parent in my mind.", "My outlook on pregnancy/parenting is that too many people take it for granted. That they can just so easily plan when/if to have their next child. It’s so unfair. It also is probably mostly my bitter heart talking, but I feel like they don’t really appreciate that they were even ABLE to have a child and just take the whole thing for granted ya know? As miserable as I’ve been during this first pregnancy, I’m just also in awe that I’m even pregnant. Like beyond thankful that I’m even getting to have this experience that I at one point thought I would never have. \nOn life in general I’ve had it very much thrown in my face that you can’t plan for shit.. so I’ve been trying to live more in the here and now and less for the future, but it’s so hard.", "Something I think a lot more about now is privilege. I am very fortunate to have a job with insurance that covers IVF. If we didn't have the insurance we could still probably afford to do a couple of cycles. It just seems so unfair that other people don't have the same opportunities because of the cost.", "For me, I was and am pro-choice (sorry not meaning to be political) but what I never expected was to be attached to my frozen blastocysts. They're somehow mentally already my kiddos.", "I now have an appreciation for autonomy over my body, which prior to IVF, I had really taken for granted because I have never had to advocate this hard. Ever."], "link": "/r/IVF/comments/13qkmmy/reflection/"}, {"title": "Cystic fibrosis carrier embryo genetic screening", "content": "Hi! I just started my first embryo freezing cycle today and we need to decide what kind of genetic screening to do. We are definitely doing PGT-A, but I’m not sure about PGT-M.  My husband is a cystic fibrosis carrier, but I am not.  However, I’ve read about how CF carriers can sometimes have symptoms. He has asthma but we have no idea if it’s related to him being a CF carrier.\n\nHas anyone done screening to identify CF carrier embryos when only one parent is a carrier?  Would you recommend it?  I have no idea what the cost would be yet, but we might be willing to pay for peace of mind.", "num_comments": 6, "score": 1, "top_comments": ["Chiming in with personal experience, I am a carrier of the common CF variant and was unaware until carrier testing this year. My lab report said carriers can have increased risk for chronic pancreatitis but the risk is low, like 1/100.\n\nThe genetic counselor and physician at my clinic both said it is not recommended to screen for carrier embryos in this case. We are doing PGT-M for a different condition."], "link": "/r/IVF/comments/150fujj/cystic_fibrosis_carrier_embryo_genetic_screening/"}, {"title": "We're devastated. There is still hope but this is such a defeat.", "content": "My wife (42F) and I (36M) are trying IVF. She was so wise and forward-thinking to have 25 eggs frozen at age 35. She even went on a popular tv talk show to discuss her decision to freeze her eggs because it was an unpopular decision at the time.\n\nWe had genetic pre-screening tests on both parents, resulting with no potential for genetic disorder. We thawed and fertilized 12 of those eggs. 5 made it to blastocyst, all good quality. Less than we hoped, but acceptable. Then we opted for PGA testing.\n\nPGA results came back an hour ago with 1 viable embryo. One. Fucking one. Out of 12 eggs we have one. We are absolutely devasted and I don't know who to talk to. I have a call with the fertility doctor but that's not going to change the results or facts.\n\nYes, we have 13 more eggs frozen at maternal age 35 that we can try. Yes, one is better than none. But this start of our journey is absolutely crushing. We know the likelihood of carrying to live birth is low and our hope has just crumbled today.\n\nI'm sorry guys. I know we are in a better position than many people. We're both just hurting from these results. Any thoughts or inspiration would be so wonderfully appreciated. Thank you all.", "num_comments": 178, "score": 89, "top_comments": ["I froze 20 eggs at 38 and we got 3 Euploids. We thawed all 20 at once. It’s possible your second batch has a few more! And btw - my first transfer stuck at 41, and I’m 10 weeks pregnant with a little boy :)", "I understand your disappointment, but the two of you are so much further ahead than most of us despite your wife’s age thanks to her forethought. \n\nIVF is a marathon, not a sprint, and can be one disappointment after another.  This community has proven to be a wonderful resource for information and a safe place to vent.  I hope you are able to find comfort and perspective here on your journey. \n\nIt’s wonderful that you still have additional frozen eggs to work with, and wish you the best of outcomes with them!", "I'm honestly impressed that you got 5 blasts from 12 frozen eggs. That's an insanely good result. Often, eggs don't thaw well. Some might be immature. Then you have the typical attrition rates: not all fertilize, some arrest by day 3, more arrest by day 5 or 6. 5/12 is almost a 50% blast rate! The 1/5 euploid is another concern, and finding out if the clinic thinks it's a sperm issue will be worthwhile. You can't change the egg quality, but you can try to improve the sperm. I really hope those last 13 eggs yield even better results!", "I had 12 eggs frozen from age 34, and 5 from 40 and those combined got me 2 PGT tested. The first one is 23 weeks along.  Those numbers are pretty in line and having 1 is a good spot to be in and likely you’ll get another if you got one the first time. I know it sucks the drop off. But it’s a 65% chance of a live birth with one tested embryo.", "My husband and I were in a very similar situation except I wasn’t smart and had eggs frozen in advance. I had 4 eggs that made it to a day 5 blast and after PGA testing I only had two very low grade normal eggs. \n\nI was devastated. Also because none of the eggs were female (I wanted one boy and one girl ultimately). \n\nMy first transfer was a fail. I was very pessimistic about my second transfer and just had reality set in that I had to do another round…\n\nAnd then I got pregnant. And 7 weeks ago I gave birth to my son! Not all stories will be this way and thankfully your wife froze her eggs. If I wanted to go for the girl, I would need to do another round. I don’t know if I have it in me though. \n\nAlso I regret having gender disappointment now. I am in love with my son.", "One good one out of 5 blasts is 20% which is actually the average for women 40-42 yrs old- my doctor said 20-25% of embryos (not 20-25% of eggs) are chromosomally normal at 40-42.", "I know it’s so disheartening and frustrating but these numbers were similar to mine. The attrition rate is a real thing. All it takes is one!! I would say though that I’d recommend doing absolutely all the scans, endometrial biopsies, etc etc before transfer to rule out anything that could keep it from\nbeing successful!", "This journey is so hard no matter what position you are in. There is always someone better off and someone worse off and neither negate your feelings. Your feelings are valid and you are allowed to feel whichever way you feel. \nWhat I can remind you is that no level of worry can change the outcome. It is already written. I would encourage you to try and avoid feeling tomorrow’s “possible” trauma today. Your 1 viable PGA tested embryo could very well be the baby you long for, in which case…everything went as it should. \nHere is a little story.;\nAt 36 my husband and I started IVF after several IUI’s and 12 years of “trying”. I have PCOS, his sperm have low motility. We opted for ICSI. We got 11 eggs at retrieval, mostly because the drugs they gave me at retrieval didn’t do a thing and I could only go through with one ovary because the pain was so horrid. Out of the 11, 7 fertilized and only 2 of those survived to day 5 blast. I was devastated that I wasn’t strong enough to get all the eggs possible. We could have had so many more chances. We did not PGA test. \nOne of the two day 5 blasts was fresh transferred on day 5 and that is my 5 year old daughter sitting beside me now.\nFast forward to 2020. We were ready for baby #2. In January 2020 we transferred the other embryo that had been on ice since 2017. Unfortunately it did not work. \nThen the pandemic hit. We were not able to schedule another IVF round until July 2020. My father had a heart attack and died June 17, 2020 (one day after my daughter 2nd bday). He wanted us to have another baby so bad though, so i garnered strength from that, and i held it together and did the IVF round in July even though my state of grief was immeasurable. \nWe got 22 eggs and 15 of them fertilized and 11 made it to 5 day blast. HOW AMAZING!!! We were over the moon. We did not PGA test again.  \nThe fresh transfer in July 2020 - failed. \nFrozen transfer in Sept 2020 - failed. \nFrozen transfer January 2021 - failed. \nFrozen transfer March 2021 - failed. \nTook some time off. \nFrozen transfer September 2021 - failed. \nHow did we have so many embryos and have back to back failures. No sign of pregnancy at all. I couldn’t even find any stories like mine when i searched online. We were devastated and I was so tired. We were defeated and ready to give up even though we had so many embryos left. I just physically couldn’t do it anymore. However, we decided to do one more transfer and make it our last shot. My husband didn’t even come with me for the transfer and I ended up sick with a cold right during the week of the transfer. I pretended I didn’t have it so that I didn’t have a non refundable cancelled round. We transferred in January 2022 and it worked. We had our son Sept 25, 2022.\n\nIt just doesn’t matter how many embryos you have, it truly only takes one. If we had PGA tested ours, we may have only ended up with one or 2 out today the 11 that made it to day 5, but we probably would have saved ourselves some time and heartache with not having to go through so many before one worked. \n\nGod is still very much in charge in my opinion. I think it will happen for you and when it does, you will wonder what you ever worried about because everything worked out so perfectly as it should.  \n\nI hope this helps.  \n\nGod bless you and good luck ❤️", "Well this is to be expected, unfortunately after 35 the egg quality goes down, you might still get 2 or more euploids! And 3 is usually enough for one live birth. Don’t give up too soon. Did you test your sperm? It can also play a role", "Our first cycle (I was 38 female) we had 10 fertilised resulting in 4 blastocysts. All came back genetically unsuitable. We were devasted. Second cycle we had only 6 fertilised, 2 made it to blastocyst and only 1 was genetically ok. \n\nHe is now a very healthy and happy 1 year old. \n\nI know it’s shitty now and you hate to hear  “it only takes one” but sometimes it really does. Have hope and I pray that your ‘one’ is your miracle baby. 🩵🩷", "Stay positive! I started off with 16 eggs (frozen at age 38), 5 blasts, and only 1 euploid. Currently 30 weeks pregnant with that 1 euploid. Plus you still have more eggs in the bank.", "To me, 1 euploid off 12 eggs isn’t that bad? Nothing messes with your head like IVF, my first cycle I got zero eupliods off 14 eggs (30 years old). Next cycle I got one off of 12 eggs (32 years old)- that one eupliod is now my two year old. \n\nI was beyond devastated after my first round because it really hit me how much there are no guarantees with IVF, and how you must expect the unexpected. It really hit me how wildly unfair life can be.  So sorry you’re going through this.\n\nHopefully you get at least another eupliod from the next batch of eggs. I second what everybody says about asking about mosaics - I made 4 of them between my two cycles and all are suitable for transfer. \n\nTake care in the meantime 💕", "I can totally relate to your disappointment. I had 16 eggs retrieved. And only 2 fertilized! I was devastated when I heard only 2 fertilized. I was lucky they both made it to day 5. But after testing only 1 came back chromosomally normal. So I also only have 1 egg. But instead of being upset this time I was actually happy. I have 1 egg when I could've ended up with none. I'm now getting ready to transfer my only egg.\n\nI wish you the best of luck. Try to be positive.", "IVF is the fucking worst. it’s OK to feel however you need to feel. But I wonder if your expectations were properly set by your reproductive endocrinologist. \n\nMine told us to count on 10 eggs per child. She said that we would need one to two embryos per child. In my case, I did not have a history of infertility and had previously gotten pregnant and carried a child to term, but we were doing PGTM for a genetic disease that is autosomal dominant, which means that we lost half of the embryos to that disease and then did PGTA after that. \n\nI did three retrievals for a total of 29 eggs at age 36. From those, we had 5 embryos that did not carry the genetic disease we were testing for. This was an outstanding result. Keep in mind that when you do PGTA, those embryos tend to have a pretty high success rate. In my case, I did an anti-inflammatory, whole food diet and took the supplements listed in It Starts with the Egg. I also did acupuncture, cut out coffee, and refrained from exercise besides walking with frequent rests per my doctor’s recommendation. \n\nWe transferred two euploid embryos (this was in Taiwan where things are way looser). I also did a hysteroscopy prior to my transfer and an ERA (maybe the ERA was not necessary, but it was nice to do a trial run). Both of my embryos stuck, and we have boy/girl twins who just turned one last week. \n\nIf you haven’t already, you might consider reading It Starts with the Egg and looking at what you can also do before giving a second sample. I remember there was a slight concern with my husband’s sperm quality, so he took zinc (per the RE’s recommendation). He did not drink any alcohol or consume weed for a few months before giving his sample and did the same diet as me.", "My one embryo from ER3 at 36 is currently sleeping. \n\nI’d do everything you can do to make sure your sperm is as healthy as possible for the next batch. And I’m not talking your count. Get sleep. Drink enough water. No alcohol, drugs or smoking for 30-90 days before. Take coQ10, vitamin C and zinc.\n\nAlso. Pray. This sucks. 25 eggs at 35 is not a slam dunk. I wish I’d frozen my eggs at 23 when I wanted to and everyone said I was crazy."], "link": "/r/IVF/comments/1afpg4r/were_devastated_there_is_still_hope_but_this_is/"}, {"title": "Harsh response…", "content": "As pretext, my mother has always been very vocal about wishing she’d never had me and my siblings. She ended up a single parent when my dad cheated and had a rough time of it so I get her perspective, but it’s never nice to know your parent resents you and considers you a burden. \n\nOver the past year myself (33F) and my wife (36F) have done a few unsuccessful IUI’s and I’m currently going through IVF, and I thought it might be the time to tell her our plans. \n\nSo this weekend I told my mother we are going through IVF, and I was bluntly told that having children is a 20 year sentence and I’m stupid for wanting to have a child. She implied I’d end up doing it all on my own, and also demanded to know who would be carrying the child….\n\nNot unexpected tbh but it still hurt more than I thought it would… \n\nHas anyone else been in a similar situation with unsupportive parents?", "num_comments": 14, "score": 13, "top_comments": ["I’m not understanding why this person is in your life. She sounds toxic and awful", "There is a saying, believe someone when they show you who they are. I'm sorry this isn't the family relationships that you wanted, but it is what you have. Now you can accept what you are dealing with and ensure that no child of yours is involved with your mother or any of her enablers. I'm sorry. \n\nPS I've been estranged from my mother for about 10 years now and my Dad for more than 5 years for continuing to enable her. She would tell me many similar things, wish I was never born, wished me dead. Therapy helped me let go of them, and to prepare for the family I wanted to have for myself.", "I told my mom I was going trough IVF during my first cycle, I told her that my doctor informed me that I was having a MC. And she just told me god his has ways and probably a different one for me, like I’m not infertile and it’s not imposible for me to conviene without medical assistance. People just don’t know how to react to IVF and it’s better not sharing with them"], "link": "/r/IVF/comments/qfe7d0/harsh_response/"}, {"title": "FET this morning!", "content": "Had my second FET this morning and really hoping this one sticks! Got my acupuncture, did my fertility yoga, meditated, and wore my penguin fuzzy socks this morning. FET went smoothly and McDonald’s fries afterwards were delicious. Watched Meet The Parents afterwards for some good laughs. Now the hard part begins… waiting. Please send us and our 3AB girl all the sticky vibes! 💕", "num_comments": 25, "score": 69, "top_comments": ["Best of luck to you and sending you sticky vibes!!!! Be happy, stay calm, stay off your feet tomorrow and pamper yourself!!!! The waiting is the worst part, you got this!!", "Had mine this morning too!!! Currently “couching it” and watching movies.   \nI’m already cramping a bit, nurse said that was normal and suggested drinking LOTS of water.  \n\nAny other suggestions for food besides water and McDonald’s fries?!", "Best of luck and all the sticky sticky vibes! Your transfer day sounds perfect. :)"], "link": "/r/IVF/comments/1av4eum/fet_this_morning/"}, {"title": "When people ask if your pregnancy is IVF or natural…", "content": "What do you think when people ask if your pregnancy was IVF or natural? \n\nI understand natural curiosity, we’re all curious. But I feel that question is inappropriate and absolutely doesn’t matter. TW: success\n\nI got my second beta and it looks great. This is my second FET, first was also successful and we told family and some friends about IVF. \nThis time we aren’t telling my in-laws until I’m further along and I just know they’re going to ask and it’s going to bug me. \n\nAnybody else?\n\nEDIT TO ADD: Just want to say, I AM open about this, I’ve shared with friends and gotten terrible reactions (“oh that’s so weird I’m glad we aren’t doing that”)so I tend to keep it more to myself after that. \nI’m not ashamed, I am so so grateful for ART-it gave me my family which is all I’ve ever wanted in life! I’ve had friends of friends want to chat with me about the process/my experience and I am elated to help! \nAlso, my MIL asked if my parents helped pay for it…the first time. So her questions are invasive and rude. My parents are extremely generous (paid for our entire wedding) and I think the woman is just jealous and inappropriate. She’s also the one who said “God has a plan” when we were trying and unsuccessful. This wasn’t helpful to me personally.", "num_comments": 69, "score": 27, "top_comments": ["I had a friend tell me if she couldn’t get pregnant she would never “do something unnatural like IVF” and “if it wasn’t meant to happen I’m not gonna force it”. Alright sis are you just gonna lay down and die if you get cancer? 🤷🏼‍♀️", "I don’t know why anyone would ever ask this question.", "I’m not offended or irked by that.  So I would just say IVF.  And then delve into how crazy and unpredictable the process is", "Maybe instead of allowing them to ask, tell them. If you’re planning to tell them you’re pregnant, you could start the conversation by saying that you transferred another embryo and it was successful and you’re pregnant! Maybe it will feel better being in charge of the story line more? Won’t allow them the freedom of asking.", "Who asks this question?? Although, lately with people I’ve encountered, I’m not surprised by much 🙄🙄", "We have been asked just once, and I kinda did find it annoying, just felt it wasn't really any of their business.  But I do agree that this needs to be more out there in the open, as it then makes it easier for more people to talk about it freely.\n\nI also think the person who asked us asked because we are in our 40s, and I also think she asked because she is interested in having another child with her new partner (and they are also in their early 40s), but I still found it a little intrusive to ask.", "No one has ever asked me that. However when I get the \"well someone's been busy\" and \"we know what you've been up to\" comments (typically from the same people that have spent the last 5 years asking when my husband and I are going to have kids), I have occasionally snapped and responded with, \"yes, years of doctors appointments, hundreds and hundreds of injections, a transfer that went wrong, and plenty of heartbreak to get here. But I'm sure you knew all about that, right?\"", "If it ends up working for me I'll be very happy to tell anyone who asks. I'll be 43+ so no point pretending I didn't require assistance.", "I think if they know about the first successful FET it's almost natural to ask and probably isn't meant to be rude. I wouldn't think anything untoward about it personally.", "I was super open about my IVF, which I did for 5 years before having my daughter. I shared anything people wanted to know. I don’t believe there should be any sort of stigma and so I was a totally open book and still am. I can’t wait to share with my daughter, when she’s older (18m now), how hard we worked for her and how special she is 💕", "I’m an open book. If people even know slightly about me, they know this is IVF because there is definitely no baby Jesus. Tubes removed over 6 years ago. \n\nNow if they ask, I outright tell them. Too many times we are silenced and woman are told to keep it to themselves. Hard pass. We also announced our pregnancy at 8 weeks. People thought we were insane. I didn’t care. Not their journey."], "link": "/r/IVF/comments/1546tue/when_people_ask_if_your_pregnancy_is_ivf_or/"}, {"title": "Experiences with surrogacy?", "content": "My third FET just failed and it's likely an ectopic. I feel just broken right now. I had asked my RE about surrogacy in the past because I've always had a gut feeling that my body just isn't made for this and she was not only dismissive, but highly critical. Fast forward to this past week and she's made an introduction to a surrogacy agency and we have an initial consult next week. It’s sad knowing that she's also lost faith in my body and my fears are confirmed but at least I can move forward with alternatives now.\n\nTo try and look forward with hope, I would love to hear from both parents that went this route and also surrogates about anything I should know about the gestational carrier process before getting into it but also the emotional side of things...\n\nParents, what was it like to give up so much control? I'm totally Type A so already thinking of ways my head will be spinning despite being so grateful should this work out. Did you have any feelings along the surrogacy path that surprised you? Any wisdom would be greatly appreciated. \n\nSurrogates, what made you decide to start carrying peoples' babies?? What is it like to give up something that you've cared for for so many months? I look at it as a purely magical gift where I'm coming from so please tell me more!\n\nAlso, hey! If you're a surrogate in Canada or the US let me know. \\[Please let me know if this breaks any community rules and I will take this part of my post out immediately!\\]\n\nThanks so much in advance <3", "num_comments": 47, "score": 18, "top_comments": ["I'm using a surrogate, she's 20 weeks. I am very in control but actually feel like so much stress has been taken off my shoulders. We met on a FB group for surrogacy and have so much on common. I really feel like the baby is in the best place. She and her family love the baby too. Her son's pray for the baby and come to appointments. After 14 losses and a very complicated pregnancy (son born weighing 560 grams) I am just so relieved to not have the anxiety and fear that would come with me carrying.", "Can’t speak to experiences yet but wanted to share I’m at a similar stage/threshold of making the decision to proceed with surrogacy. I had 3 PGT embryo transfers of day 5 4AAs. First failed, other two took and miscarried at 6.5-7 weeks with subchorionic hematomas. I interviewed a surrogacy agency after the second loss, I felt so hopeless about my own body. I actually really liked them and felt good about it. I also posted to surrogacy FB match groups but nothing fully materialized. So I sort of hit pause as I felt the need to dig deeper into my own body. \n\nThen I started down the reproductive immunology path and truly feel like we zeroed in on the root problem. Started meds to prepare for a transfer the following month and ended up conceiving naturally. We made it past my point of previous failures on very high dose meds then sure enough, a massive subchorionic hematoma developed. They’ve given me a 50-50 chance at loss and told me to consider a carrier. I go tomorrow to see if baby has survived the battle happening in my uterus. \n\nEither way, my body has shown me it doesn’t want to be doing this even with fairly significant interventions. I think it’s time I start listening 😞 anyways, wishing you the very best as you start down this path. I hope we both get our babies ❤️"], "link": "/r/IVF/comments/1873kio/experiences_with_surrogacy/"}, {"title": "IVF, \"custody\" battles, and separation. Those who have had relationship issues - how did you handle IVF decisions?", "content": "This post might be better suited for the single parent subs, but since we're all IVF warriors, I thought I'd throw it out here. To those who have had relationship issues during the IVF process, and those who ended up separating or divorcing, how did you handle custody and all the decisions during IVF?\n\nWe're in our late 30s/early 40s, and have been together 2 years. This relationship is not working out and I don't see a future. HOWEVER, we have 3 normal embryos and I'm about to start the transfer prep. We've discussed various arrangements for shared custody, and embryo \"donation\" to me - I really want to give these embryos a go, he is ambivalent. So far, we're treating them like these will be my kids even though we haven't decided anything legally. \n\n\nAs expected, my friends who are married with children think this is the worst idea ever. They unanimously say trying to coparent with a person I don't get along with will be horrific, there's too many things we'll argue about that I can't imagine before I become a parent, I don't want to tied to him for the rest of my life, why share a child, just get a clean break, etc. They vote for using donor sperm and letting these embryos go. They think using a donor and being a single mom is an amazing decision (I think they are secretly envious about not having to argue with their husbands on how they raise their children). \n\n\nI'm nearly 40. I want these embryos. Keeping these embryos seems not that different than an anonymous donor. At least there's the *possibility* of help. He has a great family and he's a great parent. We're just not suited for each other romantically. Is this a terrible decision? To those who have gone through this, and those with children, am I missing something?", "num_comments": 18, "score": 16, "top_comments": ["When you began the process, did you sign any legal paperwork regarding this situation? I would check that first. My clinic had us sign legal documents outlining what would happen in the event of divorce or death (regarding who has custody of the embryos, whether they are preserved or destroyed etc.)", "I think it's far too easy for your friends to say that when they've not been through the shit show that is IVF. I can't imagine the heartbreak you're going through. \nHaving embryos just makes it feel like you're so close and to potentially lose them would break me.\n\nI think there's 3 ways this could play out:\n\n1. You start the IVF process all over again with donor sperm. This would mean you would be free to parent how you like. However, and this is a big however, can you financially, physically and emotionally cope with that? Furthermore, what if it doesn't work? would you then want to go back and use those embryos?\n\n2. You use the embryos and figure it out as you go along, knowing that he could change his mind at any point. In this scenario you'd have to speak to a lawyer and hash out the details and discuss potential outcomes. For example, can he sign his rights away to the embryos, but later decide he wants to be an involved parent? Or does he not want to sign anything away and see how he feels?\nYou have to go into it knowing that you would be happy to coparent with this man.\n\n3. He actually stops you from using the embryos. Which given that he hasn't signed anything, I think he could do. And to be honest he would be entitled to if he just couldn't gel with the idea of using them now that the relationship has ended. \n\nReally this boils down to an honest conversation with yourself and with him. Would you be able to start all over again, knowing what you went through to get those 3. Will he let you use them? Has he decided on his involvement going forward? And above all would he make a good father and a good co parent?\n\nI can see how it would be attractive to cut cords and start again but equally my mind would always go back to those 3 embryos, and what you put in to get them.", "I'm not in this situation at all but I can empathize! IVF is tough and the fact you have 3 normal embryos is awesome! It is very alluring just to use the ones you already have (It would honestly be so hard for me not to choose this option if I were in your shoes) BUT the smarter choice would be donor sperm so that you can parent your way without the lifelong drama. Do you have insurance coverage? How difficult would a second retrieval be for you? Wishing you the best of luck, I'm sure you'll make the right decision for your family."], "link": "/r/IVF/comments/n4vgi7/ivf_custody_battles_and_separation_those_who_have/"}, {"title": "Advice- repeated implantation failure", "content": "I’ve had 3 ER 7 implantation failure and one miscarriage. They’ve done immunological tests, EMMA/ERA/ALICE all normal except low microbiome so they added vaginal probiotic and I changed my diet. What I haven’t yet done is quit my job which my parents urge me to try since my mom and sister were on strict bed rest during their entire pregnancies. While my doctor says do same routine my parents advise me that I haven’t done what maybe my body needs which following our history is to stay in bed. (My mom had IUI to get pregnant with my sister 41 years ago and my sister did not require assistance to get pregnant but was told to rest as it was high risk pregnancy.) Apart from quitting work (which my husband says he’s ok with), I was thinking of doing PGT testing (prior clinic did not do it new clinic wanted to try diff protocol first) and also just doing modified natural (meaning just a trigger) since that’s how I got pregnant before and doing back to back transfers? \n\nAny advice appreciated. Those who became successful after multiple implantation failures with untested embryos what did you do next?", "num_comments": 46, "score": 8, "top_comments": ["There is no way I'd quit my job before I did PGT-A testing. You could be transferring abnormal embryos. Wishing you all the best", "No need to quit job. Unless you are not happy there.\n\nYou will need insurance ….pgt test your embryos … all will work out", "Recurrent implantation failure is hell on earth. I’ve PGT-A tested all of my embryos - I could not fathom going through what you’ve gone through - I’m so sorry. I’ve only had 3 failures and it’s wrecked me. I’ve gained 25lbs, basically post partem weight with no baby to show for it. I’m going to see an RIF specialist in October - hoping to learn more. As someone with family members who just love to give advice because they want to feel helpful - do not listen to them. Bed rest for a high risk pregnancy is completely different than RIF. If you hate your job and don’t need to work, by all means, but don’t make major life decisions based on anecdotal medical advice from family. Fertility and pregnancy risk varies within families. My mom has 4 sisters - one had severe endo and needed IVF to conceive in the early 80s, but then had non complicated pregnancies. Another had to do IUI (because it seems like she was miscalculating her ovulation in 1992), and then got pregnant on her own, but had extremely high risk pregnancies and lost a child in childbirth. Then there’s my own mom (and her two other sisters) who got pregnant immediately, and had easy, healthy pregnancies and deliveries into her 40s. Listen to your doctors and seriously consider testing your embryos. Transfers are so physically and emotionally brutal, do what you can to eliminate variables that are prolonging this process. Sending you so much strength and support!", "I would 100 percent agree to PGT test however did you do a receptiva? It sounds like you may have silent endo based on the RIF you’re experiencing and I know Lupron depot can help with RIF. None the less so incredibly sorry you’ve had such a hard time and wishing you all the success", "We did genetic testing on ourselves and weren’t both carriers of anything concerning and did PGT testing on our embryos and only had 4 normal embryos out of 10. We transferred two the first round and then I changed a few diet things (no alcohol, pineapple and pomegranate weekly, 2 Brazil nuts daily and carnivore meal plan) and my doctor did 2 PRP infusions the week of transfer and started me on thyroid meds and blood thinners. She said my recurrent miscarriages and failure to implant were good reasons to start those meds and it worked! We are 14 weeks now with our miracle baby. PGT was a huge aspect of our process"], "link": "/r/IVF/comments/168yurk/advice_repeated_implantation_failure/"}, {"title": "Positive story of gestational surrogacy", "content": "10 months ago I made a dramatic post on this subreddit entitled \"I'm giving up! And I feel ok about it!\" and I left this group. After years of IVF and three losses I knew my body couldn't handle more. \n\nBut... I ended up on a Facebook group for gestational surrogacy and I connected with the most amazing woman who agreed to carry our embryo for us. She had a successful FET in April. I wanted to share that Reddit doesn't really have a Gestational Carrier community, but it is HUGE on Facebook and somewhat on Instagram (I love \"TheBiggestAsk\") account. \n\nI had complicated feelings about asking another woman to carry for me. I honestly had some ignorant beliefs about surrogacy (that it was exploitative to low income women and parents using surrogacy didn't want to carry their own babies, like celebrities that want to avoid stretch marks). And I just want to say, that's the furthest thing from true. What I've found is a community of intended parents who are gay men, trans women, and women who can't carry their own babies like myself. And surrogates who are all wonderful mothers themselves who had easy pregnancies and births and want to share this gift with other families. There are medical guidelines and laws around surrogacy that require surrogates to be mothers who are raising their children, who are financially stable and not low income (cannot receive government assistance) and had uncomplicated pregnancies and births.\n\nI just wanted to pop back into this community to share because I remember how many hours I spent here getting advice, and honestly I was in a really dark place. And for me the path forward with IVF looked a little different than I expected!", "num_comments": 37, "score": 157, "top_comments": ["This makes me sooooo happy! I was a GC last year for my best guy friend in college and we did it all by the book but without an agency. It was THE BEST experience. I feel like my new job is to help un-demonize this for people. I write about our experience on FB but I was the same... so few compadres out there!!!", "That's incredible news. I'm so glad the FET worked. So happy for you!", "Congratulations and thanks for sharing.\n\n>with other families. There are medical guidelines and laws around surrogacy that require surrogates to be mothers who are raising their children, who are financially stable and not low income (cannot receive government assistance) and had uncomplicated pregnancies and births.\n\nThat’s very encouraging. Are you in the US? Can I ask a couple of ignorant questions? \n\nDid your surrogate use your medical insurance or theirs?\n\nWere you in the same city?\n\nAny plans to keep in touch as babe grows?"], "link": "/r/IVF/comments/171eysy/positive_story_of_gestational_surrogacy/"}, {"title": "Rights to embryos down the line?", "content": "My partner of a decade and I (32f 36m) are considering freezing embryos. I already froze eggs last year. We are unsure about kids but it’s a company benefit that seems like we should take advantage! I have some questions about what happens to the embryos in the hypothetical case we don’t use them, or if we do use them and have extra. \n\n- is there a legal agreement we should sign to declare our wishes for the embryos?\n- who has the power to decide when to destroy or donate them? Either partner or both? If for some reason we can’t destroy them who is responsible for paying for storage?\n- if we break up or one partner dies, can the other partner still use them? If so, what rights does the other “parent” have?\n- what else am I not thinking of?\n\nEdit: wow I didn’t realize this would be part of the process at the clinic but it makes total sense! I’ll just make sure my partner and I are on the same page with everything before moving forward\n\nI’m in Oregon if it matters", "num_comments": 19, "score": 6, "top_comments": ["Your clinic will likely have you fill out paperwork to determine what will happen to them.", "Oh yes it was so weird to decide all these hypothetical for embryos we hadn’t even made yet! We got the paperwork beforehand and discussed everything. Also state laws might come into play on your options."], "link": "/r/IVF/comments/15krxmp/rights_to_embryos_down_the_line/"}, {"title": "Retest Haploid Embryo?", "content": "Hi everyone! I tried searching the sub for this topic, and could not find much. During our first retrieval, one of our embryos came back haploid - only having one set of parent chromosomes. Has anyone retested an embryo like this and had a different outcome? \n\nWe plan to biopsy our inconclusive and retest when we do our first transfer. Toying with the idea of doing the same with the haploid, as well. \n\nThanks for any insight!", "num_comments": 1, "score": 1, "top_comments": [], "link": "/r/IVF/comments/13klgsr/retest_haploid_embryo/"}]